[
{"category": "Analytics", "ranking": "1", "app_name": "Clever Ads Marketing Assistant", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Connect Slack with Google Ads, Microsoft Ads, Facebook Ads and Twitter Ads!Improve your productivityClever Ads is the best virtual marketing assistant for marketing teams and advertising agencies that manage PPC campaigns for themselves or other companies:- Ask Clever Ads bot for metrics, graphs, and summaries to evaluate the performance of your PPC campaigns.- Filter the advertising accounts that interest you the most, schedule your reports and configure your alerts.- Get professional PDF Ads Reports ready to customize and share.- Ask for tips on how to improve your advertising strategy. Clever Ads marketing assistant will suggest things like adding a different type of campaign, adjusting the campaign budget, or modifying the campaign target.- Gain access to your own dashboard and customize the way you want to receive the information through your Slack channel.Save timeControl your Google Ads, Microsoft, Facebook and Twitter Ads campaigns in one place and save enough time to enjoy that morning coffee you love so much. Save moneyNot to mention, it’s free!Get Started!1. Add the Clever Ads app to slack2. Connect your your advertiser’s account (Google Ads, Microsoft Ads, Facebook and Twitter Ads supported)3. Access to your dashboard, configure your account, schedule your reports and alerts.4. Go to Slack chat and start asking the bot for metrics, graphs, etc.For any questions or concerns contact our team of tech developers at assistant@cleverads.com"},
{"category": "Analytics", "ranking": "12", "app_name": "Hawke AI", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Morphio’s algorithm detects marketing and analytics anomalies faster and deeper than humanly possible. By connecting your Slack account to Morphio, you will receive real-time alerts about campaign anomalies and site performance, profitable audience segments, and competitor SEO changes. To integrate Slack into Morphio, you will need to subscribe for a paid account within Morphio. For the full Morphio Resource Guide, please visit: https://morphio.ai/support/resources/connecting-slack/"},
{"category": "Analytics", "ranking": "9", "app_name": "HAL", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Connect Ethereum To Your Applications!You can:- Send emails from smart contracts with 1 line of code- Track prices and set alerts on Uniswap or any other liquidity providers- Track MakerDAO’s Collateralization levels and liquidations- Track tokens’ trades, supply, minting and burning- Build bots interacting with DeFi, DEXs and gambling contracts… build any app connected to Ethereum!Start creating a new trigger and choose \"Post to Slack\" action using the official HAL Slack App. You will be asked to allow HAL to post on the channel of your choice. Then click Create and you will start receiving notifications from HAL Slack App for the blockchain event you set!"},
{"category": "Analytics", "ranking": "7", "app_name": "SelectorAIOps", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Selector is a platform for operational intelligence of multi-cloud infrastructure and performance-sensitive managed services. By adopting an AI/ML-based data analytics approach, Selector provides actionable multi-dimensional insights to network, cloud, and application operators. Our customers can meet their service KPIs through seamless collaboration on messaging platforms, search-driven querying with a conversational user experience, and automated data engineering pipelines. Technical and business leaders want to get relevant and instantaneous status reports without writing SQL queries and building new dashboards. Selector supports natural language queries directly integrated into common messaging platforms such as Slack to enable this desire for data democratization, providing a conversational chatbot experience. Users can invoke the SelectorAIOps bot in Slack channel by typing command /select followed by a natural language query. Selector responds to the Slack channel with insights and provides a URL link to the portal with the exact rendering. Additionally, SelectorAIOps bot provides operations information such as alerts and reports in the Slack channel."},
{"category": "Analytics", "ranking": "5", "app_name": "Narrative BI", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Narrative BI is your new best friend for making marketing data fun and easy to manage. It hooks up your data sources to your Slack workspace, so you'll never miss a beat on your key metrics.What's cool about Narrative BI::large_purple_circle: Collaboration: Spark up conversations with your growth team in Slack, making data feel like a friendly chat rather than a boring report.:large_purple_circle: Teamwork Time: Get everyone involved with marketing insights right inside Slack, so you can all brainstorm and bond together.:large_purple_circle: Happy Clients: Keep your clients in the loop by sharing marketing updates right in Slack channels, making them feel like part of the team.:large_purple_circle: Automated Reports and Alerts: Stop being glued to Google Analytics and your advertising dashboards. React only when something unusual happens.:large_purple_circle: Multiple data sources in one place: connect Google Analytics, Google Ads, and Facebook Ads in a few clicks. More sources are coming soon!"},
{"category": "Analytics", "ranking": "10", "app_name": "GRID", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Connect your GRID account to Slack to make it easier than ever to share, collaborate on, and discuss your GRID projects. Imagine if a spreadsheet and a website had a beautiful baby. That’s GRID! GRID is the best of numbers + narrative rolled into one kickass interactive hybrid.With the Slack integration, you’ll receive notifications in Slack when someone starts a conversation in your GRID projects, when your work reaches viewing milestones, when projects are shared with you and when you are added to user groups. It’s a really natural way to continue the conversations you’re already having. Enjoy!"},
{"category": "Analytics", "ranking": "8", "app_name": "ProdCamp", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Slack application for ProdCamp, a public roadmap, multi-channel user feedback collection, and product management platform. This app will notify you of every feedback, and upvotes that come from your public/private roadmap, or whenever anyone of your internal users submits feedback inside the system."},
{"category": "Analytics", "ranking": "11", "app_name": "CrowdTangle Notifications", "supported_languages": [], "pricing": null, "app_description": "CrowdTangle is a social analytics tool to discover and monitor performance of public content on Facebook, Instagram, Twitter, and Reddit. This Slack integration allows users to easily send viral notifications or referral alerts from their dashboards to their Slack channel(s). CrowdTangle is a free tool provided to Facebook partners in news, sports, and entertainment verticals. Please reach out to your Facebook partner manager to request access."},
{"category": "Analytics", "ranking": "6", "app_name": "/Takeaway ChatGPT App", "supported_languages": ["English"], "pricing": "Free", "app_description": "Too busy, no time?:takeout_box: Skip to the /takeaway: An app for Slack to help you catch-up in seconds. Use OpenAI GPT and ChatGPT AI/ML models to surface Key Action Items, discover relevant Books, and explore key Concepts from chat topics.Cut through the noise:- Get the gist of long back and forth conversations- Surface action items from missed and forgotten messages- Discover books and concepts relevant to topics of conversion- Generate a unique poem from chat topics using ChatGPTFree indie app serving you bite sized Slack.---Already installed? Get started with these sample commands:- /takeaway returns the gist of messages in the 24 hours prior to last message- /takeaway 72 returns the gist of messages in the last 3 days (Try up to 336, or 2 weeks)- /takeaway book suggests books related to messages in the 24 hours prior to last message- /takeaway concept finds and explains concepts related to messages in the 24 hours prior to last message- /takeaway poem creates a poem that explore themes found in messages in the 24 hours prior to last messageSee more at https://thetakeaway.app/#gettingstarted---Currently in Open Beta. Send feedback and ideas to support@thetakeaway.appRead the Beta Terms of Use https://thetakeaway.app/#betatermsDisclaimer: This app uses ChatGPT AI model and may return incomplete or inaccurate responses."},
{"category": "Analytics", "ranking": "4", "app_name": "Koala", "supported_languages": ["English"], "pricing": "Free", "app_description": "The Koala App for Slack helps you to stay up-to-date with your prospects/customers and the events they perform right here within Slack. These are just a few things which you will be able to do:• Get Notifications when a high intent event happens• Get notified when an Account visits your website for the first time• Get notified about changes to accounts you're following"},
{"category": "Analytics", "ranking": "26", "app_name": "Centilytics", "supported_languages": [], "pricing": null, "app_description": "Get all reports in your Slack feed. This integration will help your team to receive reports based on the configurations saved in Iris Console.•  Connect your Slack to Iris console in one click.•  Receive reports directly in your selected public channels.•  Schedule reports to deliver information to the right channel at the right time.  •  Manage your team’s efficiency by sharing reports without leaving Slack."},
{"category": "Analytics", "ranking": "2", "app_name": "Crashlytics", "supported_languages": [], "pricing": null, "app_description": "Crashlytics is a powerful and lightweight crash reporting system with detailed reports and real-time alerts.This integration will post a crash summary to a channel in Slack."},
{"category": "Analytics", "ranking": "27", "app_name": "SeekWell", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "SeekWell helps you write code faster and automate reports and alerts in Google Sheets and Slack.Our Slack integration converts conversations to code. SeekWell can process natural language like \"how many users signed up last week?\" and recommend SQL (e.g. SELECT COUNT(1) FROM analytics.users...) based on your past conversations and code. You can also set up automated reports in Google Sheets and send key alerts to Slack.SeekWell supports MySQL, Postgres, Redshift, and SQL Server. The Slack app is a free add-on to the SeekWell desktop app (Mac OS and Windows) which has a 14 day free trial with a monthly subscription fee after."},
{"category": "Analytics", "ranking": "3", "app_name": "Cashfree App", "supported_languages": ["English"], "pricing": "Included with service subscription", "app_description": "The Cashfree app for Slack allows you to get and subscribe to important events on your Cashfree merchant account. We support the following events today - Fetch the API errors in your integration in realtime- Subscribe to success rate alerts We have more events in the pipeline for our app. You can read more here https://docs.cashfree.com/docs/slack"},
{"category": "Analytics", "ranking": "28", "app_name": "YouScan", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "YouScan monitors all major social networks, as well as blogs, forums, and online news, automatically collecting and analyzing 500+ millions of posts daily. This integration allows you to stay updated on all the latest trending posts related to your brand. You can get instant notifications about new mentions and quickly act on them.  Note: This integration requires YouScan paid or trial account.  Contact developers at support@youscan.io"},
{"category": "Analytics", "ranking": "29", "app_name": "AppBeat", "supported_languages": [], "pricing": null, "app_description": "AppBeat monitors websites and cloud services from multiple locations and sends alerts when there is downtime or issue.This integration will post notifications to Slack channel when one of your AppBeat checks is triggered (a change in uptime/downtime).NOTE: AppBeat is paid monitoring service with 14-day free trial. More information about our plans can be found here: https://www.appbeat.io/pricing"},
{"category": "Analytics", "ranking": "24", "app_name": "Instana", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Instana has re-imagined what APM means for Cloud-Native Applications, delivering the first Application Performance Management solution specifically built to monitor cloud-native, microservice, containerized, and orchestrated applications.This app attaches previews to most instana.io URLs, so you see key information already without the need to open the URL."},
{"category": "Analytics", "ranking": "21", "app_name": "CRM Analytics", "supported_languages": ["English"], "pricing": "Included with service subscription", "app_description": "Bring Data to Every Conversation with CRM Analytics for SlackCRM Analytics for Slack makes it easy to access your analytics right where collaboration happens in Slack. Now you can seamlessly find, share, and collaborate on Salesforce reports and dashboards and CRM Analytics items within Slack and stay up to date on all of your data.With CRM Analytics for Slack, you and your team can:Browse and SearchBrowse recent and favorite analytics, or search to find specific items. View details and snapshots of your items.Share and CollaborateShare links to analytics items and snapshots of reports, dashboards, and lenses. Collaborate with the team, and even loop in external stakeholders like partners, vendors, and customers with Slack Connect.Stay UpdatedKeep up to date from anywhere. Subscribe to CRM Analytics dashboards for periodic updates, and import CRM Analytics notifications to get notified when data thresholds are met. Import Lightning Reports and Dashboards subscriptions into Slack. Share all of your notifications and subscriptions to your teammates.Learn the \"Why\" Behind Your DataRun Einstein Discovery on Lightning reports to drive better business outcomes with AI-powered predictions and recommendations. Share relevant and actionable predictions, improvements, and top factors with your Slack channels and colleagues.If you see  \"Restricted,\" please reach out to your Slack admin to enable the app for your company's Slack and Salesforce CRM Analytics users. Share this guide with your operational leaders to make it easy.If this appears as \"Add to Slack,\" the app has already been enabled for your organization. You can follow this user guide to install and start using the app today!Please give us feedback on your experience with the CRM Analytics for Slack app. Your insights are valued and help our product teams improve the Salesforce user experience. Thank you!"},
{"category": "Analytics", "ranking": "23", "app_name": "TrackMage Shipment Tracking", "supported_languages": ["English"], "pricing": "Free", "app_description": "Introducing TrackMage for Slack: The E-commerce Shipment Tracking Solution You NeedAs an e-commerce store owner, keeping track of your shipments is crucial for customer satisfaction. The TrackMage app for Slack saves you time and effort, ensuring you're updated on your shipments' progress. With its user-friendly features, this app empowers you to manage your shipments efficiently and proactively address customer needs.Features & Benefits:Quick Updates: Forget about manual tracking. TrackMage sends you grouped updates on delayed shipments or those with issues, so you can focus on growing your business.Simple Format: Notifications are clear, concise, and easy to understand, allowing you to quickly assess the situation and take the necessary steps to satisfy your customers.Links to shipments Included: TrackMage provides tracking links for each shipment in the updates, this makes it easy for you to take action right away.Personalized Alerts: Customize the app to receive updates tailored to your needs. Adjust alert types, frequency, and preferences, ensuring you get the information that matters most to your business.Seamless Slack Integration: TrackMage fits perfectly into your Slack workspace, improving your workflow and helping your team collaborate effectively to address shipment concerns.By proactively managing your shipments with TrackMage for Slack, you can enhance customer satisfaction and stay ahead of potential issues. This all-in-one tracking solution saves time and keeps you informed, allowing you to focus on what matters most – growing your e-commerce business and keeping your customers happy. Experience the perfect blend of automation and convenience with TrackMage today."},
{"category": "Analytics", "ranking": "20", "app_name": "Digital Command Center", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Welcome to Digital Command Center! Easily monitor your Marketing Cloud Engagement journeys and automations. Leverage our highly customizable interface to detect and take immediate action on errors and abnormal activity. Get started with pre-configured rules, alerts, and calls to action. Expert users have a world of options at their hands, with granular customization of rules, alerts, and actions. Highlights:• Versatile - You can use the app right away as-is or customize it to fit your needs. • Highly customizable alerts - Alert the correct person or team at the right time.• Action oriented - Contextual Slack and platform actions allow for rapid response.• Coming soon! Multiple platform support - In addition to Marketing Cloud Engagement, we'll be adding support for Marketing Cloud Intelligence and Commerce Cloud.This app is included for no additional charge with Marketing Cloud licensesTo learn more about Digital Command Center, please visit: https://help.salesforce.com/s/articleView?id=sf.digital_command_center.htm&type=5"},
{"category": "Analytics", "ranking": "25", "app_name": "Cloverpop", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Cloverpop is the way to keep track of decisions in Slack, free! :rocket::grinning::rage: It’s too easy to lose track of decisions in Slack.• We want input fast, but we're all on different channels, literally.• We need sign-offs now, but it takes legwork to track them down.• We want everyone in the loop, but decisions get lost in the stream.• We forget and rehash old decisions when we can't find them later.:grinning: Now Cloverpop makes it easy to keep track!Project teams and creative, technical and marketing leaders use Cloverpop to decide faster, boost visibility and keep track of decisions in Slack:• Easy: Zero learning curve! Designed to get decisions done without ever leaving Slack.• Powerful: Track decisions from initial discussions to announcements, approvals, and results.• Free: Always free for unlimited decisions, unlimited participants and up to 5 decision drivers.• Secure: Your decisions are secure. Cloverpop is SOC 2 and EU/US Privacy Shield certified.:rocket: Here's how it works.Drive decisions from anywhere in Slack using these five fast features to streamline your decision-making::white_check_mark: Send Decision Polls: Invite teammates to weigh in on decisions you're driving.:white_check_mark: Request Approvals: Run decisions up the flagpole for sign-off.:white_check_mark: Announce Decisions: Share across many channels at once and get buy-in fast.:white_check_mark: Track Results: Follow up to stay accountable and keep decisions on track.:white_check_mark: Find Decisions: Pinpoint decisions in Slack without any noise.Add Cloverpop to Slack today and see how smooth decisions can be!Learn how to make Cloverpop work for your team with our Getting Started Guide.Have questions? Join our Cloverpop Community on Slack."},
{"category": "Analytics", "ranking": "22", "app_name": "Draxlr | SQL DB Dashboards & Alerts", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "AlertsNever miss an update. On Draxlr you can set up alerts on your data. You can set periodic alerts that will give you updates on your data and insights on selected days and times. You can also set up alerts for any data changes. So that when any of the insights change, you will receive alerts on Slack.SQL Query BuilderDraxlr provides an Intuitive User Interface to help you filter, sort, and summarize your data without writing code. Build complex queries that can help you find the deepest insights from your data. Once you have the insights you can save your queries and use them later to set Slack alerts and build Dashboards. If at any point the query builder isn’t enough for your needs you can jump into SQL Query mode and start writing SQL Queries.Visualize data in Graphs / ChartsConvert large datasets to visual elements like Graphs, Charts, and Cards that help you in understanding your data easily and in turn make better business decisions.DashboardsWith the help of saved queries that can be created from the query builder or by writing SQL, you can build multiple custom dashboards. The Dashboards can be very easily shared with anyone or can be kept private. You can share a single Dashboard Item as a Public Link, or an entire dashboard with a PIN-protected Link. Not only can you embed your dashboard on your website or web app, you can either embed a single item or the whole dashboard.Data ExportYou can export your data in CSV and Excel format. You can even filter, sort, and summarize your data and then you can export them in CSV or Excel format."},
{"category": "Analytics", "ranking": "19", "app_name": "SocialPilot", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "SocialPilot is a social media scheduling and marketing tool for social media professionals/power users/newbies or digital marketing agencies alike who'd like to increase their social media presence effectively. SocialPilot helps you schedule social media posts across eight leading social platforms, i.e. Facebook, Instagram, LinkedIn, Twitter, Pinterest, Google Business Profiles, TikTok & YouTube.SocialPilot app for Slack helps you with:An overview of all high-priority pending tasksReal-time notifications of all critical issuesPreviews of social media posts created by your team which require approval"},
{"category": "Analytics", "ranking": "18", "app_name": "DATA", "supported_languages": [], "pricing": null, "app_description": "DATA [Data Analyst Team Assistant], is no ordinary chatbot. It is a unique assistant with an expertise in data analytics and reporting that listens, understands and responds with business insight to empower its users.As its name suggests, DATA is a team assistant, developed to work as part of a team, alongside its human counterparts supporting you in data retrieval and insight analysis. Communicate with your personal AI assistant in natural language, via Slack, email, web interface or mobile app, provide access to your analytic profiles on mydata.ai from both Google Analytics, Adobe Analytics or other analytics data sources.DATA is a paid for service and requires an Analytics Intelligence account to be set up first, to get more info about us please visit https://www.analyticsintelligence.com. Or for a trial plan email sales@analyticsintelligence.com"},
{"category": "Analytics", "ranking": "36", "app_name": "Eletype", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Eletype is a digital marketing assistant that helps teams quickly identify and respond to changes in search and social marketing campaigns. Unlike other analytics tools, which require teams to log in to additional accounts and dashboards, Eletype works within your existing products like Slack to make campaign management collaborative and seamless . Because digital marketing needs a CYA solution ASAP!- Anomaly tracking spots deviations in key success metrics like conversions, clicks, quality score, relevance, and sentiment. - Campaign budget monitoring identifies major spikes and anomalies in your spend.- Landing page checks ensures that your ads are never pointing to dead or slow pages.Eletype works with Google AdWords, Facebook, and Instagram, but we are currently working on new channels, so let us know your thoughts!Eletype is free for 1 ad account.  If you like what we are building, please contact us to set up your paid account. Pricing and additional details about Eletype can be found at www.eletype.com."},
{"category": "Analytics", "ranking": "17", "app_name": "NotifiMe", "supported_languages": [], "pricing": null, "app_description": "NotifiMe is an automation and marketing data reporting tool that alerts you about any mentions of your tracked keywords right in your team’s Slack. To get started, install the bot and add some keywords. More at: https://notifime.appA paid account is required to use the full functionality of the app.Contact developers at support@notifime.app"},
{"category": "Analytics", "ranking": "15", "app_name": "Sunrize", "supported_languages": ["English"], "pricing": "Free", "app_description": "Employee automatic work time trackingFor hybrid or remote workplaces, it is hard to know when your people are going to be online, and whether it is a good time to ask for a spontaneous meeting without ample planning ahead of time. All of these troubles can be solved by our automatic time punch card — Sunrize.Automatically logs employees’ online and offline time right in Slack.There is no need to ask everybody to do attendance checking such as manually check-in or check-out, Sunrize will keep track of the online status and display aggregated graphs for you to understand your employees’ work hour trends for remote work.Sunrize makes it much easier for employee time tracking and managing time logs. Sunrize delivers valuable insights in non-invasive ways to help companies to understand their remote workplace, recognize hard workers, and suggest giving awards to engage their people better.  Install and get started in seconds:* No setup required!* Download Sunrize into your organization in Slack* Visit the admin dashboard located at Sunrize’s Home Tab to understand how your organization operates (access to this dashboard will only be available to the app installer).You can request adding additional admins by emailing us at: support@sunrizeapp.com. If you have any feedback or feature requests, feel free to email us as well."},
{"category": "Analytics", "ranking": "14", "app_name": "Blockspring", "supported_languages": [], "pricing": null, "app_description": "Blockspring lets you configure your own Slash Command to do things like pull reports from Google Analytics, search Bing, YouTube, or Wikipedia, and even send emails, Tweets, and more."},
{"category": "Analytics", "ranking": "13", "app_name": "GetResponse", "supported_languages": [], "pricing": null, "app_description": "With the GetResponse-Slack integration, you can receive notifications on one or more channels to keep you updated on:• Subscribes and unsubscribes - notice contains the subscriber’s name, email address, and a link to a GetResponse contact search. • Newsletter send is complete\u2028 - notice includes a link to an analytics page with instant information on campaign performance.• Opens and clicks during the first 24 hours after you sent a newsletter - notice includes the click and open rate for the first 24 hours of a newsletter.• Opens and clicks for a selected campaign - a live view of campaign performance. The frequency of notifications depends on the type of message and the activity level within your campaign. You can receive a notice with an hourly summary or every time someone subscribes or unsubscribes. You can also change your settings to receive no notifications until there is a new open or click. When the newsletter send is complete, you can get a notice instantly or if you prefer 24 hours later."},
{"category": "Analytics", "ranking": "35", "app_name": "Metashield Bot", "supported_languages": [], "pricing": null, "app_description": "Metashield Clean-up (https://metashieldclean-up.elevenpaths.com) is a solution from ElevenPaths for analyzing and cleaning files metadata. Metashield Bot is a multiplatform bot that offers all the same functionalities as Metashield Clean-up. This tool facilitates user privacy and security protection in a friendly, intuitive and multiplatform way, just as Metashield guarantees. In addition, Metashield Bot provides a number of additional benefits, such as the intelligent analysis of office documents, which searches for malware by using our analysis technology 'DIARIO'.More info -> https://msbot.e-paths.com/"},
{"category": "Analytics", "ranking": "33", "app_name": "Tableau", "supported_languages": ["Chinese", "English", "French", "German", "Japanese", "Korean", "Portuguese", "Spanish"], "pricing": "Paid with free trial", "app_description": "Stay up-to-date on your data right in Slack, where collaboration happens. With the Tableau App for Slack, you can receive notifications and snapshots of your analytics for data-driven alerts, sharing activity, and comment mentions. And now, you can easily search and share Tableau content in Slack.Admins can easily connect their Tableau site to a Slack workspace to enable these features for their entire org. Note: If you have problems connecting, talk to your Tableau admin. Help and feedback    • Tableau for Slack    • Learn how to connect Tableau to Slack    • What is Tableau?    • Catch up on the latest features"},
{"category": "Analytics", "ranking": "32", "app_name": "CotoGoto for Noby", "supported_languages": ["Japanese"], "pricing": "Free", "app_description": "CotoGoto（コトゴト）は、人工知能との会話をライフログとして記録し、ライフログから作業時間（作業場所・プロジェクト単位）を記録、感情解析をしてモチベーションを記録します。解析結果から自分自身のコンディションの気付きを支援するためのサービスです。CotoGoto for Nobyを使用すると、次のことができます。・/nobyを使用して、Slackからノビィを通じてCotoGotoに会話を送信できます。・ノビィと会話をすることで、作業の開始や終了を伝えることができます。（タイムトラッキング）・ノビィと毎日会話をすることで、感情解析を行い、気持ちの変化が見えるようになります。・その他にもいろいろな会話を楽しむことができます。会話の中のキーワードに反応してBotにいろいろなコマンドを送信します。・AIとの会話のコツについてはこちらのリンクを参照してください。https://docs.cotogoto.ai/talk・自分の気持ちを知るについてはこちらのリンクを参照してください。https://docs.cotogoto.ai/know_your_feelings"},
{"category": "Analytics", "ranking": "31", "app_name": "Raven", "supported_languages": [], "pricing": null, "app_description": "Thousands of marketers use Raven to schedule marketing reports, discover on-page SEO issues, and manage their marketing campaigns.Automating reporting processes saves countless hours since you no longer have to deal with spreadsheets or pasting together data from multiple sources. You can finally report on rankings, analytics, SEO, social media, and advertising data all in one place.Connecting Raven and Slack gives you real-time information about your marketing campaigns. Raven customers can receive notifications when an on-page SEO audit is complete, when someone adds or removes a link to their website, and when a scheduled report is sent to a client."},
{"category": "Analytics", "ranking": "34", "app_name": "Cryptocurrency Alerting", "supported_languages": ["English"], "pricing": "Free", "app_description": "Set customizable alerts on important metrics within the Bitcoin, DeFi and wider Crypto ecosystem.  In addition to price alerts, we detect exchanges listings, BTC & ETH wallet transactions, the BTC Mempool size, and other on-chain metrics.Key Features* Price Alerts - Realtime, customizable price alerts for over 9000 different cryptocurrencies across 30+ top crypto exchanges, including Coinbase Pro, Binance, Uniswap, BitMEX, FTX, Bittrex, Bitstamp, Bithumb, Kraken, Bitfinex and dozens more* Exchange Listing Alerts - Immediately detect new and upcoming exchange listings* Percentage-based Price Alerts (aka volatility alerts) * Receive periodic price notifications at regular time intervals * Wallet Watch - Transaction monitoring for BTC, ETH and any ERC-20 token* Bitcoin mempool size alerts* BTC Dominance Alerts* Crypto Marketcap Alerts * Blockchain Metric Alerts - for on-chain data, such as block height, difficulty and more.Track Bitcoin, Ethereum, XRP, Chainlink, Uniswap, BNB and over 9000 other altcoins.  Measure prices in real-time relative to USD, BTC, EUR, GBP, and dozens of other fiat currencies and stablecoins.We offer no financial or legal advice."},
{"category": "Analytics", "ranking": "49", "app_name": "ChartMogul", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "The best teams in SaaS use ChartMogul’s subscription analytics platform to measure, understand, and grow recurring revenue.Get real-time updates or weekly summaries of your new business, expansion, churn, and contraction directly in Slack.Keep your team pushing for new clients, celebrate in the wins, and respond to concerns with MRR notifications in any channel you choose. Start your 14-day free trial today at chartmogul.com."},
{"category": "Analytics", "ranking": "48", "app_name": "Locowise", "supported_languages": [], "pricing": null, "app_description": "All your social media analytics and social reporting in one place. Accurately. Quickly. Beautifully. Locowise gives brands and agencies actionable insights to improve their social marketing efforts and to send and schedule social media reports to your Slack channels easily."},
{"category": "Analytics", "ranking": "47", "app_name": "SEC Filing Bot", "supported_languages": ["English"], "pricing": "Paid", "app_description": "SEC Filing Bot brings SEC data into Slack and MS Teams. Have instant access to the day's newest funds, the amount raised, and more. Supply your sales team with intent data to close more new business"},
{"category": "Analytics", "ranking": "57", "app_name": "Hyperia", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Customer Intelligence to align your team.  Hyperia takes client communications and transforms them into a recap of salient points, aligning your team with a shared understanding of customer needs. Hyperia uses AI to transcribe and summarize voice and video communications. After the conversation is processed, use threaded chat, video clipping, and tagging to facilitate seamless handoffs and collaboration around critical customer interactions."},
{"category": "Analytics", "ranking": "59", "app_name": "Workbench for Slack", "supported_languages": ["English"], "pricing": "Paid", "app_description": "Workbench for SlackConnect your Slack instance to Workbench and deliver continuous data-driven insights that can help you extract maximum business value from your investment.- Advanced Slack utilisation metrics- Easy to set-up, faster time to value- Advanced filtering and demographic comparison- Organisational network analysisInstall via the Workbench platform and contact us to have a demo or for more information"},
{"category": "Analytics", "ranking": "58", "app_name": "Monte Carlo", "supported_languages": ["English"], "pricing": "Paid", "app_description": "As businesses increasingly rely on data to power digital products and drive better decision making, it’s mission-critical that this data is accurate and reliable. Monte Carlo’s Data Observability Platform is an end-to-end solution for your data stack that monitors and alerts for data issues across your data warehouses, data lakes, ETL, and business intelligence.The Monte Carlo app for Slack provides timely, in-channel alerting of data quality issues, as well as the ability to interact with incidents by replying in threads to notifications. By connecting directly to alerts via our web-based data observability platform, our Slack integration allows data teams to be alerted to and triage issues as they arise through the channels they use most.If you'd like to learn more, including about Monte Carlo's pricing model, please reach out to info@montecarlodata.com!"},
{"category": "Analytics", "ranking": "56", "app_name": "Uptrends", "supported_languages": ["Dutch", "English", "French", "German"], "pricing": "Paid with free trial", "app_description": "Uptrends monitors your websites and online applications and generates alert notifications based on your requirements. As Uptrends' alerts are traditionally sent to e-mail and SMS/text, these alert messages can in addition be sent to one or more Slack channels, allowing your team members to respond to incidents as a group, as well as individually."},
{"category": "Analytics", "ranking": "55", "app_name": "LeadDyno", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "LeadDyno is a service that allows websites to quickly create an affiliate or referral marketing program.The LeadDyno Slack app posts notifications of new leads, purchases, and affiliate activity from your LeadDyno account into a Slack channel."},
{"category": "Analytics", "ranking": "54", "app_name": "TimeBot", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Trusted by more than 10,000 companies using Slack around the globe, TimeBot helps teams to manage time off requests, vacations, work from home and absences.For managers and administrators:• Setup multiple teams and approve their time off requests• Approve or reject new time off requests directly from Slack• View history of time off requests for all team members• Sync with Google or Outlook Calendar to see team schedule on a calendar view• Set the limit on annual PTO days and always know how many days remaining• Flexible announcements and notifications about upcoming holidays and time off• Setup multiple approvers for a team or allow automatic approval of absencesFor office and remote team members :• Request a time off in seconds without leaving Slack!• Always know how many days off you have remaining• Know who from the team is off or working remotely• TimeBot can update your Slack status when you are OOO• Disable approval of requests (if no approval from manager required)NEW! Schedule Slack messages with TimeBot:• Schedule Slack messages for later delivery• Use a fast and handy shortcut :zap: to schedule a message to be sent in the future• A quick text command that's easy to use \"/later Hey team - please review this document in the morning\" • You can choose a date and time when the message would be delivered• Schedule messages for delivery in channels or direct messages• Respect business hours of your colleagues if you are in different timezones and deliver messages when they come online• Working late hours? Share updates with your teammates through scheduled messagesWe'll help your company in many HR tasks, and it's all without leaving Slack.Get started for FREE.For teams on the Premium plan, we also offer the best attendance tracking and time tracking experience."},
{"category": "Analytics", "ranking": "51", "app_name": "Status List", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Get instant notifications from your Status List monitors in your Slack channel. The right people get notified when things are happening. Get monitor statuses and a quick link to the dashboard in-context.Status List is an uptime and performance monitor for HTTP endpoints. When things start failing we provide instant updates with full HTTP transcripts and timing events for things like TLS and DNS lookups."},
{"category": "Analytics", "ranking": "50", "app_name": "Flowtrace", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Flowtrace is an analytics engine for companies wishing to improve their internal workings and processes to gain better productivty and collaboration.We offer free employee surveys (eNPS and team effectiveness) which is combined with premium AI analytics based on SPACE framework.Our web application is used by managers and leadership teams to investigate, and improve cross-functional processes, inter-team collaboration patterns, and cultural norms.Flowtrace bot reveals deep-work time, meeting culture and collaboration patterns to all employees while maintaining right to privacy. We also support employee nudges to insitigate the cultural transformation.Note: We do not have access to your one-to-one or group conversations nor we share personalised insights with anyone in your company. All metrics are aggregated and anonymized at a team level or above."},
{"category": "Analytics", "ranking": "46", "app_name": "ClosingBell", "supported_languages": ["English"], "pricing": "Free", "app_description": "Type \"/quote [symbol]\" to request information about any U.S. equity or cryptocurrency in a public channel, private group or direct message. For example: \"/quote AAPL\"Also:- Use \"/chart [symbol]\" to request a stock chart.- Use \"/earnings [symbol]\" to request earnings dates, consensus, predictions, and actuals.Brought to you by ClosingBell.https://closingbell.co"},
{"category": "Analytics", "ranking": "52", "app_name": "Humantelligence", "supported_languages": ["English"], "pricing": "Free", "app_description": "Communicate more effectively with your coworkers and contacts using the Humantelligence Slack bot.Leveraging the Humantelligence talent analytics platform through Slack enables you to increase the effectiveness of your communication and collaboration and deepen your understanding of your coworkers. You can view your contact's Humantelligence profile or view powerful tips about your Slack channel colleagues, providing insight into their motivators, behaviors, and work energizers, and tips for successfully communicating with them… enabling you to tailor your message.We help businesses:- Understand and manage culture using 28 of the most important behavior, motivator, and work energizers \"culture\" levers.- Tie aspirational culture to reality, implementing cultural roadmaps for every team, to build a culture of performance."},
{"category": "Analytics", "ranking": "44", "app_name": "ChatAcuity", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "The better way to listen, learn and engage with your teamDashboards for your team!Sometimes the stream of Slack messages seems endless - we get it!  Our Key Phrases feature pinpoints trending words and themes over a period of time. In addition, message activity and busiest-hours analysis highlights your organization's prime collaborative windows, allowing you to schedule team events more productively.Track workspace sentimentKeep your finger on the pulse of employee sentiment and sentiment trends, allowing you to address issues early and improve performance across your organization.Monitor team engagementAnalyze @mentions and message activity to understand if an employee is over-leveraged. Identify top information-seekers and enable them with training or extended onboarding.Leverage member expertiseRecognize the top communicators in any channel to explore their subject matter expertise across your operation.Non-intrusive Check-inPrivate channels, groups, and direct messages are not enabled or monitored - only communications in public channels the app has been invited to are digested.In-Slack SummariesGet a brief 24-hour summary of individual channels or your entire workspace with the included /acuity commandWhy scroll when you can see the big picture?Installation begins a no-obligation, one week free trial, after which we have paid monthly plans to accommodate any sized workspace.  After installation you will be asked to provide an email address for your analytics dashboard login.  This email address is the only address we will use to contact you, and we do not share the email address with any third parties.Visit https://chatacuity.com for more information!"},
{"category": "Analytics", "ranking": "45", "app_name": "AppTweak", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "You can now access your AppTweak Daily ASO Report on Slack and check your daily apps' performance wherever you are. By adding this integration, you will receive the daily progression of your AppTweak followed apps directly in the Slack channel of your choice. Performance indicators include the daily progression of your app's category rankings and Top and Worst 5 Keywords Rankings Growth."},
{"category": "Analytics", "ranking": "43", "app_name": "Better Stack", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "betterstack.com alerts the right person on your team when your website goes down. It combines the fastest uptime monitoring with built-in incident management and public status pages.With the Better Stack integration for Slack you can:* Receive the fastest downtime alerts that include a cause, screenshot, and error logs* Look up the current on-call contact and receive updates* Trigger incidents for critical events like when the ‘Order’ button is missingIt takes only 3 minutes to set up.We don’t just tell you your site went down, we tell you whyYou get a screenshot and error logs with every incident alert to help you identify what went wrong and resolve it quickly. A detailed event timeline lets you know exactly what happened, collaborate on the solution, and prepare post-mortems.Easy on-call duty schedulingConfigure your team’s on-call duty rotations directly in your favorite calendar app and escalate the incident to other colleagues when there’s no reply. Share your uptime with a status pageCommunicate the status of your services and build confidence in your product with beautiful status pages.SupportFAQ: https://betterstack.com/docs/uptime/frequently-asked-questions/Email: hello@betterstack.com"},
{"category": "Analytics", "ranking": "53", "app_name": "Moodbit", "supported_languages": [], "pricing": null, "app_description": "Have you ever dreamed of having a highly engaged and productive team? Moodbit is here to help you get your dream team :raised_hands:.  Moodbit is an app for everyone in the company: managers, employees, executives and more. Moodbit helps to provide a clear understanding of what is going on in the workplace. We analyze your team’s social interaction and provide them with analytics about their mood scores :100:and engagement :bar_chart:with the use of emotion-sensing text-recognition technology. To improve your team’s emotions, Joy (Moodbit’s bot) will send out recommendations to boost: Productivity :chart_with_upwards_trend:Well-being :muscle:Relationships :couple:Mood :grinning: and Job Satisfaction 🥳Joy also sends out a weekly survey that asks employees the important questions :raising_hand:: How was their week?What were the biggest challenges of the week?Did they complete the suggested action(s) that Joy sent to them?These responses allow us to record their personal mood journey in their simple-to-use dashboard. Give it a try for free for 30 days. After that, you will become so in love with the impact that Moodbit & and Joy! is making on your team that you will have to change to the paid subscription. Are you ready to have more engaged, productive and happier employees? All you have to do is download Moodbit and the changes will follow! :question:Questions? Contact support at info@mymoodbit.com"},
{"category": "Analytics", "ranking": "42", "app_name": "Enable Us by Mindtickle", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Enable Us by Mindtickle is a leading Digital Sales Room solution that empowers sellers to build digital buying experiences that engage buyers and get deals done faster. Sellers curate relevant content, mutual action plans, and signable documents tailored to the prospect’s needs. Combined with Slack, our Digital Sales Room improves sales productivity, accelerates revenue growth, and deepens customer relationships. With our Slack integration, your sellers receive real-time notifications when prospects:- Visit your digital sales room or specific sales asset- Share content links- Initiate a chat in the Digital Sales Room- Reply to a chat in the Digital Sales RoomYou can configure which alerts to receive and designate the Slack channel for the notifications. Enable Us by Mindtickle requires a paid subscription to use."},
{"category": "Analytics", "ranking": "41", "app_name": "Columns", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Columns make it super easy for our users to build and share data stories and data apps. Our mission is to make data storytelling simple, fast, and accessible for any people with any data.As part of our mission, we continue building this app to help our users to communicate data insights and data stories all on the common workspace they use every day.It's free for anyone working with shared data, if you find this app useful and would like to do the enterprise-level integration, please talk to us (https://columns.ai/contact), we promise the best option that helps you make progress daily."},
{"category": "Analytics", "ranking": "40", "app_name": "VWO", "supported_languages": ["English", "Japanese"], "pricing": "Paid with free trial", "app_description": "VWO is world’s leading testing and conversion optimization platform that enables growing businesses to optimize their web experience across desktop, mobile, and other devices, to deliver a unique experience. Our WYSIWYG (What You See Is What You Get) Visual Editor is thoughtfully designed for ease of experimentation. You can launch a test within minutes without any help from IT. With industry-leading 24/7 support and a 99% customer satisfaction rate, servicing a billion requests a day while ensuring 100% uptime – VWO is built for Enterprises! We understand the pain of unconnected platforms and how hard are they to manage. That's why we are here to help. With this new integration, you can seamlessly track the status of your campaigns and see the role changes in your VWO account.Get Slack notifications whenever the status of your campaign is changed. The moment your test is created in drafts or goes live, your Slack will go ding! This will help you keep track of your experiments in real-time, right in your central communication hub. Isn't that amazing? But wait, there's more...You also get notified on Slack if any new users are added/removed, and even if there are any role changes in your VWO account. For teams experimenting at scale, this would help in understanding what your team members are up to."},
{"category": "Analytics", "ranking": "39", "app_name": "App Connect Bot", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "App Connect Bot allows you to monitor your iOS apps directly from Slack. It will send you notifications in real-time when reviews are posted and more! With App Connect Bot for Slack, ensure you never miss a beat with what’s going on with your app. Here are some of the features available:• Get real-time notifications of new reviews• Translate reviews directly from Slack• Respond directly to user reviews directly in Slack • Personalized AI suggestions for responding to user reviews"},
{"category": "Analytics", "ranking": "64", "app_name": "App TractionBot", "supported_languages": [], "pricing": null, "app_description": "TractionBot reports on your key metrics, and how you're doing towards your goals. To get started, I'll help you connect me with your Google analytics account. :dart: 1: Define your goals for:- Total users- Active users- Retention- Sessions- Time spent:chart_with_upwards_trend: Then you can ask me for:- Daily report- Weekly report- Monthly report:thinking_face: Wondering what all this means? :nerd_face: If you want to learn more about the numbers I give you, just ask me to tell you about retention, or define active users. Go from :money_with_wings: to :money_mouth_face:  TractionBot is free for 14 days, then it's $19/month. You can stop your subscription at any time."},
{"category": "Analytics", "ranking": "37", "app_name": "Sensor Tower Custom Alerts", "supported_languages": ["Chinese", "English", "Japanese", "Korean"], "pricing": "Free", "app_description": "Receive alerts when a wide range of App and Publisher events occur, from a spike in performance to updated metadata such as a new Icon or Description. Stay up-to-date with less effort. Skip the daily Store searches and get notified with important changes in the Apps you care about. Valuable insights in your email: alerts are available even for \"hidden\" changes such as updated Keywords."},
{"category": "Analytics", "ranking": "38", "app_name": "FullStory", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "FullStory is a digital experience intelligence (DXI) platform for product, development, marketing and customer support and success teams. FullStory provides digital experience analytics, on-the-fly conversion funnels, advanced search capabilities, video-like replay of real user sessions, and robust debugging and developer tools—all while integrating with leading SaaS products.When you enable this integration, all notes and alerts are sent right to where you spend most of your time, Slack."},
{"category": "Analytics", "ranking": "90", "app_name": "Mode", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Mode is an advanced analytics solution providing the ideal environment for an analyst workflow—writing SQL, analysis in Python and R notebooks, visualizing results, and sharing insights—all in a single, seamless experience.With Mode and Slack, you can share your team’s data directly where the conversation is happening, speeding up time to insight and encouraging collaboration.- Share instantly: Finish up exploratory analysis using SQL, Python, or R, then copy and paste your Mode report into Slack to see previews unfurl directly in the context of your team's conversation.- Encourage collaboration: Share Mode reports on Slack to encourage stakeholders to answer their own questions.- Keep data in the conversation: Layer charts on top of queries that track KPIs, then use the scheduler in Mode to regularly send reports to Slack.The integration allows analysts to share data and meet stakeholders where the decisions are being made, in both public and private Slack channels."},
{"category": "Analytics", "ranking": "88", "app_name": "Rebrandly | URL Shortener", "supported_languages": [], "pricing": null, "app_description": "Trusted by some of the world's biggest brands, Rebrandly is the complete branded link management solution that empowers companies and individuals to put their brand name on every short url that they share.Link your Rebrandly and Slack teams to rebrand URLs directly within Slack, creating a seamless workflow for branding links, saving your team valuable time and increasing productivity.Use Rebrandly for:• URL shortening• Traffic routing• Click tracking and reporting• Link retargeting• Managing all of your links in a single dashboardCommandsYou can use the following commands:/rebrand myurl.comCreate a branded short URL./rebrand myurl.com domain mydomain.linkIf you have more than one domain, you can spcify which you'd like to use to create a branded short URL. For example \"mydomain.link\"./rebrand show domainsSee a list of all available domains./rebrand myurl.com slug myslugCreate a branded short URL with a specified slug (slashtag), for example, \"myslug\". Alternatively, you can customize your slug by using the keyword \"slahstag\" instead of \"slug\" in the command string. You can also combine the \"domain\" and \"slug\" (or \"slashtag\") keywords./rebrand settingsChange your preferences at any time by accessing your settings./rebrand logoutDisconnect your Rebrandly account from Slack./rebrand helpSee command instructions."},
{"category": "Analytics", "ranking": "84", "app_name": "Revoluspace", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Hybrid work makes collaboration and office management challenging as it's hard to know who comes to the office.With Revoluspace always know who will be in the office and book a desk in a few clicks, all inside Slack.:link: Enforce your remote work policy.Revoluspace allows you to integrate any hybrid work policy.:spiral_calendar_pad: Eliminate the back and forth of hybrid coordination.Revoluspace allows employees to visualize who comes to the office and encourages them to get together!:star: Follow your favorite co-workers.Your employees can visualize when the people they care about most come to the office.:office: Easily manage office occupancy.Your employees can see in which workspace(s) their co-workers are in and book hot desk in a few clicks.:repeat: Save time with weekly routineAdd your weekly routine and Revoluspace will automatically apply it for you every week.:bar_chart: Space Optimization.Adapt your office space using data analytics."},
{"category": "Analytics", "ranking": "87", "app_name": "askR.ai", "supported_languages": [], "pricing": null, "app_description": "Chat with your data!You have data but you don’t like the technical process to access them?Let askR.ai make them talk for you. Simply ask your business question and our artificial intelligence will give you the answer.To be able to install askR.ai on your Slack workspace, you must be a customer and have a paid account. Then you simply have to log in to your askR.ai administration console, go to your API Key, open \"Communication channel\" section and click on the \"add to Slack\" button.In order to personalise its answers and also for security reasons, askR.ai requires to have access to the user's email address. We believe privacy is a fundamental human right, so we don't share this email with any other companies or organisations. Please see our privacy policy terms for more information."},
{"category": "Analytics", "ranking": "86", "app_name": "Proper", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "The most engaging feedback and recognition platform for Slack :penguin:Continuous feedback, employee recognition, polls, & anonymous discussionsFree to try for 30 days, no credit card required :money_with_wings:Continuous feedback your team will actually use :ear:• Foster professional growth without adding new tools or leaving Slack• Give, request, and share feedback in real time• Comprehensive admin settings and optional approvalsConvert kudos emojis into real cash incentives :moneybag:• Take the work out of recognizing team members who make a difference• A fun and easy way to promote your values and boost engagementSimplify data driven decisions with the most feature-rich polls in Slack :bar_chart:• Get feedback in seconds, not hours, with anonymous and identified votes• Build polls using templates or your own options with extensive customization settingsLearn how your team really feels with anonymous discussions :speech_balloon:• Take the pulse on any issue without compromising privacy• Optional anonymity empowers all users to contribute to discussions• Animal emojis tie anonymous responses together while keeping identities privateLive, in-Slack support :hand:• You don't have to leave Slack to get help with Proper• Our apps have live support built in: just click the Help button in the App Home to open a ticket• Our support team will quickly respond in the Messages tab of the App HomeSleep well knowing your data is secure :lock:• Your data is kept private using granular scopes• Proper only joins the channels that you intend, and the app cannot read messages• Admins have control over channel joining behavior by default and we only store what Proper needs to function• Our API uses TLS 1.2 and your data is encrypted at restLearn more on the app page :popcorn:Check out the docs :book:From Happybara: Productive by nature"},
{"category": "Analytics", "ranking": "85", "app_name": "IsDown", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Easily monitor all the services that impact your business from one place. Keep your team in the loop with instant notifications when a service is experiencing problems. Get a dashboard that shows you your services' current status, access to key metrics, and historical data for each of your monitored services.You can set up our Slack integration to start getting outages alerts for all your third-party services. When setting up Slack, you will choose which channel should IsDown post their messages of ongoing outages."},
{"category": "Analytics", "ranking": "89", "app_name": "PushMetrics", "supported_languages": [], "pricing": null, "app_description": "With PushMetrics your team has access to all your data directly in Slack. Request data from your SQL database or Tableau ad-hoc & directly in Slack, receive alerts when KPIs change and automate your recurring reports.Want to increase visibility of your company data & metrics?Want to receive alerts in the moment change happens?Want to make access to reports & dashboards really easy for your team?We've got you covered:• :checkered_flag: Use /pm to browse through all your available dashboards, metrics and stored queries and publish them in any channel• :mag_right: Use /pm <searchterm> to load data instantly• :timer_clock: Schedule Reports to send your most important numbers to your channels frequently• :recycle: Give your team the power to review the latest numbers with one click on Reload• :alert: Set up intelligent alert rules to monitor your KPIs and receive alerts directly in Slack.To use the PushMetrics Slack app, you will need a paid subscription of PushMetrics. Free Trial available!"},
{"category": "Analytics", "ranking": "83", "app_name": "PBXDom", "supported_languages": [], "pricing": null, "app_description": "PBXDom is a web application call accounting and analytics service that lets your team keep an eye on call activities and reporting.PBXDom  helps SMEs to Enterprises  better understand their phone system activity, *You lose money every time the sales department misses a phone call*You will have unsatisfied customers if they can’t reach your service teamYou know how they say information is power? You first need to be able to capture and then analyse it, and that is essential what we do.This integration will allow you to receive updates in a Slack channel when an alert is triggered in PBXDom. For example, you can set when someone calls on your support phone number, automatically send call information to Slack channel, Or you get notifications on your Slack channels each time missed calls occurred.You can try our service free for 14 days,  after which you can upgrade to one of our paid plans.We support most major business phone systems."},
{"category": "Analytics", "ranking": "81", "app_name": "CloudCostControl", "supported_languages": [], "pricing": null, "app_description": "CloudCostControl helps you keep track of your AWS costs by providing a daily graph for your AWS bill for the last few days directly into Slack. This helps you notice any unexpected costs and keep you within your budget. It provides a /cloudcostcontrol slash command that can be used to configure and see your report."},
{"category": "Analytics", "ranking": "79", "app_name": "SQLBot", "supported_languages": [], "pricing": null, "app_description": "SQLBot lets you run SQL and get results into Slack. Setting it up is super easy - connect to your database, write SQL, and call your report from Slack. Connect to Postgres, SQLServer, and MySql. Schedule reports and call them in real time using \"/sqlbot [report_name]\" or \"/sqlbot help\" for additional commands. SQLBot is a paid service with no obligation and comes with a free 30-day trial."},
{"category": "Analytics", "ranking": "78", "app_name": "Peel", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Peel is the easiest way to actively monitor your Shopify store revenue, customer cohorts, and identify key drivers of growth. We automate the repetitive work of the business analyst and serve up critical business metrics and customer cohort analysis. Understanding your business's health is now as easy as checking the weather - you just need to check Slack!The experienced product team behind Peel couples machine learning with secure data connections to offer a smarter approach to data analytics for teams on Slack.Peel makes it easy (no code) for you and your team to be data informed so you can make strategic data driven decisions. You don’t need to be an analyst or engineer to use Peel - it is truly meant for anyone who can read. No data modeling, and coding required. Set it up in less than 2 minutes.HOW PEEL WORKS::one: Connect your Shopify account to Peel in one step:two: Connect your Slack workspace to your account:zap::computer:Peel will do the analysis:baby_chick: Highlights the top segments that drive revenue and sends you the most important analysis!WITH PEEL YOU: :x: Never Code :x: Never write SQL :x: Never create queries in a WYSIWYG template :x: Never create dashboardsAll you do is (only once) explain your database in plain English, and then read the reports we send every day. Have questions or want to learn more? Drop us a line at hello@peelinsights.comContact developers at hello@peelinsights.com"},
{"category": "Analytics", "ranking": "82", "app_name": "Hero by Happyforce", "supported_languages": ["English", "Spanish"], "pricing": "Paid with free trial", "app_description": "Hero by Happyforce brings anonymous employee feedback and recognitions to your Slack channel.Happyforce helps leaders and companies to boost employee engagement, retain talent, and motivate their teams.We do so by continuously measuring the health of your team's work environment across more than 20 cultural key indicators, by creating a safe space where your employees can leave honest feedback, and by promoting a culture of recognition aligned with your company's values.Expect Hero to ping you when it's time to leave feedback, answer a survey, or something relevant happens in your company.Please note that to use Hero, you need an active Happyforce account.Find more about Hero by Happyforce at: http://docs.myhappyforce.com/articles/4108675Learn more about Happyforce and register for free at: https://www.myhappyforce.com"},
{"category": "Analytics", "ranking": "80", "app_name": "Medallia", "supported_languages": ["Chinese", "Dutch", "English", "French", "German", "Italian", "Japanese", "Korean", "Portuguese", "Spanish"], "pricing": "Paid", "app_description": "Medallia Experience Cloud is an experience management platform that helps companies put customer and employee experiences at the center of their business.  The platform brings together the most comprehensive set of capabilities for collecting customer and employee feedback, analyzing the results and bringing insights to employees for customer-centric action.With the Medallia for Slack integration, you can unlock the following features to drive a customer-centric culture within your teams- Notify employees to take action on feedback and close the loop with customers- Power feeds into public channels to provide broad visibility to experience data across teams and departments - Collect feedback from employees to improve the employee experience"},
{"category": "Analytics", "ranking": "77", "app_name": "KickFire", "supported_languages": ["English"], "pricing": "Free", "app_description": "Tap into your company's invisible pipeline by identifying anonymous web visitors showing real-time buying intent for your products and services with KickFire LIVE Leads and Slack.KickFire’s Slack app allows you to sync automatic, real-time notifications to your Slack channels when target companies visit or specific take actions on your website. This allows you to take immediate action and engage potential leads at the peak of their interest. Receive instant Slack channel notifications from KickFire LIVE Leads:When a visitor is on your target account watchlistWhen a visitor matches your predefined LIVE Leads scoring criteriaWhen a visitor’s identified company views your website for the first time (identify net-new accounts)*Using KickFire’s Slack app is limited to KickFire LIVE Leads customers only."},
{"category": "Analytics", "ranking": "76", "app_name": "Cloudnosys", "supported_languages": [], "pricing": null, "app_description": "Cloudnosys is a security compliance and monitoring tool. The platform aims to help its customers get notifications on different integrations, such as Slack itself. The bot will let you know immediately if something went wrong with your deployment on Azure or AWS.In order for anyone to use this app, one needs to Signup for a Cloudnosys account first at https://pro.cloudnosys.com and then you can use our slack app integration feature inside our dashboard via the integration tab found in the side menu"},
{"category": "Analytics", "ranking": "72", "app_name": "June", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "With the June integration you can:- :bar_chart: Receive your most important metrics in Slack (daily, weekly or monthly)- :tada: Celebrate all time high of sign ups or active users- :bellhop_bell: Be notified in live when a key action happens- :female-detective: Enrich users information, on the spotHappy syncing!- - - - :information_source: Important note: you need a June account to start using the Slack app :purple_heart:  To create your account please visit https://june.so/:bird: Twitter: https://twitter.com/JuneDotSo"},
{"category": "Analytics", "ranking": "75", "app_name": "HappInsights", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Get an overview of how Happy or Unhappy your employees are through our Happiness Dashboard. Our bot will ask your employees how Happy they are on a predefined interval (daily, weekly, monthly etc) through the Messages tab of our app on Slack.Furthermore, you can use the Unhappy Button locted in the HappInsights Home tab for the entire organization. When that button is pressed it triggers a message on a predefined Slack Channel that will read '1 person from your Organisation is Unhappy'."},
{"category": "Analytics", "ranking": "71", "app_name": "Churnkey Connect", "supported_languages": ["English"], "pricing": "Paid", "app_description": "Keep your finger on the pulse of your customers with Churnkey Connect. Get notified every time a customer goes through the Churnkey cancellation flow - and know when customers are aborting the cancellation flow, pausing their subscriptions, or accepting discounts."},
{"category": "Analytics", "ranking": "74", "app_name": "Playvox WFM", "supported_languages": ["English"], "pricing": "Paid", "app_description": "The Playvox WFM App for Slack allows you to receive notifications that you have subscribed to from the \"My Integrations\" page in Playvox WFM.Subscribe to events including:- Leave request events- Start of day events- Regular status reports"},
{"category": "Analytics", "ranking": "70", "app_name": "Laplace", "supported_languages": ["Korean"], "pricing": "Free and paid plans available", "app_description": "복잡한 세팅과 학습은 필요 없습니다. 이제 AI가 ‘데이터 분석’을 자동으로 수행합니다. 카페24, 스마트스토어, 쿠팡, 아임웹 등 여러 채널로 분산되어 있는 데이터를 통합하여 한 번에 관리하고 확인할 수 있습니다.라플라스란?라플라스는 커머스 사업자들의 성장을 돕기 위해 고안된 데이터 분석 툴로서 한 번의 데이터 연결과 동시에 창사 이래 데이터를 전부 분석하여 고도화된 그로스 분석, 코호트 분석, 유저 분석, 상품 분석, 주문 분석 차트들을 제공하여 데이터에서 핵심 인사이트를 확인하고 이를 기반으로 성장할 수 있도록 도와드리는 AI 데이터 분석 툴입니다.라플라스는 Google Analytics, Mixpanel, Amplitude 등의 데이터 분석 플랫폼과 다르게 개발자가 없거나 개발 지식이 없으셔도 쇼핑몰 계정 정보만 입력하면 손쉽게 설치가 가능합니다.데이터 연결만 하시면 자동으로 창사 이래 모든 데이터를 수집하여 집계하니 유저별 첫 구매, 재구매 시점, ARPPU, AOV 등 핵심 지표들을 정확하게 측정할 수 있습니다.일별 매출, 판매 수량, 객단가 등의 지표를 슬랙 통해서 매일 받아 보실 수 있습니다. 지표는 항상 전주의 지표와 대비해서 확인할 수 있으니 전주 대비 해당일의 매출이 늘고 있는지, 하락하고 있는지 라플라스에 로그인하지 않으셔도 슬랙 연동을 통해 쉽게 확인하실 수 있습니다."},
{"category": "Analytics", "ranking": "73", "app_name": "Trello Dashcards", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Dashcards are a new Trello card type that helps keep track of what you and your teams are doing.To start using Dashcards on your Trello boards, enable the Power-Up for the board you want using https://trello.com/power-ups/6048e897c73d032a983e2a7c/dashcards. Once enabled, you'll be able to create Dashcards directly on that board using the new Track button you will find at the top right of your board.Once you've got some Dashcards, you might want to be notified when they change in various ways. In Trello Premium workspaces, you can setup alerts on your Dashcards to be notified via Slack or email of the changes to your Dashcard that are most relevant to you and your team. You can setup multiple alerts per Dashcard, and using Slack those alerts can be sent to either a channel and or a DM to a user.To setup your first Slack alert for a Dashcard, from the Alerts tab:1. create a new alert2. Select \"Add action\" -> \"Post a Slack message\"3. Click the + button which will open a new tab to Slack where you can select the channel or DM4. After you've authorized the channel or DM with Slack, you can select it from the dropdown5. Click save and you're all set. You'll start receiving alerts in Slack as they happenNote: the Dashcards Slack integration cannot and will not read any of your Slack messages or history. It only posts alerts to the targets you explicitly select and authorize."},
{"category": "Analytics", "ranking": "69", "app_name": "AssessTEAM", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "AssessTEAM is a performance management software for easy employee evaluation, 360 degree feedback, clarity of job function, and project portfolio management – all in a single suite. As part of our integration for Slack, we automatically create your team on the AssessTEAM platform, taking emails, job titles, and other details from your Slack account.Review requests are directly posted on the Slack message board. This makes evaluations quick and effortless directly from your familiar Slack interface."},
{"category": "Analytics", "ranking": "68", "app_name": "Block Insights", "supported_languages": ["English"], "pricing": "Free", "app_description": "Block Insights alerts you to cryptocurrency transactions as they happen by messaging you in your Slack channels.  You can setup and manage multiple alerts in different channels without leaving Slack.  Simply type slash commands into a channel to start receiving alerts.  For example, typing /crypto-alert 5 BTC will send a chat message every time there is a a bitcoin transaction larger than 5 BTC.  Alerts can be paused or resumed by typing /pause-alerts or /resume-alerts into the channel.  Alerts can also be configured in private channels by first inviting the bot to the channel using the command @Block Insights, and then issuing the /crypto-alert command as described previously."},
{"category": "Analytics", "ranking": "67", "app_name": "Chartbeat", "supported_languages": ["English"], "pricing": "Paid", "app_description": "Chartbeat helps you understand, measure, and monetize the time that audiences actively spend with your site’s online content.This integration will enable the slash command /chartbeat for your team: • Learn what pages are trending on example.com with /chartbeat what are the top pages on example.com• Understand where your visitors are coming from with /chartbeat how much traffic on example.com is from social sources.Now, you can know what’s holding your audience’s attention every moment of the day."},
{"category": "Analytics", "ranking": "66", "app_name": "Lyte", "supported_languages": [], "pricing": null, "app_description": "Lyte is based on a simple idea: When individuals and teams are free from obstacles blocking their work, they are able to get more done, be more productive, and be happier at work. However, these obstacles can be hard to spot. That’s why we made Lyte.Lyte is an easy and powerful survey tool that helps you effortlessly gather feedback to see what's going on in your team. Using quick and frequent pulse surveys, Lyte keeps you continuously up to date and in the know.The best part? Lyte is completely customizable - giving you unlimited ways to survey your team. Employee engagement, team satisfaction, and workplace culture can all be measured by one app - directly in Slack."},
{"category": "Analytics", "ranking": "92", "app_name": "Calendar Monster", "supported_languages": ["English"], "pricing": "Free", "app_description": "Meeting time is on the rise, and bad meetings hurt engagement as well as the bottom line. Calendar Monster is a clever AI to help you improve meeting productivity by examining your meeting habits, and suggesting research based best practice improvements for your calendar. It will be your backstop to catch that missing video link, improve timing, remind you about agendas, and much more.Once you've signed up to Calendar Monster, and completed the setup, you can expect to see the Bot for Slack sending you messages when it detects improvements opportunities in your new calendar entries. For example, if you send a meeting invite without a location or video conference link the Bot will message you and let you know. It can also suggest ice-breakers to kick off meetings. We're constantly working on making this Bot smarter with new skills! Give it a try today for you and your team.After installation, you can always administer the settings (which control what specifically the bot will help with) and any integration details (which Slack workspace you're connected to) from the Calendar Monster web portal.Calendar Monster takes advantage of modern AI based Large Language Models (to generate response text in our Bot for Slack, classify meetings, and other places). This helps make our suggestions and interactions creative and fun, but also sometimes inaccurate. We're constantly working to improve our product but you should always keep in mind that there is a possibility of inaccuracy."},
{"category": "Analytics", "ranking": "102", "app_name": "CrowdPower", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Create powerful automations based on customer behavior that drive engagement and sales.With the CrowdPower Slack app, you can ping your team when customers sign up, make a purchase, perform an event, enter a segment, and more.Easy setup. No trial period. No credit card required."},
{"category": "Analytics", "ranking": "65", "app_name": "Luna", "supported_languages": [], "pricing": null, "app_description": "Chosen by Splunk as it's 2017 Innovation Award winner, Luna allows teams to run saved and ad-hoc Splunk searches from inside of Slack. With Luna onboard, teams are able to investigate issues as they occur by accessing Splunk's powerful data visualizations inside of Slack channels. By sending a one-line command in Slack, Luna will communicate directly with the user's Splunk instance, saving teams valuable time, boosting productivity, and increasing transparency - helping to eliminate operational silos."},
{"category": "Analytics", "ranking": "91", "app_name": "Chorus.ai", "supported_languages": ["English"], "pricing": "Paid", "app_description": "Bring the Voice of the Customer to your entire organization by integrating Chorus with Slack. Chorus automatically records, transcribes and analyzes your revenue team’s interactions in real-time. The advanced AI powering the Chorus platform provides an unprecedented layer of Conversation Intelligence your teams can use to deeply understand the Voice of the Customer, share it instantly across the team for more effective cross-functional collaboration, and provide feedback to product & marketing teams directly."},
{"category": "Analytics", "ranking": "63", "app_name": "cbill", "supported_languages": [], "pricing": null, "app_description": "**Have you ever gotten an AWS bill and thought: this is Bulls*it**? :thinking_face:Say bye :wave: to AWS | GCP | Azure bill shocks.**CBill helps Engineering teams stay on top of their clouds** - right from Slack. How?:alarm_clock: **Alerts based on forecasts** - before it's too late:moneybag: **Deep dive with reports** - no PHD required**How does CBill Work?**We connect to your AWS, GCP or Azure account with a one-click configuration setup, giving you visibility into what's going on in your cloud.  We only require read-only permissions to your billing resources. These can be revoked at any time.We use this data to help you to stay on top of your cloud accounts in a convenient way, alerting you when anything changes.Visit https://computebill.com for more information and to contact us."},
{"category": "Analytics", "ranking": "117", "app_name": "ChatCharts", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Connect Tableau to Slack to transform business intelligence into a collaborative process.Use ChatCharts in your Slack workspace and start collaborating around Tableau business intelligence analytics. Create recurring notifications connected to the Tableau views and dashboards you already use and keep your team up to date with regular updates on key data."},
{"category": "Analytics", "ranking": "120", "app_name": "Tally Monitoring", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Benchmark and monitor website and API endpoints for outages, errors, and performance degradations. No software to install, Tally just needs your endpoint's URL to start evaluating and monitoring the server's responsiveness and uptime. A paid account is required, but you can sign up for a free trial at https://www.tallyapp.io.This integration will post alerts to a Slack channel when Tally detects an outage, error, or performance degradation."},
{"category": "Analytics", "ranking": "119", "app_name": "Logflare", "supported_languages": [], "pricing": null, "app_description": "Logflare is a centralized log management and event analytics solution. Built for Cloudflare websites and Elixir apps, send structured log data to Logflare for easy search, aggregation, dashboarding and archiving.Get log event alerts inside Slack. Sign in with your Slack account!Signup for free. Paid plans are coming soon!"},
{"category": "Analytics", "ranking": "116", "app_name": "Kogniz", "supported_languages": [], "pricing": null, "app_description": "Receive notifications from Kogniz. Typically, these notifications let you know when a rule has been triggered, such as a person of interest showing up or an object being detected. You can also keep your Kogniz employee list updated with Slack so you no longer need to manually update your employee Slack username."},
{"category": "Analytics", "ranking": "118", "app_name": "Intercom by Supportman", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Supportman is built for support teams who want to understand each other and their customers.- Know how happy your customers areSupportman sends Intercom conversation ratings in real-time to Slack so your team can understand how well they are satisfying customers. Give your team a positive culture of working together to help customers.- Quickly follow up with your unhappy customersYou can easily reply back to customers who didn't have a good experience and make sure that their issues are taken care of promptly.- Save time analyzing your Intercom MetricsSupportman is right where your team is - in Slack. We talked with many customer success and support managers to pull together the metrics that they care about most. No need for you to pull up the Intercom dashboards. Weekly reports bring customer service quality to the forefront of your team.- Promote communication around your ratings and metricsYour support team can interact with each other right in Slack around Intercom data. This gives your team knowledge of how to help each other and how things are going.- Let the company know how they are affecting the support teamYour support team understands customers best. Supportman helps you bring what you've learned to other teams within the company and how their work is affecting customer satisfaction. Slack is where all of these interactions happen."},
{"category": "Analytics", "ranking": "115", "app_name": "Sigma", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Sigma is a BI and Analytics application built for the cloud. Trusted by data-first companies, Sigma provides live access to cloud data warehouses using an intuitive spreadsheet interface so business experts can ask more of their data without writing a single line of code. With the full power of SQL, the cloud, and a familiar interface, business users have the freedom to analyze data in real time without limits.When installed, the Sigma app allows sharing of Sigma content to public or private Slack channels provided access. Sigma users can set up notifications from any of their Sigma documents. Notifications can be sent just once or on a schedule. Users can choose the file type to include, and whether to include a link.You must have an active Sigma account to install and use this app. Sigma is a paid app; however, you are able to use this integration during your trial.Learn more about Sigma at www.sigmacomputing.com."},
{"category": "Analytics", "ranking": "114", "app_name": "Extpose", "supported_languages": [], "pricing": null, "app_description": "Extpose is an analytic service for browser extension app store performance. It tracks browser extension installs, rating, and positions in categories and search results in Chrome Webstore. Sends daily or weekly summaries by e-mail or to Slack.Slack integration is available only for premium users (with paid subscription plan)."},
{"category": "Analytics", "ranking": "111", "app_name": "Propsy", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Meet Propsy: A minimal, uncomplicated app for giving kudos to your teammates in Slack! Wondering what makes Propsy unique? It helps you discover what makes your team tick, using metrics you can act upon.Give kudos, not fluffCelebrate your team’s greatest moments, right as they unfold. Just add Propsy to your workspace, give your first /props, and watch a new ritual form.Discover what makes your team tickLove data? So do we! Propsy tracks all activity in your workspace, measures your team’s well-being, and breaks it down for you with simple, actionable metrics. Build happier, more glued teamsGive your teammates more opportunities to bond, without getting in their way. Propsy sparks curiosity, encourages meaningful connection, and helps you build happier, more engaged teams."},
{"category": "Analytics", "ranking": "110", "app_name": "Adscook", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Adscook app will allow you to receive automation rule notifications right to your preferred channel. Stay up to date with the rule actions of all ad accounts without stopping your work in progress. Also, pause the rules directly from Slack if you do not need them anymore."},
{"category": "Analytics", "ranking": "109", "app_name": "Speetals", "supported_languages": ["English"], "pricing": "Paid", "app_description": "Speetals is a customer-centric Web Performance Monitoring tool focused on real user metrics. It helps you improve what matters and save money. Monitor your website and internal page performance metrics (Web Vitals, FCP, TTFB..etc).- Automated Real User Monitoring (CrUX RUM)- Fast efforts validation! Don't wait 28 days to get data :wink:- Your users' data! No Lighthouse emulation.- Compare your website against the competition and win the race- No setup/technical skills are needed!This application for Slack allows Speetals paid users:- to get a weekly report on how their URL performance evolve.- to be alerted (weekly or daily) if one of their URLs face a regression (by a threshold they define)The Slack report contains web performance data for each of the metrics (TTFB, FCP, LCP, CLS, FID, and INP).At a glance, the user can see and spot the trend. This report shows whether my internal pages' performance is improving or not for each of the monitored metrics.It helps you validate your web performance optimization efforts or detect regressions.Read more about this feature here:https://speetals.com/slack-web-performance-reports/"},
{"category": "Analytics", "ranking": "107", "app_name": "Emma", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Finally, a simple way for you to manage Facebook Ads using Slack.33 day free trial, no credit card required. If you continue after your trial, it's only $5 per month (and user). Cancel at any time.:zap: Get a performance overview 24/7. Customized and dynamic with the metrics you think are relevant.:zap: Generate a dynamic ads manager showing active campaigns along with results and simple operations. Click on a campaign to show all ad sets - and all ads within an ad set. :purple_heart:  Developed by Zalster, a Facebook Marketing Partner. Contact us at hello@zalster.com - we love feedback!"},
{"category": "Analytics", "ranking": "112", "app_name": "Power BI Integration by Akvelon", "supported_languages": ["English"], "pricing": "Free", "app_description": "Do you want to see your Power BI reports directly in Slack? Use out Power BI integration by Akvelon. This application allows you to share your reports with your teammates instantly or by the schedule. You also can do operations against reports data like filtering, setting alert notifications."},
{"category": "Analytics", "ranking": "108", "app_name": "railtown.ai", "supported_languages": ["English"], "pricing": "Included with service subscription", "app_description": "railtown.ai is the easiest way for developers to monitor and resolve errors early. Monitor, diagnose, and prioritize errors from the whole CI/CD environment on a single platform. Our app for Slack brings error notifications and weekly reports into the channel of your choice."},
{"category": "Analytics", "ranking": "106", "app_name": "Cultivate", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Cultivate provides insights on digital behaviors to empower leaders and improve team effectiveness.The Cultivate Slack bot uses AI to send reminders about messages from your team that still require action or follow-up.  With Cultivate’s Slack bot...Never forget to respond to your team again - Receive notifications in the flow of work about unanswered messages.See all your reminders in one place - Receive alerts for messages across all your email and chat platforms within Slack.  Drive team effectiveness - Unanswered messages can become bottlenecks.  Cultivate surfaces reminders to maintain your team’s productivity flow.Please note that your company needs a Cultivate account to use the Cultivate Slack app.  Learn more at cultivate.comContact the developers at info@cultivate.com"},
{"category": "Analytics", "ranking": "113", "app_name": "Datagran", "supported_languages": ["English", "Spanish"], "pricing": "Free and paid plans available", "app_description": "Datagran can pull in data from your MySQL, PostgreSQL, Azure Cosmos DB, Snowflake, Google Big Query, MongoDB, SQL Server, and other databases—or bring in data from tools like Shopify, Stripe, HubSpot, and more. Then, Datagran can run machine learning models on your data for churn analysis, RFM, regressions, and more, and easily send the output to business applications like Slack."},
{"category": "Analytics", "ranking": "97", "app_name": "Pleesher", "supported_languages": [], "pricing": null, "app_description": "Are you or your team efficient using Slack in your company? Are you influent or supportive enough? If you want to know, Pleesher provides each user personal and private analytics and simple tips to be more organized, supportive and influent on Slack.•    NO sensitive data shared•    NO personal data shared with anyone•    Built on Slack / 30-second setupPleesher lets you know how you perform compared to other team members:•    You will get a weekly scorecard with a few metrics•    Simple tips will be provided•    The team manager will receive an aggregated scorecard (coming soon)Pleesher is a fully automated solution but you can still request the bot to send you data with a few commands. Get the list by typing help in a private message to Pleesher.SAFETY AND PRIVATE DATA USEAt Pleesher, privacy and safety come first. You may think it is easy to say but we do believe in user personal empowerment rather than micro-task management. Therefore, these our two promises and how we do our best to keep them:1. Sensitive data are not stored by Pleesher. We ask for lots of permission as we need some data to provide you with powerful and accurate analytics. However, we only need and store the following data: when, in which channel, by who an action (post, emojis, and so on) has been done. That is it! As for today, we analyze only the content to know if the user is asking a question. In the future, if we think it is relevant to analyze other data, we will let you know here.2.  Each user data are private meaning than you will be the only one able to share these in your team or company. No one will be able to access them. Obviously, if you are only two in the team, it is easy to know who is n°1 or n°2! But our bot targets +10-people companies where communication starts to be challenging.UNLIMITIED FREE TRIAL / PAID ACCOUNT (coming soon)For now, Pleesher for Slack is free to use with its basic features. We are developing a paid plan for companies willing to get powerful analytics and metrics to manage their team.Feel free to contact us for further question: contact@pleesher.com"},
{"category": "Analytics", "ranking": "100", "app_name": "IP2WHOIS", "supported_languages": ["English"], "pricing": "Free", "app_description": "IP2WHOIS Slack Command enables WHOIS Lookup (Domain lookup) in Slack by using the /ip2whois command.Instantly retrieve the WHOIS information such as creation date, expiration date, domain age and WHOIS server information in the Slack channel.You may contact us at support@ip2whois.com if you encounter any issue about the IP2WHOIS Slack app."},
{"category": "Analytics", "ranking": "105", "app_name": "Loomly", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Loomly is a Brand Success platform that provides your marketing team with all the features you need to successfully manage every aspect of your communication. The Loomly Slack App allows you to receive notifications in Slack when a collaborator, in Loomly, updates the state of a post, assigns a post to you, or leaves a comment for you. In addition, you can be notified in Slack when a post, in Loomly, needs to be published or has failed publishing.Using the Loomly Slack App requires a Loomly subscription (passed the end of your 15-day free trial)."},
{"category": "Analytics", "ranking": "104", "app_name": "Chainbeat Notifier", "supported_languages": [], "pricing": null, "app_description": "Chainbeat is a comprehensive analytics platform for DApps.Access any smart contract analytics on multiple blockchains. Using Chainbeat you can receive Slack notifications about smart contract transactions and events.Free plan available."},
{"category": "Analytics", "ranking": "103", "app_name": "AppSignal", "supported_languages": [], "pricing": null, "app_description": "AppSignal is an all-in-one monitoring service that tracks performance and exceptions in your Ruby, Elixir and JavaScript applications and background processes. This integration will allow you to receive new exceptions, performance, deploys and custom alert notifications in a Slack channel.To use this integration a paid AppSignal account is required. For more information, see our Slack integration page: https://appsignal.com/for/slack"},
{"category": "Analytics", "ranking": "99", "app_name": "Alation", "supported_languages": ["English"], "pricing": "Included with service subscription", "app_description": "Alation’s enterprise data catalog dramatically improves the productivity of analysts, increases the accuracy of analytics, and drives confident data-driven decision making while empowering everyone in your organization to find, understand, and govern data.With the Alation app, you can preview an Alation object. Enter the exact url of the object within a Slack message and see a preview of that object’s description, columns, and more. You can then favorite and watch that object, as well as linking back to the object in your own Alation environment.You can also search for an object using the Alation command in a Slack message, select the correct object from a list of provided results, and then preview that object.All of this without needing to leave Slack!Note this is only available for Alation Cloud."},
{"category": "Analytics", "ranking": "101", "app_name": "Yotascale", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Yotascale - Cost Management Application for Public Cloud ProvidersYotascale, a leader in Cost Management for AWS, provides cloud operations and finance teams predictable cloud costs. Cost allocation, visibility, planning, and optimization are key features of Yotascale software that enable an effective cost management strategy. Yotascale Slack application help enterprises retrieve their cost analytics from the Yotascale cloud. The application also helps to get automated cost and anomaly reports delivered to specific Slack channels. In addition, it also helps to create a support ticket with the Yotascale customer support team.Currently, Yotascale Slack app provides following functionality by interacting with the app through Yotascale Slash Commands or Shortcuts:1. /yotascale cost_analytics is used to view cloud cost summary2. /yotascale set_business_context is used to configure Business Context Alerts 3. /yotascale set_global_anomaly_alert is used to configure Global Anomaly Alerts 4. /yotascale get_mapping_list is used to get a list of all alerts for different channels and business contexts 5. /yotascale help or type help to get help at any time6. /yotascale support <Provide a short description of the problem that you are facing> to contact customer support"},
{"category": "Analytics", "ranking": "98", "app_name": "Customer.guru", "supported_languages": [], "pricing": null, "app_description": "Customer.guru is an easy-to-setup tool for measuring customer satisfaction using Net Promoter Score.Net Promoter Score is a customer loyalty metric introduced by Harvard Business Review in 2003. Since then, NPS has been widely adopted with more than two thirds of Fortune 1000 companies.The Net Promoter Score is calculated based on responses to a single question: How likely is it that you would recommend our company/product/service to a friend? On a 0 to 10 scale.Those who respond with a score of 9 to 10 are called Promoters, and are considered likely to exhibit value-creating behaviors, such as buying more, remaining customers for longer, and making more positive referrals to other potential customers.Customer.guru is dead simple to use:1. Customize our survey2. Add e-mails of your customers3. Track the results in realtime and improve your results over timeOur Slack integration allows you to see your new Customer.guru ratings in Slack in realtime!"},
{"category": "Analytics", "ranking": "136", "app_name": "Pendo", "supported_languages": ["English"], "pricing": "Free", "app_description": "What is the Pendo for Slack integration?The Pendo integration pushes a preview of product analytics, guides, and NPS information into your instance of Slack. Create a channel specifically for NPS or see a data rich preview when you paste any Pendo link in Slack. Who’s it for?Companies with Pendo, who also communicate and collaborate with Slack Product teams who want to share insights, but know not everyone will use Pendo CPO’s and CEO’s who want to build a customer first business, that takes customer feedback seriously. Pricing and Packaging? Slack is a free integration and does not count towards a customers integrations limit.  Why is the Slack integration valuable? There are two big components to this integration. The first are Slack preview links. Once authorized, any Pendo link pasted into Slack will now come with a data rich preview of what it’s linking too (unfurl links). Users will see Slack link previews when links to specific analytics or guides are shared. This allows you and your colleagues to benefit from Pendo insights at a glance, without having to jump into the app, unless you want to. Even more data awaits you there.  Get started with Slack link previews here. The second is Pendo NPS for Slack. This allows you to see real-time NPS responses directly in Slack. You can send NPS submissions to a channel of your choice. Then, configure custom metadata for more informative summaries to help you act on the responses. Customer feedback is a gift, but if you can’t act on it it’s hard to benefit from it. Having a dedicated NPS Slack channel puts that feedback into the hands of everyone at your company, where it can become a real resource.      Get started with Pendo NPS for Slack here. Requirements Slack is a free integration, and available for all packages of Pendo. You will need the following permissions to authorize Slack.Admin permission to your Slack account  Admin permission to your Pendo account Note: This authentication is only required one time from one Pendo Admin (+Slack Admin) for your Slack instance at this time. This means once the integration is set up, only one Pendo user needs to authenticate in Slack so any user can see the unfurled information from Pendo links in any Slack channel."},
{"category": "Analytics", "ranking": "135", "app_name": "Xactly Incent", "supported_languages": ["English"], "pricing": "Paid", "app_description": "Xactly Incent provides sales reps visibility into their variable compensation as well as streamlines administration of sales compensation. The Xactly Incent Slack App provides reps a quick view of their compensation right at their fingertips in Slack, as well as provides easy access to compensation inquiry submission to their sales managers."},
{"category": "Analytics", "ranking": "133", "app_name": "rudol", "supported_languages": ["English"], "pricing": "Included with service subscription", "app_description": "With rudol's integration with Slack, you will be able to:- Search your Data Catalog and Collaborate with your Team navigating through your catalog items with ease without leaving the conversation- View the Catalog Items you have subscribed to (for structural changes or any of your data validation rules set up in rudol's platform)- Choose (and modify) which channel to be notified on (you may choose one channel for all your subscription message notifications)- Receive automatic message notifications of any structural or data validation trigger, in your selected Slack conversation* About rudolData Teams spend an estimated 70% to 90% of their time gathering, cleaning and processing data, and only a very small portion of their time on actual analysis and value creation.rudol is a Data Quality platform that helps companies- understand all their data Sources, no matter where they come from,- reduce excessive communication in reporting processes or urgencies- and accelerate data quality diagnosing and issue prevention through easy stepsWith rudol, each Organization is able to add Data Sources from a growing list of providers and BI tools (Big Query, Snowflake, PostgreSQL, MySQL, Redshift, Kafka, Power BI, Data Studio, Looker, Tableau) with a standardized structure so, regardless of where it’s coming from, people can understand:- where and how the data is stored- read and collaborate with its documentation- or easily contact data owners using our integrations with communication tools (Slack, Teams, GChat, OpsGenie, PagerDuty or email)rudol also helps teams communicate less and better, by providing:- activity logs, to make it easy to audit structural changes even for interested parties who don’t have direct access to every data source used by the organization- subscription capabilities, so people are immediately informed when changes are detected through their preferred channelsThis takes out responsibility from data owners on reporting changes to every interested party.Rudol also helps you understand data transformation processes and prevent problems, with very little effort, by using no-code, easy-to-configure Validation Rules.These Rules allow interested roles to validate anything they need about a Data Source, whether it’s about inconsistencies, validation of business rules, volume or speed, without the need to have direct access to the data source or even understand its infrastructure technology.So no matter what role you have, what credentials you have on different Data Sources and what’s your development knowledge, with rudol you will always be able to know what Data your company handles, its structure, its universe of stakeholders and all dependencies on other sources and people.All while at the same time, massively reducing communication needs and facilitating quality control for everyone."},
{"category": "Analytics", "ranking": "144", "app_name": "Konnect Insights", "supported_languages": ["English"], "pricing": "Paid", "app_description": "Get data from social media and web straight to your slack channel. Set workflows to assign it to user or teams. Konnect Insights supports Facebook, Instagram, YouTube, LinkedIn, Google Business reviews, Play store app reviews, App store reviews, Amazon, Flipkart, blogs, forums, news, reviews, complaint forums. Connecting Konnect Insights to Slack allows you to:•    Push social media data (Facebook, Instagram, LinkedIn, YouTube and many more) in Slack•    Assign to users / teams in Slack•    Automate the process of pushing data •    Automation based on classification, sentiment, keywords, followers and many more •    Respond to the conversations from Slack•    Get this data in real time•    Push data from all over the web (news, blogs, forums, reviews etc) to SlackWith Konnect Insights you get the power of 4 tools in one.1.    Listening from all over the web and social media. Built on big data and in-house search engine you will get everything that matters to you. Brand, competition and industry conversations that matter to you 2.    Analytics of all the online conversations such as sentiment, classification, campaign analytics, social profile analytics and many more with beautiful dashboards and BI tools3.    Response management / Social CRM with intelligent workflows 4.    Scheduling or Publishing posts on social media Konnect Insights is trusted by brands from various industries as it offers a complete social suite. Start your Free Trial (no credit card required) to explore all the features and integrate it with Slack."},
{"category": "Analytics", "ranking": "143", "app_name": "Uplevel Enterprise Grid", "supported_languages": ["English"], "pricing": "Paid", "app_description": "Uplevel is the engineering effectiveness platform that leverages machine learning & organizational science to champion behavior change.Empowering engineers to do their best work.  Use data-driven insights to lift your team to their highest potential."},
{"category": "Analytics", "ranking": "134", "app_name": "Theta Lake for Slack", "supported_languages": ["English"], "pricing": "Paid", "app_description": "Theta Lake seamlessly integrates with Slack to automate everything from comprehensive capture to long-term compliant archiving, eDiscovery, supervision, and risk detection. With more than 65 built-in policy detections, Theta Lake empowers organizations to identify and mitigate data loss, security, acceptable use, and compliance risks in what was shared within any Slack conversation, with the option to create custom detections as well.Existing supervision practices typically only focus on the text within Slack collaboration, which leaves a blind spot when it comes to files, audio recordings, video recordings, or any other rich media shared through this channel. Theta Lake helps organizations take a holistic approach to review, analyzing 100% of shared content to identify potential data loss or compliance risks. Powered by state-of-the-art deep learning and AI, Theta Lake points reviewers to a specific event within a message thread that requires further investigation.Slack conversations and all attachments are reviewable in their native threaded format, including 1:1, group, and team channel instant messages. Each conversation is issued a risk score, all participants are identified (even inactive participants), and any policy detections on the content are flagged for reviewers. Additionally, reviewers can view messages that have been deleted and edited by the participants across any conversation and channel, as well as directly remove content from the conversation within the Slack channels. This includes risky URLs that could pose a security threat or any content that violates acceptable use and conduct policies.Use Theta Lake as your archive of record and securely preserve Slack content within our SOC2 Type 2-certified, SEC 17a-4 compliant archive. Specifically designed for collaboration platform storage, Theta Lake enables legal and compliance teams to perform rich eDiscovery and legal hold case management across messages and content shared. Alternatively, Theta Lake offers a range of integrations with legacy archives to incorporate Slack with existing email retention."},
{"category": "Analytics", "ranking": "142", "app_name": "Convin", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Convin is a conversation intelligence platform that can analyse 100% of your sales calls and give you an overview of what's going on in your sales conversation. It gives you an opportunity to improve and close more deals.The Convin for Slack app sends real-time updates and action items for all your sales calls directly to your Slack workspace so you don't have to dig for notes in your inbox. The Convin app sends detailed meeting insights and audit reports so you and your team can stay on top of everything at all times."},
{"category": "Analytics", "ranking": "150", "app_name": "SalesCompete for Outreach, Hubspot", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "SalesCompete is the first ever sales competition and gamification Slack bot for Salesloft, Outreach, and Hubspot :rocket: Click Add to Slack to get started for free in under 1 min. Just hook up your team's Salesloft or Outreach account and you're ready to begin :muscle: Use SalesCompete to:• Increase your inside sales team's engagement & motivation • Speed up coaching & feedback of sales calls• Increase transparency and access to sales performance metrics across your teamFeatures::dart: GoalsUse goals to rally your team around a specific target metric and deadline. Goals can be one-off or recurring, and may include a spiff.:zap: Power HoursUse power hours to bring back that in-office competition amongst your sales team. Reps call in real-time for 1 hour against a specific goal to win a prize.:interrobang: Daily TriviaUse daily trivia to start the day off right with your team. Reps submit their answer to 3 jeopardy questions and winners are announced 1 hour later.:moneybag: Meeting BountiesUse meeting bounties to take the monotony out of a rep's day-to-day by giving them an opportunity to win a prize when they book a meeting with any contact at a specific named account.:phone: Call Coaching MessagesUse call coaching messages to give your team quick access to recordings of calls from specific sentiments -- rounded up every 1, 2 or 3 hours.:star: Success NotificationsUse success notifications to send a fun, congratulatory slack notification each time a new meeting (success) is booked. Includes the call recording for giving quick feedback.:bar_chart: Daily Recap MessageUse the daily recap message to send a message every day to your team with the stats and graphs of your choosing.:robot_face: Slash CommandsUse slash commands to access Salesloft or Outreach data (calls, meetings, emails, etc.) in real time. Just use the commands /leaderboard, /success or /charts in any channel to learn more.Our Story:SalesCompete was born out of necessity. Having experienced the pain behind remotely managing an inside sales team during very uncertain times, we set out to solve the equation behind how to maintain a culture of competition amongst our sales reps.What is Salesloft and Outreach?Salesloft and Outreach are inside sales enablement platforms to help your business development team plan and organize their outreach strategies more effectively. To learn more about these systems please visit their respective websites."},
{"category": "Analytics", "ranking": "147", "app_name": "Cronitor", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Monitor cron jobs, daemons, micro-services and almost anything else. Cronitor's realtime dashboard gives you visibility into the health of your scheduled tasks and services like never before. Our integration for Slack ensures the right team members are alerted whenever a failure occurs. You can also view alert history and pause alerts without leaving Slack."},
{"category": "Analytics", "ranking": "145", "app_name": "LaunchDarkly", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "LaunchDarkly is the world's leading Feature Management Platform serving over 20 trillion feature flags daily to help software teams build better software, faster. With the LaunchDarkly Slack app, you can view, monitor, and control feature flags directly from your team's Slack workspace. Use the app to find feature flags, subscribe channels to notifications about flag changes, and toggle flags on or off. You can use the app with a current LaunchDarkly account, which requires a paid subscription."},
{"category": "Analytics", "ranking": "148", "app_name": "Upmarket", "supported_languages": ["English"], "pricing": "Included with service subscription", "app_description": "With one line of code per event, developers can drive automation in the business and create true product led innovation and give business teams the power to do things they’re good at, like creating  personalized outreach to sign-ups, setting rules to update crms, and sending notifications.Best of all, Upmarket gives developers and business teams the ability to collaborate on a product journey that’s understood by everyone.Sign up for a free trial at upmarket.ai or go straight to the developer docs at https://developers.upmarket.ai/quick-start/home"},
{"category": "Analytics", "ranking": "146", "app_name": "Sysdig", "supported_languages": [], "pricing": null, "app_description": "Sysdig is a monitoring, alerting, troubleshooting, and security platform, built from the ground up for the world of containers and microservices.This integration will allow you to send alert notifications about your application's performance, uptime, or security issues from Sysdig applications directly to the Slack channel of your choice.  Sysdig offers free trials - sign up at www.sysdig.com!"},
{"category": "Analytics", "ranking": "141", "app_name": "Screenful", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Screenful is the easiest way to visualise and share your project progress using data from your existing tools, like Jira, Trello, Asana and Monday. Save time and get all the metrics you need at a glance with visual dashboards, custom charts and scheduled reports all in one place. With this Slack integration, your team gets automatic daily, weekly and monthly reports sent to their chosen Slack channel. From the reports you'll see for example:• What was completed last week• The workload for each team member• Which are the highest priority tasks in the backlog• The velocity trend for the last 10 weeksIt's a great way to keep everyone informed about the team's progres!"},
{"category": "Analytics", "ranking": "149", "app_name": "SaaS Manager", "supported_languages": ["English"], "pricing": "Paid", "app_description": "THE SAAS SECURITY BLIND SPOT PUTS YOU AT RISKOrganizations are dynamic. Employees come and go. Roles change. As a result, you face a constant battle securing corporate data from those that shouldn’t have access.Some companies use a single sign-on (SSO) technology to track and enforce security access. But SSO only works for the systems to which it’s connected. Most organizations don't deploy SSO for all their SaaS vendors – especially when Shadow SaaS is rampant and employees are using unauthorized SaaS apps. What's more, many organizations grant access privileges to users outside their SSO processes.This security blind spot can expose you to the theft of proprietary data. And it can open you to enormous regulatory compliance risks. GDPR, for example, requires you to understand which systems contain personally identifiable data, and who has access. With the Flexera SaaS Manager Slack integration you will be able to get detailed usage and cost data by internal user segment, Allocate SaaS investments by department for financial reporting, Identify users logging into Slack that are no longer active, See users that have not been actively using their Slack license to reclaim these licenses for other users and have visibility into your usage and entitlements to easily validate your investment to help your renewal process by providing the data to clearly show \"how many licenses you need\", not just how many you have."},
{"category": "Analytics", "ranking": "140", "app_name": "App Radar Insights", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "App Radar Insights enables you to regularly receive insights about your app and app store listing in Slack. This Slack integration helps you understand if and how your app can be found in Apple App Store and Google Play Store. With the integration, you can also more easily keep track of your app store reviews and app store features.With App Radar Insights, you no longer have to interrupt your daily workflow to check how your app is doing. All the information you need will be sent directly to your chosen Slack Channel. Let us do the hard work for you."},
{"category": "Analytics", "ranking": "139", "app_name": "Baremetrics", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Baremetrics gives you one-click access to hundreds of metrics and insights for your subscription business!The Slack integration sends you instant notifications (Charges, New Customers, Cancellations, etc) as well as daily, weekly and monthly revenue reports and graphs.Using /-commands you can also access daily, weekly and monthly reports for any of your metrics."},
{"category": "Analytics", "ranking": "129", "app_name": "Intello", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "With the Intello Slack integration you can view and manage all active and inactive users. The integration allows you to view user-level session data. This means you will see the amount of times users are accessing Slack for a given date range. You will also be able to audit apps that have access to your Slack data.You will need admin access to authenticate with Slack."},
{"category": "Analytics", "ranking": "137", "app_name": "Hunch", "supported_languages": [], "pricing": null, "app_description": "Hunch automates Facebook, Instagram, and Adwords ads.Instead of wasting time on campaign busy work like changing, pausing, and monitoring ads, with Hunch teams get more time to focus on strategy.- Automated AdsHunch helps you create automated ads for Facebook and Instagram- Automate Workflows:Hunch automates routine campaign management tasks so you can focus on campaign strategy and creative.- Optimize Performance:Market conditions are changing. Analyze, Interpret, and Optimize ad performance automatically.- Monitor Cross-Account:Connecting data from multiple ad accounts makes your team more efficient and helps you scale your campaigns."},
{"category": "Analytics", "ranking": "132", "app_name": "Eppo", "supported_languages": ["English"], "pricing": "Included with service subscription", "app_description": "Eppo is the experimentation platform for the modern data stack. Eppo streamlines your entire feature flagging and experimentation workflow directly on top of the data warehouse, helping you run more impactful experiments.The Eppo App for Slack allows you to get notifications for important updates on the experiments you are running on the Eppo platform. For example, you can opt to receive notifications when experiments start and finish, when we detect a statistically significant change in a primary metric, or when there is an unexpected imbalance in assignments."},
{"category": "Analytics", "ranking": "138", "app_name": "devtodev", "supported_languages": [], "pricing": null, "app_description": "The most powerful tool to track your app daily stats via Slack.devtodev Slack integration helps you to explore the key metrics of your web or mobile application via Slack channel. Track gross, revenue or users metrics directly through your team channel: the integration monitors your app key metrics and sends you daily reports.devtodev is an all-in-one analytical platform for web and mobile applications. It combines a simple interface with powerful tools including teamwork features, funnels, paying users reports, LTV forecast, push notifications tool, and many other cool things."},
{"category": "Analytics", "ranking": "131", "app_name": "Gainsight Sally", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Sally makes rich Gainsight data easily accessible through simple conversation. Your teams will rally around your customers with real-time customer insight within their Slack channels. - Talk with Sally just like talking with a real person; her machine-learning technology enables her to recognise a wide-range of words and questions and helps her get smarter with each interaction- Quickly gain insight into your customers by asking diverse questions about your portfolio; ask for a summary of any customer including health score details, NPS survey responses and key sponsors.- Facilitate collaboration across all teams with easily accessible customer information and engage each team members to rally around the customer’s goals.To use Sally, you need a paid Gainsight instance that can be connected with your Slack team(s)."},
{"category": "Analytics", "ranking": "130", "app_name": "Awario", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Awario is a social listening tool that lets you track mentions of your brand, campaigns, competitors, or (literally!) anything else across social and the web. Connect Awario to Slack to receive important mentions of your keywords in real time in a Slack channel of your choice (available in the free trial and all paid plans)."},
{"category": "Analytics", "ranking": "128", "app_name": "Wired2Perform", "supported_languages": ["English"], "pricing": "Free", "app_description": "The Wired2Perform Slack app helps you tap into the potential of your team members on each Slack channel and leverage personal insights to communicate and collaborate more effectively. https://app.wired2perform.com"},
{"category": "Analytics", "ranking": "127", "app_name": "teamble", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Teamble makes 360 feedback simple, continuous, and actionable.All the tools you need to build a culture of feedback, growth, and psychological safety in your teams.Teamble is built in collaboration with the global thought leader in workplace psychology: Prof. Adam GrantWith teamble,Team members and managers can:• Get continuous feedback and develop your skills• Run 1:1s that make an impact• Build new team rituals with science-backed surveys• Coach people better with contextual, structured, actionable feedback• Know what questions to ask for better feedbackHR and People Ops teams can:• Simplify performance reviews. Seamlessly run 360 review cycles inside Slack• Get the right insights for crafting a robust people strategy with surveys and insights on engagement, performance, DE&I, and L&D• Track adoption of continuous feedback practices in your teamsStart using teamble in Slack for Free. Upgrade with a 1-month free trial.Have questions, want to learn more about teamble? Please schedule a live demo or contact us at teamble@teamble.comCommands & Shortcuts/teamble /getfeedback /givefeedbackEasily give feedback to teammates, ask for feedback or access other features."},
{"category": "Analytics", "ranking": "126", "app_name": "Gappie", "supported_languages": ["English"], "pricing": "Free", "app_description": "Gappie is a bot that will make sure your email campaigns always deliver directly to your customers inbox.Resolve Issues Before They Become Problems-  check if your domain is protected-  detect email configuration issues-  check your IPs against 30+ of the most common industry blacklistsValidate domain recordsJust send “/domain” to Gappie to receive reports on your DMARC, SPF and MX DNS records and take immediate action.Check IP ReputationInstantly check your IPs against more than 30 of the most common industry blacklists including Spamhaus, SURBL, SORBS and Invaluement.Get instant notifications from DMARC Analytics the second anything suspicious occurs:- a drop in your DMARC compliance rate- a surge of email traffic from your domain- changes in the DMARC or SPF DNS records- DKIM or SPF authentication failures in traffic from your legitimate sourcesPlus alerts from:- Inbox Insight Automatic Tests- IP Reputation- Bounce MonitorLet Gappie monitor the health of your Email Marketing Campaigns"},
{"category": "Analytics", "ranking": "155", "app_name": "AppFollow: Review & Updates Monitor", "supported_languages": ["Arabic", "Catalan", "Chinese", "Croatian", "Czech", "Danish", "Dutch", "English", "Finnish", "French", "German", "Greek", "Hebrew", "Hindi", "Hungarian", "Indonesian", "Italian", "Japanese", "Korean", "Malay", "Norwegian", "Polish", "Portuguese", "Romanian", "Slovak", "Spanish", "Swedish", "Thai", "Turkish", "Ukrainian", "Vietnamese"], "pricing": "Free and paid plans available", "app_description": "Turn Slack into an app updates monitor and reply-to-user-reviews tool​ for the App Store, Google Play, Mac App Store, Windows Store, and Amazon​​. Monitor your app's critical data, receive user reviews, and respond to them directly in Slack. Set up different channels for different updates so your data is structured and each team receives only what they need.With AppFollow's Slack app you can::incoming_envelope: Aggregate app data, reviews, downloads and sales from 5 major app stores in your Slack :arrow_right: Respond to iOS, Android, and Amazon reviews right in Slack without any redirection to app stores:money_with_wings: Track app sales & downloads:chart_with_upwards_trend: Monitor app rating and keywords changes in automated ASO reports:eyes: Track competitors’ updates and reviews:shopping_bags: Monitor and respond to Amazon product reviews (NEW!)AppFollow does not use any Slack team emails collected when the app is installed to send emails to those users.http://appfollow.io/slack"},
{"category": "Analytics", "ranking": "154", "app_name": "Sisense for Cloud Data Teams", "supported_languages": ["English"], "pricing": "Paid", "app_description": "Sisense for Cloud Data Teams is an analysis platform built for data teams. It lets them easily connect their databases and turn SQL queries and billions of rows of data into beautiful reports and dashboards that can be shared with anyone.When installed, this Slack app will automatically attach message previews to report and dashboard links when shared in Slack. Message previews will appear for reports and dashboards with restricted access, but will exclude all sensitive data and information. You must have an active Sisense for Cloud Data Teams account to install and use this app."},
{"category": "Analytics", "ranking": "153", "app_name": "data.world", "supported_languages": [], "pricing": null, "app_description": "Get updates on subscribed data sources and provide insight into shared links directly in Slack.You can easily install the data.world integration in Slack, then subscribe to and unsubscribe from accounts, projects, and datasets with inline commands - once you’re subscribed, you’ll get updates in Slack when changes are made in data.world.You’ll also be able to share rich message links, which give your team insight into datasets, insights, and more before they explore on data.world.Pro Tip: Install the data.world integration on group channels to keep your entire team in the loop with changes to a project or dataset.With Slack and data.world, you can:- Easily subscribe to projects, datasets, and accounts to receive notifications when updates are made- Share rich messages when you link to data.world so your teammates won’t be left in the dark- Quickly view your subscriptions, unsubscribe, and explore further through inline commands"},
{"category": "Analytics", "ranking": "152", "app_name": "Unless", "supported_languages": ["English"], "pricing": "Paid", "app_description": "Unless is a website personalization platform that enables you to adapt your website to each individual.If you are using Slack in your company, you might want to benefit from its integration with Unless.This way you can receive real-time updates about everything from personalizations to audiences, identified visitors to goal conversions and more.This integration is the perfect way for staying up to date with your team’s progress when it comes to Unless.An Unless account (trial or paid) is a prerequisite to using this app."},
{"category": "Analytics", "ranking": "161", "app_name": "WebGazer", "supported_languages": ["English"], "pricing": "Included with service subscription", "app_description": "WebGazer is an uptime monitoring and analytics platform. It monitors your websites, API endpoints and cron jobs. And alerts you in case of an issue.This app integrates WebGazer with Slack. You can select the channel you want to get your WebGazer notifications on."},
{"category": "Analytics", "ranking": "160", "app_name": "Probe", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Probe gives you access to all of your metrics with one simple command. When you have a data question - you don't need to go to a dashboard. You can simply type /probe to get the answer.Here is the list of metrics that Probe supports at the moment- trials number of trial / freemium accounts created- trial conversion your conversion rate from trial to paying customer- new mrr your gross new business MRR- renewal renewed MRR from customers coming back to your service- expansion MRR gained from your existing customers paying more- contraction MRR lost because your customers start to pay less- churn lost MRR due to customers leaving- churn net your net MRR churn = renewal + expansion - contraction - churn- new mrr net actual amount of money you have added to your business; new_mrr_gross - churn net- churn rate gross % of MRR you are losing each month- churn net rate net % of MRR you are losing each monthWe show data in a monthly resolution by default. But you can add weekly to any metric to change this. E.g. /probe new mrr weeklyHow we collect dataThere are two ways to send data to the Probe:1. Use our Stripe Integration. Once you install the Probe app in your workspace - you will get a message with a “Connect Slack” button2. Send data to Probe via our API. Subscription data can be messy, so we built a simple API you can use to keep Probe up to date. Check out the Getting Started article: https://getprobe.io/docs/api/#getting-started.PricingPaying is required after 14 days of trial. If you are a pre-funding startup - just get in touch and we will be happy to give you a discount."},
{"category": "Analytics", "ranking": "170", "app_name": "Feedier", "supported_languages": ["English", "French"], "pricing": "Paid", "app_description": "Feedier is a Feedback platform that helps you collect Feedback where it's tough. Whether it's customer feedback, employee satisfaction or in-store visitor feedback. Use Feedier to build highly engaging Feedback form that makes the Feedback experience a recurrent game. - A unique experience for every participant (through conditions and sections)- Provide incentives to get better responses with Feedier's rewards manager- Engage with your participants to collect testimonials and 5-star reviews-  Schedule recurrent feedback campaigns or use the Feedier widget in your app.With our Slack application, we give our user the ability to receive notifications whenever something happens in Feedier (milestone reached, Feedback received, billing plan updated, etc.)."},
{"category": "Analytics", "ranking": "169", "app_name": "Incites", "supported_languages": [], "pricing": null, "app_description": "If you’re a brand, publisher, or agency, you need to know what’s grabbing your audience’s attention. Incites tells you exactly what’s happening, in natural language with bite-size, digestible insights.Connect Incites to Slack and receive instant notifications in your chosen Slack #channel for AI-powered deep insights from Incites.With Incites for Slack, you can:• See all AI-powered insights directly in your Slack #channel• Access incites.ai directly from Slack by clicking Show More• Allow Slack team members to request to join your Incites team in one clickAnd of course, Incites for Slack works with both free and paid editions of Slack, doesn't need to be provisioned with a Slack user's email and we don't send emails from our Slack app. Simple as that.Slack + Incites: everything in one place, instantly searchable, available wherever you go."},
{"category": "Analytics", "ranking": "168", "app_name": "CampaignTracker", "supported_languages": [], "pricing": null, "app_description": "CampaignTracker is a link management platform for marketers. The easiest way to manage all of your utm tagged links and keep a full featured history to share across your team. Improve your analytics with clean consistent utm tagged links. Enjoy daily stats in your Slack channel with this simple app."},
{"category": "Analytics", "ranking": "165", "app_name": "Perdoo", "supported_languages": ["English", "French", "German", "Spanish"], "pricing": "Free", "app_description": "Perdoo is the OKR platform used by tomorrow’s market leaders to turn strategy into results. It’s all the tools and expert coaching you need to focus everyone on your strategy and the goals that’ll deliver it. Sign up for free perdoo.com.Our Slack integration helps keep everyone in Slack up to date on what’s happening with your goals in Perdoo. You can send all goal activity to a generic channel and send certain updates to dedicated team channels.The Perdoo Slack app also enables your Slack users to update progress on their goals in Perdoo, directly from Slack.Perdoo plugs into your existing workflows and brings goals to the place your team communication happens."},
{"category": "Analytics", "ranking": "171", "app_name": "CodeFactor", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Installation: after importing your repository, go to repository Settings page on CodeFactor and click Add button for Slack integration.CodeFactor automates a code-review process and helps developers ship better quality software. CodeFactor seamlessly integrates with GitHub and Bitbucket, automatically performs Code Review with every commit or pull request and provides actionable feedback.CodeFactor currently supports the following languages: Bash, C, C#, C++, Java, CSS, JavaScript, Go, Python, Ruby, TypeScript, Scala, CoffeeScript, Groovy, PHP, Dockerfile, YAML, Vue, HTML, Swift, Kotlin, PowerShell, Dart and R.Slack integration, enables CodeFactor to post immediate code quality feedback into the Slack channel of your choice. A great way to keep in touch with the code-quality of all commits."},
{"category": "Analytics", "ranking": "167", "app_name": "ZL Technologies", "supported_languages": ["English", "Japanese"], "pricing": "Paid with free trial", "app_description": "ZL UA is a unified archiving platform, delivered via cloud, on-premises, or hybrid. The platform enables compliance, eDiscovery, and records management of enterprise data, including email, instant messages, files, and social media. Content from Slack Enterprise Grid is captured via Slack Discovery API and indexed for complete information governance and enterprise-wide search within the ZL UA platform. Slack Enterprise Grid customers that use ZL UA for archiving can now enable compliance with a wide range of industry regulations and long term retention requirements, including those for financial services, healthcare and pharmaceutical, manufacturing, and government.The ZL UA platform also offers joint Slack customers comprehensive eDiscovery search and collection, as well as DoD 5015.2 certified records management.To learn more about archiving Slack Enterprise Grid Content in ZL UA or to speak with a Solutions Specialist, please visit https://www.zlti.com/slack-archiving. ZL UA customers can easily add support for Slack Enterprise Grid by contacting their Customer Success Account Manager or messaging customerrelations@zlti.com."},
{"category": "Analytics", "ranking": "166", "app_name": "Anodot Cost", "supported_languages": ["English"], "pricing": "Included with service subscription", "app_description": "Anodot is a real-time analytics and automated anomaly detection system that discovers outliers in vast amounts of time series data and turns them into valuable business insights. Using patented machine learning algorithms, Anodot isolates issues and correlates them across multiple parameters in real-time, eliminating business insight latency, and supporting rapid business decisions through its uncovered insights. With its scalable SaaS platform, Anodot provides typically siloed teams – BI, R&D and Devops – with a single, unified system for both business and IT metrics.With Anodot’s integration with Slack you can:Get your reports directly to your Slack channelsYou can easily designate Anodot Cost reports to be sent to a specific Slack channel. Following the initial installation of the Anodot Cost app for Slack in your Slack workspace, adding Anodot Cost to a Slack channel is as simple as calling ‘/invite @Anodot Cost’ to your channel.Collaborate with your peers around specific reportsOnce you get a report, you can easily continue chatting about it in Slack as part of a dedicated thread or in the channel itself."},
{"category": "Analytics", "ranking": "179", "app_name": "Swarmia", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Swarmia gives modern software teams the visibility and feedback loops they need to do their best work.Connect Swarmia with Slack and GitHub (as well as Jira/Linear) to:• Get pull requests through faster with personal notifications• Reply and/or send emoji reactions to GitHub comments without leaving Slack• Get helpful nudges about the working agreements you’ve adopted as a team• Quickly catch failed CI builds with real-time notifications on your PRs• Stay on top of work in progress with daily digests on your team’s Slack channel• Celebrate completed projects with issue summariesLearn more about the integration between Swarmia and Slack: https://help.swarmia.com/slack-notifications"},
{"category": "Analytics", "ranking": "180", "app_name": "heybooster", "supported_languages": ["English"], "pricing": "Free", "app_description": "heybooster is a web app which is focused on healthy measurement of your website performance in Google Analytics. It audits your account in terms of list of configuration basics.What 'll you get after easy implementation of your GA Account- Google Analytics health score* over 100 - The issues about your analytics measurement process with prioritization- Alerts when something change on your Analytics basic setup configurationHow it works?1. Sign in with Google account.2. Connect your Google Analytics and Slack3. Specify view and channel preferences and get your first audit in a minute!No need to have paid account of Slack.*Analytics Health Score  is indicator of how reliable your Google Analytics for managing all your marketing activity according to."},
{"category": "Analytics", "ranking": "178", "app_name": "GeneBot", "supported_languages": ["English"], "pricing": "Free", "app_description": "Recently, many biomedical research teams have moved to working and collaborating remotely, and consequently, online platforms that enable team communication, such as Slack, have become increasingly popular. While many biomedical researchers use Slack for their day-to-day work, there are currently no applications geared towards this field available on the Slack application directory. In order to bridge this gap, we created GeneBot, a Slack application for discovering knowledge about human genes directly within Slack. GeneBot functions include: - Listening to channel communication or slash commands to trigger the posting of information about single human genes- Listening to channel communication or slash commands to trigger the posting of information about gene sets, which are analyzed via enrichment analysis or connected into networks based on their known protein-protein interactions and co-expression correlations- Serving as an education tool through a quiz that facilitates users to learn gene namesOverall, GeneBot is a Slack application that enables Slack users to perform gene centered analyses directly within Slack. Check out more info about our app: https://maayanlab.github.io/GeneBot/"},
{"category": "Analytics", "ranking": "177", "app_name": "Alvis", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Unleash your inner customer success superpower!The app uses predictive algorithms to calculate customer health scores and help customer success teams prevent user churn.Once health scores are computed using historical data, you can: - View overall health scores and trends.- View health scores and trends of different customer segments.- View customer activity/event trends.- Share health information via Slack to teammates"},
{"category": "Analytics", "ranking": "176", "app_name": "Zebrium", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Zebrium uses machine learning to automatically catch software instances and show you root cause. The technology works by looking for hotspots of correlated anomalies across logs and metrics.Zebrium's integration with Slack allows you to easily access auto-detected incidents and root cause from any Slack channel. This is most frequently used as part of an incident management process. For example, your help desk might have triggered an incident because a web service is unresponsive. Simply type in \"/zebrium analyze\" and Zebrium will respond with details showing root cause. For more information, please visit: www.zebrium.com."},
{"category": "Analytics", "ranking": "175", "app_name": "Mentionlytics", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Get Slack notifications of your Mentionyltics mentions. With Mentionlytics Brand Monitoring you can track your Brand, Competitors or any keyword on the web and Social Media. You will need to first set up a Mentionlytics account at https://www.mentionlytics.com and then connect it to your Slack."},
{"category": "Analytics", "ranking": "174", "app_name": "CustomFit", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Make data smarter and simpler with ready-to-use templates. It lets you choose what, how, and when you want to see from the scattered marketing data across multiple platforms.1. Configure your custom alerts to receive via a channel with this Slack Integration2. Receive reports & alerts pertaining to your website's performance3. Schedule daily, weekly or monthly reports for receiving your metrics in a channel4. Receive real-time alerts on your preferred channel when your Lead, MQL, SQL, or Customers visit your website"},
{"category": "Analytics", "ranking": "173", "app_name": "Dailytics", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Create a custom report connected to your Google Analytics, Fathom, Plausible, Pirsch, or Simple Analytics account.List the most visited content of your page matching a \"page_path\" filter, include charts to measure the performance of specific pages important to your business (people visiting products, vs people visiting the shopping cart, vs people visiting the \"thank you\" page, for example)Get started by creating your first report at https://dailytics.com"},
{"category": "Analytics", "ranking": "172", "app_name": "Glance", "supported_languages": ["English"], "pricing": "Free", "app_description": "Your marketing AI expert :nerd_face: Know cross-channel insights and actions you never thought of using our Marketing Graph!Track metrics in one place (Google Analytics, FB, IG) :sparkles:Spark insights and Alerts :zap:AI and our Marketing Graph based insights and alerts on your cross-channel data (Google Analytics and Mailchimp to begin with)Includes areas such as traffic patterns, email lists, targeting suggestions etc. as well as specific actions, forecast and likely causes.Coming soon :man_dancing:Cross-channel allocation recommendationsRoI boosting recommendations with CRM integration. Enhanced conversational \"Ask Glance Anything\"Ask Glance Anything*  :speech_balloon:\"What’s my bounce rate on Google Analytics this month?\"\"How many new Instagram followers did we get last week?\"Smart Alerts :bell:Triggered if certain metrics increase, decrease or change at all.Multi-channel Slack :calling:Send metrics, reports & alerts to any number of Slack channels.Scheduled Reports :date:Have your social metrics delivered every Weekday at 10am.Get your website data from Google Analytics & Intercom sent every Monday at 9am.Ask Glance Anything :speech_balloon:\"What’s my bounce rate on Google Analytics this month?\"\"How many new Instagram followers did we get last week?\":link: Currently Supported Connections :satellite_antenna:InstagramGoogle AnalyticsFacebook PagesLinkedInFacebook AdsYouTubeTwitterSalesforceShopifyBitlyCampaign MonitorIntercomMailChimpMailgunMixpanelStripeSurveyGizmoSurveyMonkeyPipedriveYelpTypeformTrustpilotWordpressZendeskYahoo FinanceCloudflareCurrency LayerDigital OceanRequires a Glance account (https://tinyurl.com/glancese). The installation will guide you through the process of setting up a Glance account if you don't already have one. Free account type is available."},
{"category": "Analytics", "ranking": "164", "app_name": "Revealbot", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Revealbot is an ad automation and reporting tool for Facebook ads, Instagram ads, Snapchat ads, Google ads, and more.Automate day-to-day ad management routine with our intelligent, custom-tailored automated rule constructorExperiment with scaling tactics by combining rules to turn ads on and off, control budgets and bids, duplication, and more - then be notified in Slack when your automations triggerGet alerts and custom reports right in Slack from Facebook ads and Insights, Instagram, Snapchat ads, Google ads, YouTube, Google Analytics and TwitterAsk Revealbot directly in Slack for ad performance metrics and get them delivered to any channel instantly"},
{"category": "Analytics", "ranking": "163", "app_name": "Winningtemp", "supported_languages": ["English", "Norwegian", "Swedish"], "pricing": "Free", "app_description": "Winningtemp’s AI-powered platform measures the factors that influence employee engagement, mental health, and job satisfaction to provide insightful suggestions for long and short-term developments."},
{"category": "Analytics", "ranking": "162", "app_name": "Frame", "supported_languages": [], "pricing": null, "app_description": "Frame helps you stay on top of every important channel in Slack. You get the best parts of a ticketing system — without leaving Slack, and without your customers being aware.Just invite @Frame to any channel where you work directly with customers.Who uses Frame?Technical customer support. Customer success managers. Solutions/integrations engineers. Partnership managers. Internal support teams (IT/Devops). Anyone who needs to provide important support and collaboration.App highlights:• Smarter notifications that help you stay on top of conversations with less effort. Notify the right people on your team when a conversation is waiting or when it has gone idle without being resolved. You'll never miss a thread again.• Connect Slack to Salesforce, Zendesk, and other internal tools — push conversation records (with transcript) to them with the push of a button or automatically every time a conversation ends.• Review \"active time\" analytics to understand your team's responsiveness and how much effort everyone is spending — across all customer channels and your team members.Typical environments:• Shared channels with your customers• Customers as single-channel guests in your own Slack workspace• \"Community\" Slack workspaces where you invite all your customersPricing:• Free per-channel analytics for unlimited channels.• Tiered pricing for additional in-channel features to help you scale• Enterprise pricing for custom solutionsSupport:To get live help, start a DM with the @frame user — you'll be connected directly to the Frame support team."},
{"category": "Analytics", "ranking": "159", "app_name": "Wellbee", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Streamline Employee Engagement & Performance Management with WellbeeOur Slack-integrated platform automates HR processes for management and streamlines feedback exchange for your teams.:purple_heart: Engagement Tracking: learn about peoples’ motivators in real time using our ready-to-go engagement survey:airplane_arriving: Employee Onboarding (soon!): build onboarding plans to set newbies for success:arrows_counterclockwise: 360 Performance Reviews (soon!): forget spreadsheets — run individual performance evaluations by collecting feedback through Slack:speech_balloon: Feedback collection: build custom surveys or use our survey templates for different managerial or operational needs:bar_chart: Comparative Analytics: employ segmentation to compare teams against demographic criteria, discover trends in your internal work climateLearn more about Wellbee platform and how we can helpVisit our Blog for leadership tips & managerial tricksNeed a hand? Drop us a line @ <support@wellb.ee> and we’ll be glad to help."},
{"category": "Analytics", "ranking": "158", "app_name": "Sisu", "supported_languages": ["English"], "pricing": "Included with service subscription", "app_description": "Sisu’s real-time, cloud-native engine is an industry-first experience where analysts and business leaders are able to seamlessly transition between analyzing what has happened in their business to reveal why it happened automatically and what to do about it – all on a single platform, without writing any code.With our application for Slack, it is easy to keep your teammates informed about how metrics are changing and what is driving those changes:- Set up daily or weekly recurring notifications for analyses at a specified time.- See how your metrics have changed and top segments driving each metric directly in Slack.- Send these updates to one or more channels.- Click through to Sisu's application to further analyze, explore and drill down on segments of interest.To request a demo with our team and learn more about pricing visit https://sisudata.com/get-started."},
{"category": "Analytics", "ranking": "157", "app_name": "Woopra", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "This app must be installed in Woopra's AppConnect as well.  You will be able to configure Woopra triggers and label actions to send messages to your organization's Slack channels.  You can template these messages very simply in Woopra's trigger configuration to contain data from Woopra.  For instance, we at Woopra have a message configured to fire in our Slack whenever someone makes a payment: \"#payments: Woohoo!! Jon Snow from The Night's Watch renewed his subscription for $2000!\""},
{"category": "Analytics", "ranking": "156", "app_name": "GoSquared (Legacy)", "supported_languages": [], "pricing": null, "app_description": "GoSquared helps your team take action faster with real-time analytics, allowing you to monitor, understand, and improve your business.This integration will allow your team to receive traffic notifications in Slack based on triggers configured on GoSquared."},
{"category": "Analytics", "ranking": "151", "app_name": "Looker", "supported_languages": ["English"], "pricing": "Paid", "app_description": "Explore your Looker data and seamlessly bring data into your Slack conversations with the Looker app. The app provides:- Enhanced sharing and notifications, giving you access to your data when and where you need it- Quick access to your favorite Looker content and personal folder"},
{"category": "Analytics", "ranking": "124", "app_name": "Session Rewind", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Use the Session Rewind app for Slack to receive notifications whenever new sessions are recorded which match your Saved Filters.Configuration, including each notification's destination channel and alert frequency, should be done within your settings page in Session Rewind."},
{"category": "Analytics", "ranking": "123", "app_name": "updown.io", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "updown.io is a HTTP(S)/TCP/ICMP monitoring service which checks periodically the URL you want and reports back any anomaly, be it downtime, bad response, degraded performance or even broken SSL certificate. It then publishes alerts in realtime to your Slack channel, email address and/or phone (sms). Finally, updown.io provides status pages with uptime and performance metrics."},
{"category": "Analytics", "ranking": "125", "app_name": "Chatty", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Chatty helps you stay on top of your networking game. We know it's easy to forget to chat with your coworkers when you can't see them.Keep track of how many colleagues you've spoken to lately, and get suggestions for who it's time to reach out to again."},
{"category": "Analytics", "ranking": "96", "app_name": "Productiv", "supported_languages": ["English"], "pricing": "Free", "app_description": "Take back control of your SaaS applications. Get real-time notifications in Slack about upcoming renewals, feature engagement insights, and more across your SaaS apps. www.productiv.com"},
{"category": "Analytics", "ranking": "122", "app_name": "callstats.io", "supported_languages": [], "pricing": null, "app_description": "callstats.io monitors and manages the performance of video calls in an WebRTC application.The callstats.io's Slack app provides notifications from the service- and call-level metrics to a Slack channel. These notifications enable WebRTC apps to identify endpoints/users experiencing poor media quality and diagnose networking issues."},
{"category": "Analytics", "ranking": "121", "app_name": "OnDMARC", "supported_languages": [], "pricing": null, "app_description": "The OnDMARC bot is the quickest way to secure your domain with the DMARC protocol to block phishing attacks. It will help you secure, fix email configuration issues, visualise DMARC reports and provide daily reports on the compliance status and actions for each one of your domains."},
{"category": "Analytics", "ranking": "95", "app_name": "DrugBot", "supported_languages": ["English"], "pricing": "Free", "app_description": "Recently, many biomedical research teams have moved to working and collaborating remotely, and consequently, online platforms that enable team communication, such as Slack, have become increasingly popular. While many biomedical researchers use Slack for their day-to-day work, there are currently no applications geared towards this field available on the Slack application directory. In order to bridge this gap, we created DrugBot, a Slack application for discovering knowledge about drugs directly within Slack. DrugBot functions include: - Listening to channel communication or slash commands to trigger the posting of information about single drugs or other small molecules - Listening to channel communication or slash commands to trigger the posting of information about drug sets, which are analyzed via enrichment analysisOverall, DrugBot is a Slack application that enables Slack users to perform drug centered analyses directly within Slack. Check out more info about our app here: https://maayanlab.github.io/DrugBot/"},
{"category": "Analytics", "ranking": "94", "app_name": "Canopact", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Canopact turns your Slack workspace into a powerful channel for internal communications :muscle:With Canopact’s internal communications app, you can get started for free in just a few minutes and do the following: :art: Customize visually engaging, interactive Slack posts, with the ability to embed longer form content or links within a call to action. Create internal newsletters and other announcements which stand out in a busy workspace. :eyeglasses: Provide relevant stakeholders with visibility over upcoming internal comms through a shared schedule in Slack.  :envelope_with_arrow: Schedule a Slack post on behalf of a colleague (e.g., CEO), so that the post is sent from their account at the specified time, pending their approval.:bar_chart: Analyze meaningful employee engagement data on Slack, such as unique clicks and average reading time. :label: Tag your internal comms by their topic, campaign and more. Use tags to segment analytics and help understand what your employees care most about. For free internal communications templates, insights and resources, check out Canopact’s Blog! :writing_hand:"},
{"category": "Analytics", "ranking": "181", "app_name": "ProfitWell", "supported_languages": ["English"], "pricing": "Free", "app_description": "ProfitWell provides reporting and analytics for subscription companies — 100% free.With ProfitWell’s “Pulse” notifications for Slack, you get real-time alerts when:• A new customer signs up• A customer upgrades/downgrades• A customer churns• A customer cancels• A customer’s payment fails• A customer’s payment is RetainedThis integration requires a connected ProfitWell account for setup. Sign up now at profitwell.com"},
{"category": "Analytics", "ranking": "93", "app_name": "Sandbox", "supported_languages": ["English"], "pricing": "Free", "app_description": "Sandbox is a real-time, actionable talent intelligence dashboard enabling you to keep your finger on the pulse of your organization. Effectively leverage your talent by aligning the right team members to the right work, closing knowledge gaps, and collaborating to tackle your long to-do list.  Start with Slack then integrate Jira, Salesforce, Asana, Monday, Greenhouse, Trello, and more to gain deeper insight into your talent. Sandbox connects data across your project management tools to provide real-time, actionable insights into how effectively you’re leveraging your talent and identify opportunities to improve performance. As a manager, you’ll lead with confidence knowing exactly how to uniquely engage and develop each of your team members. Watch your talent lean-in by raising their hand for opportunities. Gone are the days of wondering if your team is engaged in their work. Start motivating your talent today!  Add to Slack and get started for free."},
{"category": "Analytics", "ranking": "184", "app_name": "Leadberry", "supported_languages": [], "pricing": null, "app_description": "Leadberry is a B2B Lead Generation tool, powered by Google Analytics. Connected to Slack, leads generated by Leadberry will appear in your designated slack channel, making it even more easy to follow up on your hot B2B leads!"},
{"category": "Analytics", "ranking": "186", "app_name": "PatternAI", "supported_languages": ["English"], "pricing": "Free", "app_description": "This app alerts PatternAI users of events in their account such as new meeting recaps, patterns, comments, notes and others. Learn in real-time when your patterns are ready to be analyzed or when your teammate has left you a message or shared a pattern with you."},
{"category": "Analytics", "ranking": "201", "app_name": "allstacks", "supported_languages": [], "pricing": null, "app_description": "Allstacks helps you understand your teams and projects by combining data on user activity from all software tools your team uses.  We help you understand your projects by delivering insights based on real data.  Our powerful machine learning algorithms help you discover where problems are, and how to solve them.We use Slack as one of the data points in this data collection process.  From Slack, we are able to generate and gather data about how your team is communicating, and present that along with the information about your development process.  From this, you can see if there are communication bottlenecks or people being left out of the loop in your dev team.Use of Allstacks is currently part of a paid platform.  Please contact us at info@allstacks.com to learn more about how to use allstacks to improve and better understand your software team!"},
{"category": "Analytics", "ranking": "185", "app_name": "Chronicle", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "A lot goes on in the world of Slack and it can be hard to stay on top of it all. Chronicle provides you with many features to help monitor and manage everything thing going on in your workspace.Chronicle can: - Alert you about 25 different events in your workspace - Scan messages for patterns defined by you - Help you archive inactive channels to keep your workspace pristine - Provide tools to make archiving channels automated - Work seamlessly with multiple workspaces or Enterprise GridsChronicle provides a 30 day free trial for all plans, as well as a free plan. You can sign up for Chronicle and try it out by simply adding Chronicle to Slack."},
{"category": "Analytics", "ranking": "187", "app_name": "Lexi by Peoplelogic.ai", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Unlock insights into your organizational health by inviting Lexi to your Slack Channels. Lexi, by Peoplelogic, is an AI bot that can help to predict employee attrition, provide fun stats about your team, and more importantly, allow you to keep a pulse on your overall organizational health.Peoplelogic connects to the tools you use every day to provide real-time feedback and insights to run a healthy, scaling, and profitable business. Organizational Health FactorBy integrating with tools your team uses every day like email, Zoom, and of course Slack, Peoplelogic presents you with an organizational health factor (OHF). This one simple score is a leading indicator that helps managers understand how their team is performing overall. Peoplelogic surfaces key recommendations to continually improve your score and drive towards happier employees and a healthier organization.StayFactor – Employee Attrition PredictionIn a world where retaining top talent is key, Peoplelogic works in the background to provide a prediction of an employee’s likelihood to stay or leave your company. This is called StayFactor. Peoplelogic does all of this in the background. No need for additional apps or pulse surveys. By connecting Lexi by Peoplelogic to Slack, the StayFactor score of your team will become even more accurate and you will be able to have clear action steps to make a meaningful impact on employee retention.Connect TodayYou can connect Peoplelogic’s Lexi to your team’s Slack to gain real-time insight into the overall health of your organization. You can ask Lexi to perform commands such as:- /lexi show me daily sales activity by team member- /lexi show me top employee by stay factor - /lexi show emotional range by skillWith Lexi by Peoplelogic, you get untethered access to the insights, recommendations, and data within your Peoplogic account—empowering managers with quick and easy tips to improve employee retention and maintain an overall healthy organization."},
{"category": "Analytics", "ranking": "210", "app_name": "Outgrow", "supported_languages": [], "pricing": null, "app_description": "Using the Outgrow/Slack integration you can- Pass your Outgrow quiz, calculator, poll, chatbot, assessment, contest, survey, form, and recommendation leads to multiple Slack channels (whether it’s a sales channel or a marketing channel). - Segment these leads by location, questions answered, outcomes, date visited, actions, and various other filters. And then pass this data onto multiple Slack channels. For example, if you wanted to send leads with a higher budget to a particular channel, and leads with a lower budget to another channel, you can easily do this by collecting this data using an Outgrow experience and then passing the lead onto Slack. With over 55k+ users in 150+ countries, Outgrow has been recognised by G2 Crowd as the top B2B Tech company in New York. Whether you are a marketer, publisher, or advertiser Outgrow lets you make your content modern and user-friendly by allowing you to build quizzes, calculators, polls, eCommerce recommendations, surveys, chatbots, and contests. Whether you want to tell a story, showcase your products or services, boost lead generation, reach your editorial KPIs, segment leads, or learn more about your audience: Outgrow can do it all for you! Choose from over 800 professionally designed templates and funnels that cater to a diverse range of industries. An Outgrow paid subscription is required in order to be able to use this integration."},
{"category": "Analytics", "ranking": "208", "app_name": "Hevo", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Move all data to your warehouse - any source, any destination, any formatHevo helps you bring data from any source - SQL/NoSQL databases or cloud applications or mobile & web SDKs, into a data warehouse - Redshift, BigQuery...Our integration for Slack enables users to receive real-time updates about their account activity into their Slack Channels"},
{"category": "Analytics", "ranking": "207", "app_name": "UptimeBot", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "UptimeBot is a simple website monitoring tool that notifies you in case of downtime or slow performance of your websites.Get instant downtime alerts delivered to your developer team chat space.Setup multiple checks to monitor different parts of your project. Alerts are delivered to the Slack channel of your choice.UptimeBot comes with an incident management system that helps coordinate efforts to mitigate downtime and see who's responsible for resolving an incident. It's great for incident resolution and task management.UptimeBot is built for Slack - no need for context switching and having to login to external monitoring websites. Simple UI allows you to manage your checks without leaving Slack. Main Features:- Multiple Test Locations :earth_americas:- Incident management :raising_hand:- Renewal Reminders for expiring SSL certs and domains :bell:- Slow loading time alerts :timer_clock:- Root cause visibility :mag:Get Started for FREE:- Free plan gives 2 alerts (monitoring URLs) per Slack workspace for free!- We offer flexible usage-based plans for teams who need more.Learn more at https://uptime.bot/"},
{"category": "Analytics", "ranking": "209", "app_name": "Churn Buster", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Use Churn Buster to monitor failed payments for your recurring revenue business.Among other things, this integration notifies your team whenever an email in one of your campaigns can't be delivered due to an email bounce.This allows your customer success team to jump into action and retain a customer who may have otherwise churned.Churn Buster requires a paid subscription - you can view pricing here: https://churnbuster.io/pricing"},
{"category": "Analytics", "ranking": "205", "app_name": "Microsoft Cloud App Security", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Microsoft Cloud App Security is a Cloud Access Security Broker (CASB) that supports various deployment modes including log collection, API connectors, and reverse proxy. It provides rich visibility, control over data travel, and sophisticated analytics to identify and combat cyberthreats across all your Microsoft and third-party cloud services."},
{"category": "Analytics", "ranking": "204", "app_name": "InTrack", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "InTrack is a real-time tracking script and website uptime/downtime monitoring tool that provides notifications via Slack and email. Tracking scripts we currently monitor: Google Analytics, Facebook Pixel, and HubSpot (Google Tag Manager and more coming soon!)Add your list of websites to track and monitor by using our bulk uploading feature to add as many sites as you need. Designate additional team members to be notified when tracking scripts go missing or website downtime occurs. View a time record of incidents that have occurred to ensure peace of mind for you and your clients. Pricing: InTrack is free for your first 3 websites. Need to monitor additional sites? Visit our website to learn more about our Freelancer and Agency plans: https://www.intrack.app."},
{"category": "Analytics", "ranking": "206", "app_name": "DataSet", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "DataSet offers a cloud based platform for high-speed event management and server monitoring. The service is a paid enterprise software as a service platform, and you will need an active DataSet account to use it.The Post to Slack DataSet app lets you post graphs to team members on Slack, with a link back to DataSet to see the underlying logs."},
{"category": "Analytics", "ranking": "203", "app_name": "Cloud Spend Bot", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Cloud Spend Bot is a Slack-integrated billing manager solution that tracks how much you spend on your connected cloud accounts.You get a full overview of where you spend your money and with automated spike alerting, you can take action to reduce your bill and avoid unexpected charges.Features include...:cloud: Connect with Amazon AWS, Microsoft Azure and Google GCP accounts:money_mouth_face: Receive a report of how much you're spending across your cloud every day:rotating_light: Automatic alerts will warn you if there is an unexpected spike in your spending:rocket: Select a Slack channel and time when you want to receive your spend report:busts_in_silhouette: Collaborate with your team and set user permissions to keep your data safeStart with a free 14 day trial."},
{"category": "Analytics", "ranking": "202", "app_name": "opserv.io", "supported_languages": [], "pricing": null, "app_description": "opserv.io monitors your data using google analytics real-time API. When alert conditions are matched it will notify you.  This could be used to monitor service uptime, user registrations, downloads or sales."},
{"category": "Analytics", "ranking": "198", "app_name": "Inspector", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Inspector helps software developers to identify bugs and bottlenecks in their applications automatically. It's able to detect a variety of events in your application for which you can be notified in Real-Time directly in your Slack workspace.Monitor your code execution in real-time and identify bugs and bottlenecks before your users do."},
{"category": "Analytics", "ranking": "197", "app_name": "Surveyapp", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Manage your whole Customer Experience using Surveyapp platform – and find out how customers are interacting with you at every touch point. Wherever your customers are, get feedback on their experiences in the moments that matter – in person, online, by email – and ensure that every voice is heard. By capturing reactions in real time, you can build a holistic perspective of how customers are feeling towards your service, and take proactive actions to fix problems before they impact your bottom line.Track the entire Customer Experience journey with detailed analytics and predictive intelligence that let you understand trends, identify patterns, and focus attention on customer retention and loyalty. Spot the key drivers that are making your customers happy or not, and then share those reports and insights with team members via the Surveyapp analytics suite.When service levels drop, Surveyapp’s case management software makes sure alerts are sent to the right team member for the job. By acting quickly, you can turn around customer satisfaction, retain loyalty, and grow spend.Get all your teams working as one to improve the customer experience. Surveyapp is now available in Slack making it easy to receive and respond to alerts, assign tasks, and track progress – ensuring that the customer remains your centre of attention."},
{"category": "Analytics", "ranking": "196", "app_name": "York IE Fuel", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Get digestible market and competitive intelligence updates and notifications from York IE Fuel. You can create subscriptions in a channel with the /fuel slash command.More information can be found on our knowledge base: https://knowledge.york.ie/how-do-i-install-and-use-the-fuel-slack-integration"},
{"category": "Analytics", "ranking": "200", "app_name": "Zoho Survey", "supported_languages": [], "pricing": null, "app_description": "Get your team onboard your surveying. Be it polling your channel, notifying your team of responses, or sharing surveys and reports with them, Zoho Survey makes it easier for Slack teams to keep their decisions on point.Here's how you can use it:/zsurvey - Collect responses from your Slack team. Setup notifications for your surveys. Share your survey reports with your Slack team./zsurvey_create - Create a new one-question poll./zsurvey_notifications - Manage the response notifications you have setup."},
{"category": "Analytics", "ranking": "199", "app_name": "Feedis Proxime", "supported_languages": ["English", "French"], "pricing": "Free", "app_description": "Receive Slack alerts right there into your work channels, whenever you receive a new review in the stores!With Feedis Proxime, centralize all your feedback sources (reviews, mails, etc.), get deep semantic analysis (emotion detection, issues, requests, complaints extractions, etc.), and read and reply easily!Contact us at contact@feedis.io"},
{"category": "Analytics", "ranking": "195", "app_name": "Worknet", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Team up on Slack with your internal teams and customers to drive success, service, and growth.Enable your teams to collaborate effectively in Slack, co-piloted by Generative AI (GPT).Worknet is used by companies such as Bill, Monday.com, MonteCarlo, Airbyte, and Certinia (formerly known as FinancialForce).Co-pilot your team and customers using GPT. Boost productivity and customer satisfaction by suggesting responses, analyzing sentiment, providing summaries, and improving team knowledge. All seamlessly integrated within Slack, Salesforce, Zendesk, and Intercom.This includes:1. Unified inbox and triage - brings all items that require your attention to one single place. You can assign them to people or teams, use smart snooze, and add internal notes. This helps in managing Salesforce case swarming and Zendesk side conversations.2. Drive engagement - send bulk messages to channels and individuals, such as outages, product announcements, changes in product usage, and more.3. Get enhanced visibility into you Slack conversations -  information like response time, time to first response and time to resolution, leaderboard, customer health, team workload, messages classification by multiple dimensions like sentiment, priority, product area associated to channels and individuals.  4. Bi-directional integrations with Salesforce, Zendesk, & Intercom to streamline ticket creation and collaboration. One click integration as well as form support. 5. WorknetGPT - provides thread and channel summaries, categorizes conversations, and suggests responses based on the company's proprietary knowledge base and previous conversations and tickets.Usage of the app requires granting permission to access selected channels and some limited Slack user's data. For more information regarding our data collection, we urge you to review our privacy policy before you install our add-on, available here: https://www.worknet.ai/privacy-policyWorknet is SOC 2 Type II certified and GDPR compliant.Disclaimer: WorknetGPT is leveraging the power of OpenAI via APIs. While our platform harnesses the sophistication of AI, remember that responses may require additional verification. We encourage double-checking any provided information. Any queries or reports? Connect with us at info@worknet.ai. Your insights help us continuously improve."},
{"category": "Analytics", "ranking": "193", "app_name": "Dataminr", "supported_languages": [], "pricing": null, "app_description": "The Dataminr Slack integration delivers customized breaking news alerts into a dedicated Slack channel, allowing journalists and media professionals to collaborate seamlessly across the newsroom.Journalists receive a quick alert overview in Slack, then select the relevant embedded link to view the alert in the Dataminr web application or on Twitter.Developed with Twitter, Dataminr for News uses proprietary algorithms to instantly analyze all 500 million public Tweets per day and deliver the earliest tips to breaking news and pre-trending stories to more than 250 newsrooms by integrating into their workflow.This integration is available to Dataminr for News enterprise clients and a paid Dataminr account is required for setup. To learn more email slack@dataminr.com."},
{"category": "Analytics", "ranking": "194", "app_name": "Casepoint", "supported_languages": ["English"], "pricing": "Paid", "app_description": "\"Casepoint streamlines Slack data collections for legal discovery workflows. Enjoy faster preservation and collections of Slack data while decreasing risk of spoliation or missed data. Organizations that use Casepoint’s Slack integration will be able to:- Target specific Slack channels for collection, decreasing costs associated with over-collection.- Identify all Slack channels a user is associated with and perform one collection for the set.- Collect both public and private channels.- Channel collections include edited and deleted messages.- Attachments are collected and kept within standard parent-child relationships to streamline the review process. - Channel reactions and emojis are included with the collection.- Third party Slack accounts are available and collectable. - Content from all parties within shared channels are collectable. - Channel communication may be threaded and divided based on custom configurations. \""},
{"category": "Analytics", "ranking": "192", "app_name": "ZeroFOX", "supported_languages": ["English"], "pricing": "Paid", "app_description": "ZeroFOX for Slack protects your internal and external collaboration teams by finding and eliminating malicious, inappropriate or confidential content posted in your Slack channels.  ZeroFOX for Slack is set up in seconds, identifies attacks and compromising content in real-time, and provides in-line automated remediation. With ZeroFOX, protect your employees and collaboration partners from malicious & inappropriate users, malicious links, malware, ransomware, data loss, insider threats, violence, discrimination, abusive posts, pornography, inappropriate language, credential leakage and more. Simply select the channels that you’d like to monitor and ZeroFOX does the rest. ZeroFOX, the innovator of social media & digital security, protects modern organizations from dynamic security, brand and physical risks across social, mobile, web and collaboration platforms. Using targeted data collection and artificial intelligence-based analysis, ZeroFOX protects modern organizations from targeted phishing attacks, credential compromise, data exfiltration, brand hijacking, executive and location threats and more. Recognized as a Leader in Digital Risk Monitoring by Forrester, the ZeroFOX SaaS platform processes and protects millions of posts, messages and accounts daily across the social and digital landscape, spanning LinkedIn, Facebook, Slack, Twitter, Workplace by Facebook, Instagram, Reddit, Pastebin, Tumblr, YouTube, VK, mobile app stores, the deep & dark web, domains and more."},
{"category": "Analytics", "ranking": "191", "app_name": "Lead Honestly", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Lead Honestly helps you actively engage your employees and improve your 1-on-1 meetings with recommended questions, simplified scheduling, and automated reminders.Our Slack integration is designed to work with you and your team where you already work, inside Slack. We’ll send you a direct message instead of an email when you’re available to:• Provide a weekly digest of your upcoming 1-on-1 meetings• Notify you when an employee has responded to their questions and is ready to meet• Notify your employees of their upcoming 1-on-1 meetingIf you’re unavailable when a notification is ready, no worries, we’ll try again later rather than interrupt you.To get started, you must have an account. Login or try Lead Honestly for free at https://leadhonestly.com.Learn more about our Slack integration at https://leadhonestly.com/slack-integration.Lead Honestly Praise“Lead Honestly helps me ask the questions that get to the heart of issues with team members. Not only has it helped me solve issues and grow the business, but I’ve been able to drive deeper relationships with our team members.”– Tom Cullen, Co-Founder of LaunchPad Lab“Lead Honestly is a vital tool that allows me to connect deeper and broader with my team. The questions and path provided are well thought through, and I’m reassured that these questions are coming from proven leaders with a track record of building successful teams.”– Mark Won, Managing Partner at Ascend Growth Partners"},
{"category": "Analytics", "ranking": "223", "app_name": "Splunk Audit API App for Slack", "supported_languages": ["English"], "pricing": "Free", "app_description": "Slack App consisting of the Audit Log read scope for a Splunk application. This app can be used by the \"Splunk Add on for Slack\" to request for \"auditlogs:read\" scope to retrieve Audit logs into Splunk."},
{"category": "Analytics", "ranking": "190", "app_name": "Survicate", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Survicate is an all-in-one customer feedback tool that allows you to collect actionable insights and instantly send them to Slack. Make use of Survicate survey suite and find answers to questions that matter to your business – faster.Integrated with Slack, Survicate delivers survey responses in real time to a channel of your choice. Be notified about every new answer and make it accessible to the rest of the team, too!Survey responses are sent as a single message and displayed question by question. If the respondent's identity is known, you will be able to see who’s behind the answer right in the Slack channel.Curious? Give it a try – installation is as simple as it can get!"},
{"category": "Analytics", "ranking": "189", "app_name": "CloudForecast", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "CloudForecast helps engineering teams keep a close eye on their variable AWS cost with a visually friendly daily report right in Slack and email. Our cost reports provides reassurance that things look normal and notifies teams of any anomalies with AWS spend.With our Slack integration, you and your team will receive daily reports containing key information about your AWS spend (daily spend, monthly spend, ...). CloudForecast also provides the ability to send tailored reports to different channels (e.g. #front-end vs #back-end vs #DBA, ...).On average, 20-30% of your AWS bill will go to waste on a yearly basis due to lack of spend monitoring or having teams do a quick review of cost on a daily basis. Our reports take less than a minute to digest every morning and helps companies ensure their cost do not spiral out of control.• Daily Slack and email reports• Accurate end of the month spend forecast• Interactive \"month to date\" spend graphs• Cost alerts for daily spend, product, region, tags & sub-accounts• Customize alert thresholds to meet your needs.• Build, create and send multiple reports based on tags and sub-accounts to different channels and teams. • Risk free 30-day Free Trial.• Plans starting only at $99/monthFor more information• Sign up for CloudForecast: https://app.cloudforecast.io/users/sign_up• CloudForecast website: https://cloudforecast.io/What our Customers are Saying about CloudForecast:  \"CloudForecast succinctly highlights spikes in cost and areas which I should act upon right now in order to save money.\"  - Bruno Miranda, Doximity \"The email help weeds out the noise and focuses on what is important on my AWS bill. (...) CloudForecast has saved us thousands of dollars of recurring cost!\" - James Avery, AdZerk \"Since we began moving ourselves and our clients to AWS, we've been searching for a cost monitoring tool that is both easy to use and affordable.  We've finally found a tool that meets our needs in CloudForecast.\" - Jason Still, SlingShot"},
{"category": "Analytics", "ranking": "188", "app_name": "PowerSuite", "supported_languages": [], "pricing": null, "app_description": "Easily analyze and secure your organization’s Slack workspaces.PowerSuite provides administrators a single pane of glass to manage multiple platforms, including Slack, Zoom, and Microsoft Teams. Compare key statistics between Slack and Teams using our workplace analytics tool. Monitor important collaboration security issues like guest access, app integrations, and data sharing.Use PowerSuite’s actionable insights to optimize your Slack deployment.The industry-leading PowerSuite is the first cross-platform software to empower IT teams to manage and secure collaboration and communications environments.  This application is required to integrate Slack data into your core PowerSuite tenant. To install this app, you must have an existing PowerSuite tenant, which can be purchased from Unify Square: https://www.unifysquare.com/platforms/slack/contact/. For more information on PowerSuite for Slack, please visit https://www.unifysquare.com/platforms/slack/."},
{"category": "Analytics", "ranking": "183", "app_name": "New Relic - EU", "supported_languages": ["English"], "pricing": "Free", "app_description": "New Relic's cloud-based platform gives developers, engineers, operations, and management a clear view of what's happening in today's complex software environments. So you can find and fix problems faster, build high-performing DevOps teams, and deliver delightful experiences for your customers.Please contact support@newrelic.com for App supportThis integration will allow you to receive updates via Slack based on your New Relic setup.This is a dedicated integration for the EU data region.For support please contact: https://support.newrelic.com/ or email us at email support@newrelic.com."},
{"category": "Analytics", "ranking": "224", "app_name": "Smart Sender Assistant", "supported_languages": [], "pricing": null, "app_description": "With the SmartSender-Slack integration, you can receive notifications on selected channel to keep you updated on the following events:Contacts File Import CompletedContacts File Import  FailedFile Export CompletedEmail Campaign StartedEmail Campaign FailedSMS Campaign StartedSMS Campaign FailedCredit Card Charge FailedYou always can change your notification settings in your account settings"},
{"category": "Analytics", "ranking": "239", "app_name": "Atrium", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "High performing managers are the difference between team success and failure. But too often managers lack the training and the tooling to succeed.Atrium is a Data Driven Team Management platform that is custom made to help AE, SDR, and CS / AM managers use data to improve team performance.With Atrium, managers have:1. Out of box library of all the KPIs that matter2. Proactive goal tracking3. Early warning alerting of important issues before they become problems4. Performance issue diagnosisThe solution is simple to deploy and adopt, with instant-on setup and automated data capture from your key systems.Further, with the Slack integration enabled, you can publish Atrium insights directly to your team via Slack.Get started in 90 seconds at www.atriumhq.com."},
{"category": "Analytics", "ranking": "238", "app_name": "Backtrace", "supported_languages": ["English"], "pricing": "Free", "app_description": "Provides real-time notifications for crashes and errors that occur in your apps and games. The notifications provide important crash and error data needed to prioritize and quickly resolve errors in the context of your conversation without the need to leave Slack. Backtrace Integration for Slack allows you to:- Trigger alerts to automatically send errors to your team channels.- View callstacks and important information required to quickly resolve errors.- Triage, assign, and resolve errors from within Slack.This feature is free for all account types. Get started at backtrace.io"},
{"category": "Analytics", "ranking": "240", "app_name": "Chargifi Alerts", "supported_languages": ["English"], "pricing": "Paid", "app_description": "Get alerts in Slack whenever any of your Chargifi spots need attention.  Manage your alert settings through Slack. Allow everyone on your team to have visibility of exactly which alerts are currently affecting your wireless charging network.NOTE: The Slack integration is freely available to all Chargifi customers."},
{"category": "Analytics", "ranking": "237", "app_name": "Bleemeo", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Get notifications of your infrastructure monitoring in your team chat with Bleemeo app for Slack.Bleemeo app for Slack is designed to work with Bleemeo Cloud Monitoring platform. An account on Bleemeo Cloud Monitoring Platform is required to use Bleemeo app for Slack. You can create your account for Free on https://bleemeo.comBleemeo is a Cloud Monitoring Platform that allows DevOps and IT teams to monitor their infrastructure from the servers to the applications.It only takes 30 seconds to get a complete live picture of your infrastructure:- our open-source agent discovers services and creates checks and metrics- server and services dashboards are automatically created- notifications rules are automatically created to let you know when something goes wrong- mobile application (iOS and Android) let you receive notifications and view all dashboards- you can create custom dashboards and notifications based on your business case- Kubernetes, containers, and elastic infrastructure are fully supported- Network devices and equipment with SNMP are supportedBleemeo product is based on monitoring standards and Open Source tools: Prometheus, Nagios, Statsd are fully supported and integrated in the core of our product.Several plans are available offering checks with basics metrics to a more complete solution with business metrics.For questions or help, please contact support@bleemeo.com."},
{"category": "Analytics", "ranking": "236", "app_name": "Anecdote", "supported_languages": ["English"], "pricing": "Free", "app_description": "With Anecdote in Slack, you can ask questions and receive weekly summaries on what people are saying about your product, making it easier for you to stay up-to-date with your customer's needs and preferences. You can easily provide personalized responses to your high value customers and keep their loyalty intact.Anecdote for Slack is the ultimate solution for taking your customer feedback and experience to the next level. Our advanced language model, ChatGPT, makes it effortless for you to gather insights from various sources, including app stores, survey platforms, and customer support. :robot_face: Bring Anecdote to your Slack channels:convenience_store: Connect to data sources like Google Play Store or App Store:inbox_tray: Receive weekly summaries of what people are saying about your product:speech_balloon: Ask the bot about anything related to your product's customer feedbackOur powerful analytics engine, powered by GPT-4 technology, simplifies the review process by summarizing your customer's feedback accurately. You can easily identify the key areas of improvement and discover what your customers are saying and feeling about your product. Anecdote supports human-like conversation, making it easy for you to connect with your customers and understand their needs.Whether you're a small business owner or a large corporation, Anecdote provides valuable insights into your customer's feedback, allowing you to improve your product and provide personalized support to your high-value customers. Try Anecdote today, and discover how easy it is to collect customer feedback and keep your customers satisfied.Disclaimer: Please note that while Anecdote strives to provide accurate and reliable summaries of customer feedback, there is always a possibility of generating inaccurate responses due to the nature of language processing technology. As such, we recommend verifying the accuracy of the insights provided by Anecdote with additional sources and exercising caution in making business decisions based solely on the information provided by the app."},
{"category": "Analytics", "ranking": "234", "app_name": "People.ai", "supported_languages": ["English"], "pricing": "Paid", "app_description": "People.ai delivers the industry’s leading Revenue Intelligence platform. Using patented AI technology, it transforms business activity such as email, meetings, and contacts, into account and opportunity management solutions that increase sales rep productivity, accelerates revenue growth, and maximizes marketing ROI. Enterprises such as AppDynamics, DataRobot, Okta, and Zoom rely on People.ai to unlock growth.Connect People.ai with Slack for a more efficient and streamlined workflow for sales teams. With this integration in Slack, any user can add details to business activities that People.ai intelligently attaches to accounts and opportunities. High-quality data provided by People.ai helps to accelerate pipeline generation and improve the execution of every deal.This app requires a paid People.ai account for use. Contact us for a demo at https://people.ai/get-demo."},
{"category": "Analytics", "ranking": "235", "app_name": "Dealfront", "supported_languages": ["English", "French", "German"], "pricing": "Paid with free trial", "app_description": "Connect Slack with Dealfront, the go-to-market platform for Europe that gives businesses everything they need to win leads and close deals. Dealfront’s multilingual AI understands the nuances of local markets, so it can access data and insights that other tools can’t, all within the most complex compliance standards. Get access to 30M+ deep company profiles and 89M+ contacts with Dealfront, that are truly GDPR compliant. Trusted by 10,000+ customers from across 27 countries. Slack integration will send notifications to the channel of your choice when a match of your ideal customer profile (ICP) visits your website. Setup powerful filters including company size, location or even CRM related filters to identify existing accounts or accounts with open opportunities."},
{"category": "Analytics", "ranking": "226", "app_name": "XiteiT", "supported_languages": ["English"], "pricing": "Paid", "app_description": "XiteiT provides a simple and efficient platform for unifying all your monitoring, automation, and productivity solutions so you can standardize your operational procedures and improve the productivity of your SRE\\NOC engineers.Most monitoring systems (Icinga, Nagios, Zabbix and Datadog for example) can notify the users about new alerts via email, Slack, SMS, or other methods. To retrieve the incidents from Slack, the XiteiT dev team wrote the Slack app which connects XiteiT with Slack. The Slack app enables the XiteiT application to retrieve the data from the Slack channel and insert it to XiteiT DB after parsing to the required format. XiteiT admin user will define which channel XiteiT will access and which data will be collected (Based on filters defined in XiteiT) so the owner of the Slack channel has full control of what information will be retrieved. We do not collect or use any personal information of Slack users.Using AI capabilities combined with years of incident management best practices, allows XiteiT customers to achieve true observability and controllability into their cloud production environments. XiteiT uses correlation and aggregation algorithms to reduce alert noise and combines them with runbook automation for fast and efficient remediation and root cause analysis.Main features of XiteiT are:•    One dashboard for all alerts from multiple monitoring sources•    Cross platform alerts processing (email, Slack, API, etc.…)•    Alerts timeline dashboard•    Composite alerts management based on cross monitoring platform events•    Business and technical KPI monitoring•    Runbook automation•    Pro-active management and ability to set single tasks or recurring tasks team•    Real-time runbook management•    Ticketing system, events documentation •    Team collaboration – private and public messages, including tracking and reports•    Shift management including transfer documentation, summary and history•    Knowledge Base of operations events•    Reports and analytics – Daily/Weekly/Monthly scheduled or manually generated reports•    RCA – Alert Lifecycle Management, allowing root cause analysis management Notes:•    The license of XiteiT is based on monthly subscription BUT it is NOT public yet as we are in Beta process and use it with selected customers. For more details please send email to sales@moovingon.com•    Installation of the XiteiT Slack app without license from XiteiT does not bring any benefits to customers•    Customers can add resources such as Slack in XiteiT admin. The installation will be done automatically to customers’ Slack. Customers’ Slack admin should approve XiteiT app in Slack"},
{"category": "Analytics", "ranking": "233", "app_name": "Tenderly", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "In-depth Smart Contract monitoring, alerting and troubleshooting for your Ethereum based DApps.With the Tenderly Slack integration, you can get real-time notifications when events of your interest happen on the Ethereum blockchain."},
{"category": "Analytics", "ranking": "232", "app_name": "Trevor Bot", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Trevor.io replaces data requests inside your company, letting your whole team get answers from your data, build gorgeous dashboards, and share results to tools like Slack, Google Sheets, and Zapier. Trevor Bot sends you snapshot summaries of data and alerts you whenever something important happens (e.g. a customer signs up, an order is made or your team reaches some milestone). You can combine text with data to generate context-specific Slack messages that trigger when your queries return new results. E.g. yesterday we sold {count} of {product}. Trevor Bot requires that you have an account at Trevor.io. Our free plan includes Trevor Bot. If you have any questions or feedback, please feel free to head to https://trevor.io and contact us directly via the blue Intercom in the bottom right-hand corner. You can also email us at team@trevor.io."},
{"category": "Analytics", "ranking": "231", "app_name": "Plus", "supported_languages": ["English"], "pricing": "Free", "app_description": "Plus is the easiest way to bring all of your team’s data wherever you need it. Take live Snapshots of any app and share them in Slack or embed them in the productivity tools you use every day. Our goal is to make any integration as simple and intuitive as sharing a screenshot. The Plus app for Slack lets you share rich previews and create scheduled subscriptions of Plus Snapshots and Pages within Slack. It’s the fastest way to bring dashboards from any app directly into your Slack workspace.Plus was founded to make it easy for customers to access their data, no matter where it lives, and it is our first priority to keep that data safe. We follow enterprise-grade security practices, maintain SOC 2 Type II compliance, and build products with control and transparency in mind.Have questions or want to learn more? Send us an email at support@plusdocs.com or visit https://www.plusdocs.com/."},
{"category": "Analytics", "ranking": "230", "app_name": "Minter.io", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Minter.io is Instagram, Twitter and Facebook Analytics. Get valuable insights into your Instagram Followers and Posts (Gender, Countries, Cities, Activity, Engagement, Sentiment).The Slack integration sends you daily, weekly and monthly reports (Followers, Likes, Comments, Posts, Contributors) ."},
{"category": "Analytics", "ranking": "229", "app_name": "Moji", "supported_languages": ["English"], "pricing": "Free", "app_description": "Emojis are everywhere and its time to make them count!Moji will keep track of all the emojis used on the channels that it gets invited.It can show you your favorite emojis and keep a leaderboard of the teammates who use emojis the most and more! Add Moji to your channels and have fun! :tada:"},
{"category": "Analytics", "ranking": "228", "app_name": "Cincopa", "supported_languages": [], "pricing": null, "app_description": "Cincopa is an online video and multimedia platform. Would you like to streamline data exchange with your team, clients, app users or website audience? Cincopa provides a new app for Slack that allows to improve your workflow. You can easily install Cincopa app to your Slack workspace and get instant notifications to a selected Slack channel:- When multimedia assets are uploaded to your Cincopa storage or deleted from your account;- When new galleries are created, changed or deleted;- Reports from Cincopa Video Analytics;- Changes in your Cincopa account;- Updates from team members managing your assets or galleries;- When new leads are saved and other marketing notifications."},
{"category": "Analytics", "ranking": "227", "app_name": "nlsql bot", "supported_languages": [], "pricing": null, "app_description": "Hey! :)  I'm here to assist you with USA export/import statistics. Try asking me a question like:Show me graph import of vegetables from Mexico?I need graph for crude oil export to UK?What is top country in crude oil export from USA?Show me graph USA computers export?What is USA computers export is 2017?Current Slack bot subscription including export-import statistics is free of charge. In case you want to get customized NLSQL Bot as per your own needs based on your own database, it would include paid subscription of 99$ per month"},
{"category": "Analytics", "ranking": "225", "app_name": "Leadinfo", "supported_languages": ["Dutch"], "pricing": "Paid with free trial", "app_description": "Leadinfo enables you to see real-time which companies are visiting your website and what pages they're viewing.You can install Leadinfo to Slack with our Slack App. By installing this app you can easily share recognized companies with your team from our portal!Log in into Leadinfo to install this Slack App. Once you are logged in, you will see an 'Add to Slack' button to install the Slack App.You need a Leadinfo account to use this App. You can request a free 14-day trial on our website."},
{"category": "Analytics", "ranking": "222", "app_name": "Agent", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Foqal Agent helps speed up your team's Slack support workflow by centralizing all of your Slack customer conversations into a single queue while giving you reports and metrics to know how your customers and team are doing. Our customers are ecstatic to have a pulse on the team's workflow and love having a queue to centralize and prioritize all of the requests."},
{"category": "Analytics", "ranking": "221", "app_name": "SurveySensum", "supported_languages": ["English"], "pricing": "Free", "app_description": "Slack and SurveySensum IntegrationSurveySensum can seamlessly integrate with your Slack workspace. So efficiently, that as soon as there is negative feedback by the respondent, the Slack users/ channels are instantly notified about it (with the respondent’s feedback and their information) so that they can take the required action and close the loop.Moreover, it encourages a rewarding environment by sharing positive feedback directly with the employees.This integration helps you• Get instant notifications inside your preferred Slack channel or users when respondents submit a survey.• Alerts on every detractor with their responses and other information.• Track those detractors on SurveySensum dashboards and create automated reports.• Share notifications with multiple teams such as CX, support, customer success, product, or tech.So what is SurveySensum?SurveySensum is an end-to-end feedback management system. It helps you • Launch NPS, CES, and CSAT surveys, • Gather your customers’ feedback, • Analyze their responses, and • Help take action on it to close the loop.How does it help you?Our team helps you take your feedback process from measurement to ACTIONABILITY - How?• We can help you with when to launch which surveys, what questions to ask, what to do with the feedback and • How to analyze results and prioritize actions to drive your business and CX goals."},
{"category": "Analytics", "ranking": "220", "app_name": "OpenText™ Axcelerate™", "supported_languages": ["English"], "pricing": "Paid", "app_description": "OpenText™ Axcelerate™ is a flexible and powerful end-to-end eDiscovery and investigations platform built around proprietary advanced analytics, machine learning and automation. Axcelerate delivers best-in-class investigative capabilities in a fully integrated, intuitive review interface that helps legal teams get to the facts that matter sooner and inform case strategy."},
{"category": "Analytics", "ranking": "219", "app_name": "Troops", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Troops was acquired by Salesforce on July 15, 2022.   Going forward, Troops is no longer available to new customers.  Stay tuned for exciting updates about how you will be able to leverage the Power of Troops to connect your Go To Market applications with Slack.Troops is the easiest way to use Salesforce directly from Slack and centralize key sales workflows.Key features:Search + Edit Salesforce: Update any Salesforce record without ever leaving Slack, including both standard and custom objects.Sales Gong + Opportunity Alerts: Celebrate with your team when they close a deal, create an opportunity, or hit key sales milestones — completely customizable with filters and specific deal information.Salesforce Reports in Slack: Schedule or pull any of your existing Salesforce reports across channels or DMs."},
{"category": "Analytics", "ranking": "218", "app_name": "Sprig", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Sprig is a tool for discovering actionable items to improve your site or applications. The Sprig Slack app is a tool for posting those actionable items directly in your company Slack channels. If you or your company subscribes to a Sprig plan or is using a free trial, you'll receive updates for launched and completed surveys, new responses, and additional events as we discover what you need to see!"},
{"category": "Analytics", "ranking": "217", "app_name": "Ovvy", "supported_languages": ["English"], "pricing": "Free", "app_description": "Ovvy means more control for teams over their on-call schedules. You’re already in Slack, so minimize context switching by quickly checking your PagerDuty on-call schedules, finding out who is currently on-call for services, and creating overrides all within Slack.Life happens: overrides are essential for planning holidays, sickness, time off, appointments, emergencies, and crunch times. In addition to creating and managing overrides directly in Slack, Ovvy tackles the common pain point around finding someone for an override. Easily ask if team members can grab a shift by launching a poll, and when someone accepts the shift Ovvy automatically creates the override.Here’s what you can do:• Check your on-call schedule• See who is on a rotation and who is currently on-call• Assign an override in Slack• View escalation policy details• Quickly poll team members for who will cover a shift• Get reminders for upcoming overridesOvvy unlocks the power of PagerDuty and Slack to reduce toil and save time, allowing you and your team to focus on what matters."},
{"category": "Analytics", "ranking": "216", "app_name": "Geckoboard", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Sharing a Geckoboard dashboard on Slack is the easiest way to ensure key metrics are front of mind, keep your team on track, and save everyone the hassle of accessing data. With our simple software, you can compile data from all your favourite tools, transform it into digestible dashboards - without coding - and schedule daily snapshots to post to Slack. No more time wasted by generating reports. No more digging into endless tools. Instead, get a daily snapshot of key metrics, where the conversation is happening. • Maintain focus and momentum, especially during times of change• Spark conversations about metrics and goals - directly in Slack• React and adapt faster to developments and trends• Have confidence that your team is seeing the numbers that matterPopular use cases• Sharing key metrics from across different departments• Tracking growth goals• Monitoring marketing campaigns• Maintaining excellent customer service• Monitoring usage of specific features• Seeing progress towards weekly or monthly sales targets• Seeing growth in social media following• Keeping track of hiring goals• And more...Other ways to shareGeckoboard isn’t just for Slack. It can help you communicate your data in several different ways, with link sharing, a mobile app, and TV mode. Find out how else Geckoboard can help you put your metrics front and center here."},
{"category": "Analytics", "ranking": "246", "app_name": "Xplenty", "supported_languages": [], "pricing": null, "app_description": "Xplenty is a data integration cloud platform that enables the integration and processing of data from a variety of data stores and SaaS applications. You can use Xplenty to connect to more than 100 data stores and SaaS applications including relational databases, NoSQL data stores, File stores and SaaS applications.Our Slack integration enables users to receive real-time updates about their account activity into their team inbox."},
{"category": "Analytics", "ranking": "245", "app_name": "Raygun", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Detect, diagnose, and resolve issues quickly to deliver flawless digital experiences for your customers with Raygun. Once integrated with Slack, you’ll receive highly-customizable error, crash, and performance alerts directly to the channel of your choosing. Reduce your MTTR and resolve issues in your code before your customers even notice. Build a world-class issue resolution workflow that combines the powerful diagnostics surfaced in Raygun with the convenience of designated Slack channels. Use Raygun for Slack to::zap: Quickly resolve errors and performance regressions :busts_in_silhouette: Keep the whole team looped in about new issues:mag_right: Create custom alerts tailored to your needs:female-technologist: Get set up in minutes with our lightweight SDKNot a Raygun customer? No problem – take a free 14-day trial to get started today. Read the Raygun for Slack documentation for more information."},
{"category": "Analytics", "ranking": "244", "app_name": "Mobile Action", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Notification Slack app for Mobile Action and Searchads.com. You can integrate your Slack workspace on your dashboard within Custom Alerts page of Mobile Action. You'll get notifications of your alerts depending on your criteria. Also on Searchads.com you'll be notified by your rule settings. Only paid customers can use this app without restriction."},
{"category": "Analytics", "ranking": "243", "app_name": "Optimizely", "supported_languages": [], "pricing": null, "app_description": "Optimizely is the world’s leading experimentation platform.  With this new integration, Optimizely for Slack, you can seamlessly track the status and collaborate on experiments and ideas in Slack.  Individuals and teams using Optimizely’s Program Management will be able to see what is happening in Optimizely, in near-real time. Slack notifications will appear when new ideas are created, someone comments on an idea, an experiments changes status, and more. Easily subscribe to receive updates on new experiments and see experiment results as soon as they are available. This Optimizely for Slack integration will easily allow you to engage with experiments so that you know exactly what is going on and what the rest of your team members are up to.  Spend less time switching between applications and more time experimenting with the Optimizely for Slack integration!The Optimizely for Slack integration is available on plans that include Program Management. Please see our pricing page for more information. https://www.optimizely.com/plans/"},
{"category": "Analytics", "ranking": "242", "app_name": "Crypto", "supported_languages": ["Chinese", "English", "French"], "pricing": "Free", "app_description": "@Crypto is a Slack app for crypto investors that provides price, token stats and ohlcv by using the Amberdata.io API.Instead of going to websites to lookup crypto prices, now you can be informed directly within Slack, sharing prices and trading information directly within your conversation.Supported commands:@Crypto help - Get a list of all supported commands@Crypto ticker - Get a list of all supported ticker names@Crypto ticker eth_usdt - Get information for a specific ticker@Crypto token - Get a list of all supported token names@Crypto token mkr - Get information for a specific token@Crypto ohlcv - Get a list of all supported ohlcv pairs@Crypto ohlcv eth_usdt - Get information for a specific pair"},
{"category": "Analytics", "ranking": "241", "app_name": "Nailted", "supported_languages": ["English", "Spanish"], "pricing": "Free and paid plans available", "app_description": "Nailted is the employee engagement platform for modern People & HR teams who deliver the best employee experience.Nailted guides you, and your entire organization, to apply best practices on employee engagement towards the creation of a culture that everyone wants to belong to.:chart_with_upwards_trend: Understand your people better with real-time people analytics, start with eNPS and more than 40 KPIs. Use our light built-in survey questions or if you prefer you could customize yours.:woman-raising-hand::skin-tone-2: Involve your managers easily giving them specifically designed tools to help them on a daily basis like 1:1 meetings. Get everyone of your managers to adopt this habit and prevent an inconsistent culture.:clap: Motivate your people and develop friendship building up a positive feedback culture, encourage fellowship, and create good vibes among the team.Try Nailted for free and connect to Slack or contact our team at info@nailted.comNailted, a way of doing things :heart:"},
{"category": "Analytics", "ranking": "215", "app_name": "Media Ratings Terminal", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Building a high quality, low fraud platform across inventory sources is challenging. Media Ratings Terminal is the only complete dashboard for finding ideal supply at scale. Our software gives you the exclusive app and site insights needed to craft an ideal, scaled platform that meets your individual marketing standards.With Media Ratings Terminal for Slack, you can retrieve important metrics and manage your watch list for apps and domains, all within Slack.- Use slash commands to retrieve metrics about apps and domains- View watchlist information on the Media Ratings Terminal Home tab."},
{"category": "Analytics", "ranking": "214", "app_name": "SuiteOp", "supported_languages": ["English"], "pricing": "Included with service subscription", "app_description": "Take your property management workflow to the next level with SuiteOp's robust integration for Slack. Our integration for Slack is designed to streamline your operations, improve team collaboration and enhance your guest communication. Here's what you can expect:1. Real-Time Notifications: Instantaneously receive updates on bookings, inquiries, and maintenance requests in your Slack channels. No more sifting through countless emails or disparate notifications - you'll be able to take prompt action and provide exceptional service right from your Slack workspace.2. Streamlined Team Communication: By keeping all your property management conversations organized in dedicated Slack channels, SuiteOp's integration helps facilitate seamless collaboration between team members. Whether it's addressing guest inquiries or coordinating with service providers, every piece of communication is kept in a centralized, accessible location.3. (Coming Soon) Efficient Task Management: With our integration for Slack, task management becomes a breeze. Create, assign, and track tasks within Slack itself, allowing you to hold team members accountable and ensure no task gets overlooked. It's an efficient way to stay on top of your property management duties.4. (Coming Soon) Enhanced Guest Communication: Deliver superior guest service by interacting with guests directly through Slack. You can address their queries, requests, or concerns in real-time, ensuring that their needs are promptly met. The integration with SuiteOp lets you elevate your guest experience by offering personalized and swift service.Experience an elevated level of convenience, productivity, and efficiency by integrating SuiteOp with your Slack workspace today."},
{"category": "Analytics", "ranking": "270", "app_name": "Corrello Trello Agile", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Corrello gives you burndown charts, cumulative flow diagrams and more for agile teams using Trello. You need to have a Corrello account to use this Slack App, there is a 14 day trial if you want to give it a go for free over at http://getcorrello.com.The Corrello app lets you view your charts from Corrello right in your Slack channels as well as stats on things like how many cards have been completed recently and counts of open bugs etc.You can configure Corrello to auto post Burndown charts directory into your Slack channels at the same time each day. Three commands will also be added to your slack channels:- /burndown displays a burndown chart from Corrello for one or more of your Trello boards- /cfd displays a cumulative flow diagram from Corrello for one or more of your Trello boards- /stats lists all the stats you have configured for your Trello boards in Corrello. This can include counts of cards completed (or points completed if you are using story points in Trello) and counts of open bugs etc."},
{"category": "Analytics", "ranking": "269", "app_name": "Dubb - Video Sharing & Reporting", "supported_languages": ["English"], "pricing": "Free", "app_description": "With the Dubb Slack App, you receive real-time Slack notifications of email opens, page views and video views for videos made on the Dubb Platform.Break communication barriers, build trust, and streamline your communication by embedding trackable screen, webcam and mobile videos directly into Gmail, Outlook, Apple Mail, LinkedIn, Instagram, Twitter, SMS and more.Dubb is a video communication suite that includes a Slack App, Chrome Extension, mobile app and website where you can manage a portfolio of personalized videos to share with your network.  Here are some of the benefits of using Dubb:- Increase engagement rates of your emails by over 100%- Decrease the amount of time it takes to write emails by using video instead- Make sales pitches, tutorials, explanations, demos, lesson plans and more easy-to-understand with screen recordings- Get new business contacts to get to know and trust you by seeing personalized videos recorded on your phone or webcamThere are limit uses cases for Dubb. Here are some of the different types of professions that use Dubb:- Sales & Marketing- Support- Real Estate- Education- Technology- Design- Finance & Business- Government & Non-Profit - Health- Legal- Training- ScienceTo get started download the Dubb Chrome Extension, install the mobile app and signup on dubb.com.Dubb - Video Yourself.™"},
{"category": "Analytics", "ranking": "268", "app_name": "MotionBoard", "supported_languages": [], "pricing": null, "app_description": "MotionBoardは、様々なデータを「よりリアルに」「より分かりやすく」「より美しく」ビジュアライズするBIダッシュボードサービスです。意思決定や行動の変化を促す情報をスピーディーに届けることができます。IoT（Internet of Things）データのリアルタイム可視化や地図データの標準搭載により、多彩な表現を提供できます。Slackと連携すると、MotionBoardの分析結果に基づくアラート情報をグラフ画像等の表現でSlackに自動でリアルタイムに通知できるので、状況把握がよりスピーディーになり、素早いアクションにつなげることができます。ご利用いただくにはMotionBoardのサービス契約（有償）が必要です。"},
{"category": "Analytics", "ranking": "267", "app_name": "ChatComply", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "ChatComply uses the latest natural language processing (NLP) to identify the use of PII entities across the organisation and instantly alerts Admins of any detections, and proposes redactions for end-users.ChatComply will analyse every message, analysing the text and using image recognition to extract text from any png or jpeg images sent with messages. When a PII entity is detected, it will add an emoji reaction based on the risk category and respond in a threaded message to the original message with the PII entities detected and a redaction proposal. ChatComply will notify a private channel called #chatcomply_alerts created during setup with details of the PII detection. Only Slack Admins will have access to the ChatComply dashboard and can:- View a summary of PII entity detections sliced by workspace, users, channels & user groups- Configure which PII entities to detect- Configure the risk categories for each PII entity (Low, Medium, High)"},
{"category": "Analytics", "ranking": "266", "app_name": "Review Flowz", "supported_languages": ["English", "French"], "pricing": "Paid with free trial", "app_description": "Reviewflowz is a review monitoring bot for Slack. It pulls your customer reviews from any review listing you have online and brings them into Slack. Get customer feedback from any review platform or from the App Store & Play Store straight into your favourite Slack channel. Celebrate successes, and swarm to fix issues.Enable star-rating or keyword filters to get only the most relevant reviews and not flood your #reviews channel.Use our daily or weekly recaps straight in your Slack workspace for a bird's eye view on your customer satisfaction.There's no catch, our Lite plan starts at $10 / mo and includes all review monitoring features, and allows to track a single listing.If you need access to more features around review management (widgets, review generation, API access, ...), you'll need a premium plan (starting at $50 / mo).You can try it free for 14 days, no credit card required.Supported platformsWe support the biggest review platforms on the market, including Google Maps, Trustpilot, Yelp, Amazon, Tripadvisor, etc. We support all the App Stores (iTunes, MacOS store, App Store, Play Store, and Microsoft Store).We also boast support for specific B2B review platforms such as G2, Capterra, GetApp, Gartner Peer Insights, Software Advice, Trustradius, Product Hunt, SourceForge, etc.And we support most B2B marketplaces such as Wordpress, Shopify, Hubspot, the Salesforce AppExchange, and browser extension marketplaces such as Chrome & EdgeSet up your own NPS surveys and bring your customers' voice in SlackYou can now create your own surveys on Reviewflowz to ask feedback to your users and customers. You can choose to keep this feedback private, in which case we'll send it straight to your favourite Slack channel – or to make it public, in which case we'll send your customers to the review platform of your choice Get more feedback, feed your workspace with your customers' voice, and optimize your rankings on the platforms that matter most to your business.PricingYou can try reviewflowz on a 14 days free trial. No credit card requiredOur lightest plan starts at $10 / month to track one listing (in all languages and all regions), and our premium plan which comes with widgets, reviewer details, CSV exports, API access, Webhook & Zapier notifications, and more starts at just $50 / month with up to 10 listings.Hot features + Get every new review in Slack and bring the voice of the customer in your workspace+ Track your app's average rating over time+ Track your competitors' reviews & ratings+ Get notified when your position changes on key category pages+ Break down your average rating by keyword+ Get daily and weekly updates on your review generation performance+ Get more reviews on the right platforms with our review generation campaigns and review balancing features (premium)+ Build a dynamic review widget to share on your website+ Access our API to get even more value from your reviews"},
{"category": "Analytics", "ranking": "265", "app_name": "Zylo", "supported_languages": ["English"], "pricing": "Paid", "app_description": "With the Zylo + Slack integration you can unlock the ability to directly survey users of cloud applications across your business right where they spend their time, in Slack. Using Zylo’s Net-Promoter Score based tools for capturing user feedback and Slack’s Message Menus, IT and Procurement teams can target users of applications with a quick direct message in Slack requesting their feedback. The results are available back in Zylo side-by-side with your application spend and usage data that is used for strategic purchasing and renewal decisions.In order to take advantage of this integration, you must be a Zylo customer. Learn more at www.zylo.com."},
{"category": "Analytics", "ranking": "264", "app_name": "IOpipe", "supported_languages": [], "pricing": null, "app_description": "IOpipe helps you monitor your serverless architecture. Use the Slack IOpipe app to configure Slack-specific alerts. Adding the integration is easy when setting up your alert hooks. Just click the \"Connect to Slack\" button. Feedback appreciated!"},
{"category": "Analytics", "ranking": "256", "app_name": "Voice Metrics", "supported_languages": [], "pricing": null, "app_description": "Voice Metrics allows you to HEAR your Slack messages directly from your voice assistant (Alexa, etc.).  With a simple one-time setup, you create your own customized \"Slack Voice Briefing\" that Alexa will respond with when you say \"Alexa, Voice Metrics!\".  Use it for yourself, or set up your entire team with Daily Briefings and Status Updates to keep everyone on the same page.  Additionally, if you have Slack bots push data and metrics into your Board, simply subscribe to those channels within Voice Metrics and JUST ASK for your data!  Try it now at app.voicemetrics.io"},
{"category": "Analytics", "ranking": "263", "app_name": "TheTool: ASO Report", "supported_languages": [], "pricing": null, "app_description": "App Store Optimization made simple and beautiful!With TheTool: ASO Report, receive daily updates of the metrics that matter to your ASO strategy.:chart_with_upwards_trend: Keyword rankings:top: Top Charts rankings:star: User Ratings :rocket: More ASO metrics coming soon!TheTool helps app developers and marketers stay up to date. All the most important metrics for ASO delivered every day!Slack + TheTool integration is available for all Startup, Growth and Ninja plan users.What is ASO?App Store Optimization (ASO) is the process of optimizing an app in order to maximize its visibility in the app stores, improve the conversion rate to install, and increase the volume of downloads.What is TheTool?TheTool is an all-in-one ASO and App Marketing platform that helps developers and marketers to track and optimize their ASO strategy in 91 countries or globally, carry out keyword research, benchmark app marketing KPIs with competitors, understand the impact of marketing actions on installs, conversion rate and revenue; and, ultimately, grow the downloads of their apps and games.TheTool has been developed by SEO & ASO + & Digital Growth consultants with more than 10 years of experience. We know how to grow and we love App Store Optimization! :heart:Contact us: info@thetool.io"},
{"category": "Analytics", "ranking": "262", "app_name": "NorthStar", "supported_languages": [], "pricing": null, "app_description": "Engage your entire company to help deliver growth results.No individual growth hacker or even a growth team can outperform a company where everyone is mobilized to accelerate growth. However, in most companies, the broader team has very little impact on growth. NorthStar will help you keep your broader team engaged to help drive breakout growth.Focus your team on the best opportunities for growth.Growth teams face frustrations when they try to test around high impact opportunities such as new customer onboarding. Product teams generally prefer to focus all resources on the long term roadmap and bug fighting. NorthStar will give your broader team the context to stay aligned around driving improvement across the full customer journey.Increase your team's learning velocity.Today's fastest growing companies have all driven breakout growth by mobilizing their entire teams around growth. They are constantly discovering new and better ways to accelerate growth. But building these learning habits is hard. NorthStar will help your entire company embrace the approach that has driven breakout growth at Airbnb, Dropbox and Facebook.NorthStar integrates with a full suite of industry leading a/b testing, analytics and project management solutions and we continue to add new integrations regularly.With NorthStar Slack App you will be able to:• Receive team notifications for important events like new Cards created, new Objectives created, Cards added to Objectives, Cards progress through the Workflow, etc.• Receive direct messages for new mentions or assignment in NorthStar.• Create ideas directly from Slack using a slash commands (ie: /idea [Name]) - Coming Soon• Interact with the NorthStar bot for a lot of useful new features. - Coming SoonWe'll keep adding useful features in the future and will make sure our bot keeps you informed when they are released."},
{"category": "Analytics", "ranking": "261", "app_name": "Reporty", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Looking for a better Shopify and Slack app? Download the free Reporty app! Over 1.5 million notifications delivered!Reporty (formerly, Shoppy) connects your Shopify store with Slack so you can receive important order notifications and summaries sent straight to Slack, reducing the amount of time you spend pulling order data and giving you more time to focus on growing your store.Why Reporty?We made Reporty because we wanted to receive Slack updates for new orders, but wanted these Slack updates to include discount codes used, tags, and Google Analytics/UTM associated with our orders. We tried every app that integrates Shopify with Slack, but we couldn't find anything that includes these valuable pieces of data.So we built it ourselves.Get critical order information automatically sent to your Slack channel- Note: A Shopify store is required to use this app- We've streamlined our install process so setup now takes less than 30 seconds. Install the app, click the Add to Slack button, and you're done!- Get automatic notifications sent to Slack for the following order events: new orders, cancelled orders, paid orders, partially fulfilled orders, and fulfilled orders.- Choose what notifications you want sent to Slack. Only get the order events you care about sent to Slack.- New order notifications include order ID, customer's name and email, delivery location, cart total, discount code used (if any), tags (if any), UTM tracking (if any), and a link to access the order in Shopify.- Cancelled order notifications include order ID, customer's name and email, delivery location, refunded amount, and a link to access the order in Shopify.- Order paid notifications include order ID, customer's name and email, delivery location, cart total, and a link to access the order in Shopify.- Partially fullfiled order notifications include order ID, customer's name and email, delivery location, cart total, and a link to access the order in Shopify.- Fulfilled order notifications include order ID, customer's name and email, delivery location, cart total, and a link to access the order in Shopify."},
{"category": "Analytics", "ranking": "260", "app_name": "Netumo", "supported_languages": ["English"], "pricing": "Free", "app_description": "Netumo is a domain and website monitor to manage all your domains and websites from one location. Track uptime and make sure you know instantly once a website or device is down. Also, track HTTPS Certificates and Domain name expiry all from one place."},
{"category": "Analytics", "ranking": "259", "app_name": "SubOps", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Subscription software is great.Paying for inactive users isn't. With SubOps for Slack, you get an accurate accounting of all your subscription software usage sent to you every week. Automatically.Connecting your mission critical software services to SubOps takes just a few seconds via a one-time secure OAuth process. After this initial setup, you'll immediately see a report of your usage and alerts about inactive subscribers. It couldn't be easier to save time and money. :money_with_wings: Save money on inactive user subscriptions:stopwatch: Save time reviewing subscription usage data:mailbox_with_mail: Get an updated subscription report in your #subops-reports channel every Monday:eyes: See your latest report anytime by typing /sub:rotating_light: Get an automatic Slack alert when any subscriber hits 15-days inactive"},
{"category": "Analytics", "ranking": "258", "app_name": "Zonka Feedback", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Zonka Feedback is an Employee and Customer Experience Management Software that equips companies with a robust tool to set up custom surveys and feedback forms, distribute them at various touchpoints, view real-time survey responses, get in-depth one-touch reports and take action to close the feedback loop. With the Zonka Feedback and Slack integrations, you can do a lot. * Send your team surveys directly in Slack :speech_balloon: You can choose which surveys to distribute to Slack Channels and Slack Users. They receive a custom message with the survey link that they can open in their web or mobile browser to fill out the survey. This is very helpful when you wish to send Surveys to your Teams in Slack or send Surveys to specific individuals.* Get Survey Response Notifications on Slack :bellhop_bell: Receiving a real-time notification for all new Survey Responses is extremely handy as it eliminates your need to check new Survey Responses on Zonka Feedback platform or via Email.* Receive Custom Response Alerts on Slack :memo: The Custom Alerts are very useful when you want to keep your team notified of responses based on certain conditions. It is also very handy when you want different teams and Users to be notified on different conditions of the Survey Response. "},
{"category": "Analytics", "ranking": "257", "app_name": "Nimbata", "supported_languages": ["English"], "pricing": "Included with service subscription", "app_description": "Nimbata is a call tracking platform that lets you attribute phone calls back to keyword searches, web pages, social media, digital ads or offline campaigns. This app for Slack will allow you to receive phone event and call attribution details directly into Slack."},
{"category": "Analytics", "ranking": "252", "app_name": "Cision App", "supported_languages": ["English"], "pricing": "Paid", "app_description": "Internal communications and promoting your hard-fought earned media wins isn’t always easy. Now, Cision can help you cut through that noise by giving you the power to share articles with your team in Slack, right from Cision.We're making the game of departmental self-promotion just a little bit easier for you!----This Slack App requires a paid Cision account.  After installation, you'll be able to: * share article analysis to Slack directly from Cision article details pages, and...* set up real-time alerts to share article analysis to a Slack channel based on a saved search.----Cision revolutionizes how the world's biggest brands and media companies measure the impact of their PR. Our advanced analytics and beautiful reporting measure real business impact and communicate success in a way that legacy solutions can’t."},
{"category": "Analytics", "ranking": "248", "app_name": "Anodot", "supported_languages": ["English"], "pricing": "Free", "app_description": "Anodot is a real-time analytics and automated anomaly detection system that discovers outliers in vast amounts of time series data and turns them into valuable business insights. Using patented machine learning algorithms, Anodot isolates issues and correlates them across multiple parameters in real-time, eliminating business insight latency, and supporting rapid business decisions through its uncovered insights. With its scalable SaaS platform, Anodot provides typically siloed teams – BI, R&D and Devops – with a single, unified system for both business and IT metrics.With Anodot’s integration with Slack you can:Get business critical alerts directly to your Slack channelsYou can easily designate Anodot alerts to be sent to a specific Slack channel. See here how to assign an alert to a channel. Following the initial installation of the Anodot Slack app in your Slack workspace, adding Anodot to a Slack channel is as simple as calling ‘/invite @Anodot’ to your channel.Collaborate with your peers around specific alertsOnce you get an alert, you can easily continue chatting about it in Slack as part of a dedicated thread or in the channel itself. In the future - comments made in the context of a specific alert in Slack will be stored as part of the alert’s timeline. Acknowledge, feedback and launch RCA investigation directly from SlackEvery alert notification comes with a set of “Actions” you can perform on it. Here are some of the actions you can perform::white_check_mark:  Acknowledge - Acknowledge an alert to let everyone on the team know that you’ve seen it. :speech_balloon:  Feedback (Good Catch / Not Interesting) - Giving feedback to an alert is super important as it enables Anodot and you to constantly improve the detection rate of the alert. :female-detective:  Investigate - Deep dive into the alert trigger you got to better understand what happened, where did it happen and perhaps even ‘why’. :control_knobs:  Dashboard - For alerts which were defined based on a dashboard, you are able to quickly navigate to the original dashboard and get the context of your alert:safety_vest:  Custom Actions - (Coming Soon) - Launch your own external links - Grafana, Kibana, Jira, Rundeck, etc."},
{"category": "Analytics", "ranking": "250", "app_name": "Aware", "supported_languages": ["English"], "pricing": "Paid", "app_description": "The single platform for Slack conversation and file governance, compliance & behavior insights.Governance, Risk and Compliance- AI-enriched, immutable archive, specifically built for collaboration conversations and files- Contextual eDiscovery and forensics- Handle GDPR/CCPA Data Subject Access Request and Right to Erasure obligations- Dynamic Chat/File retention and information governance — remove from the archive and from the data-in-place on Slack- Contextual legal holds — preserve only the data you need- Reputation management and insider threat protection- Content monitoring and DLP (Tombstoning) — remove accidental or malicious sharing of PHI/PII/PCI and other confidential information- Policy-based enforcement of industry and company regulations, such as HIPAA, FINRA and others- Automatically enforce Acceptable Use policies for all populations, including regulated and BYOD employees- Toxic behavior monitoringChange Management, Insights and Analytics- Automated community management and Workspace analytics- Industry’s most accurate Sentiment Analysis for Workspaces, Channels, topics and messages- Detect changes in your organization’s psychosocial and cultural health- Continuously measure conversations for pockets of toxicity or undesired behavior- Understand topics or concerns that are top-of-mind for employees, such as corporate announcements or union activity- Derive data-driven stories to leadership and prove value of Slack"},
{"category": "Analytics", "ranking": "255", "app_name": "Gainsight Sally EU", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Sally makes rich Gainsight data easily accessible through simple conversation. Your teams will rally around your customers with real-time customer insight within their Slack channels. - Talk with Sally just like talking with a real person; her machine-learning technology enables her to recognise a wide-range of words and questions and helps her get smarter with each interaction- Quickly gain insight into your customers by asking diverse questions about your portfolio; ask for a summary of any customer including health score details, NPS survey responses and key sponsors.- Facilitate collaboration across all teams with easily accessible customer information and engage each team members to rally around the customer’s goals.To use Sally, you need a paid Gainsight instance that can be connected with your Slack team(s)."},
{"category": "Analytics", "ranking": "254", "app_name": "Appfigures - App Monitoring", "supported_languages": [], "pricing": null, "app_description": "Are you making mobile apps? You need a way to track your sales, reviews, ranks, and more, and if you're here you want it in Slack.Appfigures monitors all of your apps, and sends alerts right into the Slack channel of your choice. Some examples:* Notify your developers when a new review mentioning the keyword crash and has 1 or 2 stars* Notify your marketing team of new 5-star reviews* Get a daily summary of downloads and revenue (coming soon)* Get notified when your app's rank changes anywhere in the world (coming soon)* And many more!---Appfigures bring together app download, revenue, reviews, ranks, featured and usage analytics for mobile apps and games into one dashboard. We also have the most strict privacy policy around and don't share or sell any of your private data.Start your FREE trial →"},
{"category": "Analytics", "ranking": "251", "app_name": "Visitor Queue", "supported_languages": ["English"], "pricing": "Paid", "app_description": "Visitor Queue is an advanced B2B lead generation software that identifies the name, contact details and user data of the businesses that visit your website. We now integrate  with Slack to send lead notifications directly to your desired direct message or channel."},
{"category": "Analytics", "ranking": "249", "app_name": "Optimo Analytics", "supported_languages": ["English", "Spanish"], "pricing": "Paid with free trial", "app_description": "We help brands and agencies automate all their digital analytics easily and without any development required. Optimo Analytics is working towards automating analytics functionalities to decrease the need of technical teams.Withing out platform, you can connect your Google Analytics, Facebook Ads, and Instagram Business Accounts and schedule daily and weekly reports.Also, you'll have the ability to select the day/time, metrics, type of chart, among other settings to be delivered to your selected Slack Workspace and channel.This can be easily used by brands with a single account and Slack workspace, or by agencies with multiple accounts and multiple Slack workspaces."},
{"category": "Analytics", "ranking": "253", "app_name": "Officevibe", "supported_languages": ["English", "French"], "pricing": "Free and paid plans available", "app_description": "We’re on your vibe!Officevibe is the incredibly friendly people-first employee experience platform— the fresh, new way to engage, recognize, align, and enable world-class leaders and teams. Easy to use and super powerful, Officevibe is for having those essential conversations that make everything and everyone click, empowering leaders, and connecting teams like never before.Our incredibly easy-to-use integration with Slack gives teams a space to tell their managers anything. Then, it empowers managers to give their people the support they need. Plus, it gives HR important data, so they can step in to help managers when needed.Dissolve work blockers, discover strengths, and strengthen your manager-employee relationships. All without adding to your workload.How does Officevibe work?Your team members will receive a weekly Pulse Survey  through Slack. Then, you’ll be notified when the Survey Report is in, or when you get new feedback, so you can take the results back to your team and come up with a plan.Officevibe will notify you through Slack when it’s time to add talking points to your next 1-on-1 agenda. It’ll also share the wrap-up notes from last time. Planning 1-on-1s with Officevibe in Slack is quick, easy, and leads to genuinely productive conversations.Get started today for free."},
{"category": "Analytics", "ranking": "273", "app_name": "Hello API", "supported_languages": ["English"], "pricing": "Free", "app_description": "Connect to any API in Slack. Use me to make GET/POST and other queries to any API. Custom headers, API keys, POST body, etc can be passed just as you would using curl.Usage: /api [saved command]1. Create and save a query at https://helloapi.app/manage2. In Slack, run \"/api [saved command name]\""},
{"category": "Analytics", "ranking": "272", "app_name": "DataFetch", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Save time by searching all your major systems - Salesforce, Pardot, Adobe Marketo Engage, Hubspot, Eventbrite, Postgres, Amazon Redshift, Splash, etc. - simply use the '/datafetch' command.- Drive adoption by searching all systems from 1 slash command- Advanced filters allow you to find results quickly- Share results directly within conversations and channelsExisting connectors:- Salesforce: Campaigns, Leads, Contacts, Reports, and Opportunities- Pardot: Lists- Adobe Marketo: Programs and Leads- Hubspot: Contacts, Companies, and Deals- Eventbrite: Events- Splash: Events and Contacts- ON24: Events- Humanitix: Events- MailChimp: Campaigns and Members- Confluence- Google BigQuery- Amazon RedShift- PostgreSQL"},
{"category": "Analytics", "ranking": "247", "app_name": "Databox", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Databox for Slack helps to make sure your most important metrics are always at your fingertips. You and your team will be able to view your data in context, right where the conversation is already happening. View your daily scorecard or weekly summary, or see any of your alerts — right from your existing Slack channels.This integration will enable the Databox bot @databox.Read more about Databox at https://databox.com."},
{"category": "Analytics", "ranking": "213", "app_name": "Amplitude - EU", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": ":warning: This app for Slack is specifically for our customers utilizing our EU Data Center (https://amplitude.com/get-started-eu). If you log into Amplitude via https://analytics.eu.amplitude.com or https://app.eu.amplitude.com, this app is for you! If not, use the Amplitude App for Slack. :warning: Amplitude empowers everyone at your company to explore, analyze and discover the user insights that drive your business. Connect your Amplitude account with Slack to make sharing insights faster and easier.Features Currently Supported:- Paste links to Charts, Dashboards and Notebooks to automatically transform the link into a preview- Get notified when you receive comments or someone comments on your content- Receive Slack notifications when your team starts making new analyses- Automatically send Dashboards in PDF format to Slack channels by creating a recurring subscription"},
{"category": "Analytics", "ranking": "182", "app_name": "WebHR", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "WebHR is a Social All-in-One HR Software to manage the most important asset in a company - your Human Resource. WebHR offers services such as: Recruitment, Employees Self Service, Payroll, Time & Attendance, Training, Performance Evaluation, Employees Communication, and much more. The integration allows you to directly send commands to your WebHR account from Slack such as: Write Status Updates, Attendance Sign In / Out, Lunch In / Out, etc.To integrate Slack with WebHR, please follow these steps: 1. Please click on the four-square boxes at the top left corner and click on Integrations. 2. Under Integrations Page, with other integrations, Slack with also be available. Click on Slack > Slack Integration Page will open > Connect with Slack. 3. After connecting it will showcase the status as connected. You will also have the option to disconnect at any time. 4. Once WebHR is integrated with Slack, the connect Slack users’ option can be availed. Employees from WebHR can then be mapped with the Slack Users. After a successful integration with Slack, you can do one of the following: To get a list of all the possible commands:/webhr HelpTo write a Status Message on WebHR Dashboard /webhr StatusUpdate Your MessageTo mark your Attendance in Timesheet Module (Sign In) /webhr SignInTo mark your Attendance in Timesheet Module (Sign Out) /webhr SignOutTo mark your Attendance in Timesheet Module (Lunch Break Out) /webhr LunchOutTo mark your Attendance in Timesheet Module (Lunch Break In)/webhr LunchIn"},
{"category": "Analytics", "ranking": "212", "app_name": "ChatPulse", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "ChatPulse uses cutting-edge natural language processing (NLP) to identify trends in sentiment and emotions across your business and gain real insights into team communication. ChatPulse is unobtrusive and doesn't require repetitive and tedious employee surveys to measure team engagement and morale."},
{"category": "Analytics", "ranking": "211", "app_name": "Atatus", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Atatus is a better way to measure and improve app performances and user experience by capturing errors and performance metrics. This integration gives your team the ability to be notified in a Slack channel when any exception occurs, and when  an alert is triggered in Atatus. If you would like web, server, and mobile alerts to be posted in separate channels, you will need to set up separate integrations."},
{"category": "Analytics", "ranking": "271", "app_name": "teamplify", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Building software is not just about writing code. It's also about communication - setting goals, analyzing requirements, and providing timely updates. When everyone's remote by default, there are even more challenges. Stay on top of it with Teamplify. See activity from your Git repos, Jira, Trello, Slack, and Zoom, all in one place. Identify stuck progress, configure alerts, and manage time off.Connecting Slack to your Teamplify workspace lets you:- Analyze work activity in public team channels, including mentioned issues;- Receive all types of Teamplify notifications in Slack;- Manage time off for yourself, and allow organization admins to approve or reject time off requests for others;- Receive friendly reminders if you mention someone who's not available;- Use Slack as an authentication provider, so that your team can use their Slack accounts to log in to Teamplify."},
{"category": "Analytics", "ranking": "294", "app_name": "Jepto", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Bring your channels and teams together to track performance, automate tasks and generate insightsJepto is your digital marketing assistant that never sleeps that unifies your digital marketing data and helps you manage and automate your marketing.To use the App you need to have a Paid Jepto Account (Start with 14 Day free trial). Jepto Users are linked to your Slack account via email, so that you can take action on Insights and add comments directly within Slack."},
{"category": "Analytics", "ranking": "293", "app_name": "Aristotle", "supported_languages": [], "pricing": null, "app_description": "Chat with your data as you chat with your team. With Aristotle, get instant insights from multiple data sources directly into Slack. Save time compared to using reports, and never be more than 30 seconds away from a number, wherever you are. Aristotle supports the deskless worker in the field, the executive on the move, as well as partners and customers who need simple access to data without training.Contact us to connect Aristotle to your databases. We provide support to train Aristotle on your own data and learn from the questions users ask."},
{"category": "Analytics", "ranking": "292", "app_name": "Fairwinds Insights", "supported_languages": ["English"], "pricing": "Free", "app_description": "Fairwinds Insights is a Kubernetes configuration validation platform, integrating best-of-breed open source auditing tools that improve cluster security, workload reliability, and engineering productivity.You can link Fairwinds Insights to Slack in order to get alerts about new Action Items, get daily digests of changes to your Kubernetes clusters, and get alerted when one of your reports goes offline."},
{"category": "Analytics", "ranking": "296", "app_name": "Castle (legacy)", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Castle helps businesses manage risk and fraud with only a few lines of code. By monitoring every user interaction, from registration and login to page views, form posts, and transactions, Castle is able to highlight any anomalies and suspicious user behavior."},
{"category": "Analytics", "ranking": "291", "app_name": "Timinator", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": ":robot_face::robot_face::robot_face:Introducing Timinator - the all-in-one tool that lets you focus on CREATION while it handles time tracking for you! :mechanical_arm::mechanical_arm::mechanical_arm::black_circle_for_record:Time trackingWith Timinator, you can easily track your working hours, absence hours, and even overtime hours with just a few clicks. Our user-friendly interface allows for easy editing and the use of shortcuts to save you even more time.:control_knobs:Admin consoleOur powerful admin console lets you manage clients, projects, employees, roles, project types, shift types, and absence types with ease. Available on both Slack and the web.:dvd:Recurring shiftsAnd with our unique feature for recurring shifts, you can trust your employees and make everyone's lives easier by scheduling shifts to track only exceptions like sick days or vacations.:bell:Configurable remindersStay on top of your schedule with our configurable reminders - set the time that suits you best and we'll make sure to notify you accordingly.:bar_chart:ReportsWith our detailed reporting capabilities, you can easily generate reports by employee, project, day, week, month, and export them as files.:beach_with_umbrella:VacationsPlanning a vacation? Request and approve time off with ease, notify your team or everyone, and even generate reports to stay organized.:jigsaw:IntegrationsAnd with our Zoho invoice integration, you can streamline your billing process like never before.:spiral_calendar_pad:Working calendarsSay goodbye to manual holiday tracking, as we seamlessly integrate with various calendars to automatically keep tabs on public holidays. Customize the calendar to suit your specific needs. And if you have a distributed team, fear not, as you can effortlessly assign different calendars to each team member.:bangbang:Don't let time tracking consume your time and energy. Try Timinator now and see how easy, effortless, and unobtrusive it can be. :rainbow::rainbow::rainbow:"},
{"category": "Analytics", "ranking": "295", "app_name": "Alice", "supported_languages": [], "pricing": null, "app_description": "What can I do with Alice?With Alice and Logz.io, you can:• Get Kibana objects, snapshots, dashboards, visualizations, and saved searches• Run an Elasticsearch query• See your alert definitions• View triggered alertsAlice is available for paid Pro and Enterprise Logz.io accounts. See our pricing page for details or to sign up for a free trial.Find out more• Website: https://logz.io/• Read our blog: https://logz.io/blog/• Plans and pricing: https://logz.io/pricing/Logz.io offers hosted ELK as a Service—ensuring availability, security, and scalability. With the open source Elasticsearch, Logstash, and Kibana, you get a suite of powerful log analysis, alerting, and reporting features. Advanced machine learning reveals critical and unnoticed errors and exceptions in real time, enabling you to resolve issues faster."},
{"category": "Analytics", "ranking": "290", "app_name": "Arc Analytics", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Arc Analytics helps teams stay on top of Google Analytics. Let's face it, most people don't want to analyze raw numbers. Arc highlights your important data with easy-to-read messages, graphs, and smart comparison ranges. This keeps your team informed and helps everyone make better decisions."},
{"category": "Analytics", "ranking": "289", "app_name": "Invoiced", "supported_languages": ["English", "French", "German", "Spanish"], "pricing": "Paid with free trial", "app_description": "The Invoiced integration will send notifications of incoming sales (and a variety of other notification preferences) right into your Slack team's own Invoiced Channel. You can use these notifications to collaborate with your team in real time about billing activity without even leaving your chat room.Note: an invoiced.com account is required in order to use this integration."},
{"category": "Analytics", "ranking": "288", "app_name": "Holistics", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Holistics is a powerful BI platform that empowers analysts with SQL to build online dashboards and automated data processes that deliver data to everyone.You can get started in under 10 minutes. Holistics connects to your database, and does not store/sync a local copy of your source data.Holistics Slack app lets you schedule performance reports and alerts you automatically when there are changes in your data.Holistics pricing is extremely friendly for startups, which prices on a mix of both users and usageContact developers at support@holistics.io"},
{"category": "Analytics", "ranking": "287", "app_name": "KARTE", "supported_languages": ["Japanese"], "pricing": "Paid", "app_description": "KARTEの情報を、設定したチャンネルに通知することができます。- 主に次の通知を受け取ることができます  - KARTEからのお知らせ  - ターゲット配信の開始、終了、エラー  - Datahubのジョブ開始、終了、エラー  - Datahubの制限超過アラート※こちらのアプリを利用するためには、KARTEの契約が必要になります"},
{"category": "Analytics", "ranking": "286", "app_name": "GetSpeedBack", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "GetSpeedBack is a platform that makes performance reviews simple. It allows you to conduct automated reviews, continuously, without getting in the way. Spend less time reviewing and more time growing.By automating your review process, employees will get more feedback, faster. This means they'll grow quicker, be happier, and stay with you for the long-haul.Features:- Automatic review scheduling and management- Generate, send and sign performance evaluations- Simple, customizable reviews across teams- Performance trends for users and teams- Performance categories based on rolesGetSpeedBack can be fully utilized through Slack. Get started in 1 minute:- Create an account on https://getspeedback.com- Add to Slack"},
{"category": "Analytics", "ranking": "285", "app_name": "Logtail", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "logtail.com (part of betterstack.com) lets you query your logs the same way you query a database. Experience radically better SQL-compatible log management at an unbeatable price.With the Logtail + Slack integration you can:* Receive the fastest presence/absence alerts and quickly investigate any irregularities in your logs.It takes only 5 minutes to integrate.Structured Log ManagementStore logs in a structured form instead of a blob of text. You can do so much more with your logs than just a full-text search.Database Like Log QueryingQuery logs with the language your team already knows: SQL. No need to learn an obscure log querying language.Integrated Grafana DashboardsBuild dashboards with Grafana. Number of user sessions over time? Average response time? You can chart it with a few clicks.Configure presence/absence alertsConfigure custom Slack alerts based on the contents of your logs.Collaborate with colleaguesArchive important log fragments, add comments, and easily share links with your team.Unbeatable priceWe use a custom-built data pipeline for storing and processing your logs instead of relying on the Elastic/ELK stack as most logging services do. We pass the cost savings to you.SupportFAQ: https://logtail.com/supportEmail: hello@logtail.com"},
{"category": "Analytics", "ranking": "284", "app_name": "Knowi", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Data-driven insights should be for everyone, not just those fluent in SQL. Enter Knowi. Knowi is a unified analytics platform that allows you to ask questions of your data using natural language queries and share the results with your team.Our Slack integration brings this feature right to your Slack channels, allowing you to type “/Knowi” and type out questions like:* What was our average sale value last quarter?* What orders are on hold?* Show me the sum of order totals by product lineThis integration will allow you to: - Set up intelligent alert rules to monitor your KPIs and receive alerts directly in Slack. - Use /knowi to ask questions from your Knowi data and receive insights with visualization in Slack  - Automate your recurring reports to keep your whole team focused on the same metrics and goals"},
{"category": "Analytics", "ranking": "283", "app_name": "Statusbrew", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Statusbrew is a Unified Social Media Management Solution for Teams and Agencies all sizes to collaborate and work together in a unified platform for all of their Social Media Campaigns and Brand Monitoring.Slack for Statusbrew integration helps:- Keep your Team updated about Content Planning and reduces the time to approve post by instantly notifying the respective team member- Helps reduce the time to reply by notifying your Customer Support team about latest conversations in Social Media- Jump on Important Conversations about your Brand with our Realtime sync- Instantaneous notification to Admins to re-authenticate Social Profiles to prevent your campaign posts from being failed to be posted- Sends a Daily report about your Brand Activity on Social- Available for Statusbrew Business Plan Users OnlySlack for Statusbrew helps us power-up your team to help them scale their marketing efforts and cut short the time spent on communication."},
{"category": "Analytics", "ranking": "282", "app_name": "New Relic", "supported_languages": ["English"], "pricing": "Free", "app_description": "New Relic's cloud-based platform gives developers, engineers, operations, and management a clear view of what's happening in today's complex software environments. So you can find and fix problems faster, build high-performing DevOps teams, and deliver delightful experiences for your customers.This integration will allow you to receive updates via Slack based on your New Relic setup.For support please contact:https://support.newrelic.com/"},
{"category": "Analytics", "ranking": "281", "app_name": "CronDrive", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "Do you know if your cron jobs are taking too long?You can monitor your cron jobsKeep a track of each execution of your cron jobs and receive alerts on your Slack channel if your Cron jobs do not start or end in the expected time."},
{"category": "Analytics", "ranking": "279", "app_name": "Ascendo", "supported_languages": ["English"], "pricing": "Included with service subscription", "app_description": "Ascendo.ai application for Slack provides customers the ability to deliver customer support using native Slack conversation mode.  Ascendo.ai provides AI-based solution recommendations for support agents.  Agents can use those recommendations to provide answers to customer questions.  Agents can also mark incoming conversations to tag them as an issue.  When a conversation is tagged as an issue, Ascendo automatically provides predicted solutions as a private message to the agent.  An agent can also transition the issue from “open” to “In Progress” and then when the issue is solved fully, can mark the issue as “Solved”.  This allows Ascendo to capture various support delivery metrics such as the first time to respond, the average time to respond, and total response time.  Ascendo also provides the ability for an agent to tag any response as a new know-how object, which basically becomes a new knowledge object within Ascendo for its future use to provide predictions.  The agent can also provide active feedback to prediction results and such feedback is used by Ascendo to improve its prediction algorithm."},
{"category": "Analytics", "ranking": "278", "app_name": "Amplitude", "supported_languages": ["English"], "pricing": "Free", "app_description": "Amplitude empowers everyone at your company to explore, analyze and discover the user insights that drive your business.Connect your Amplitude account with Slack to make sharing insights faster and easier.Features Currently Supported:- Paste links to Charts, Dashboards and Notebooks to automatically transform the link into a preview (now supports https://app.amplitude.com domain)- Get notified when you receive comments or someone comments on your content- Receive Slack notifications when your team starts making new analyses- Automatically send Dashboards in PDF format to Slack channels by creating a recurring subscription"},
{"category": "Analytics", "ranking": "276", "app_name": "Brand24", "supported_languages": ["English"], "pricing": "Paid with free trial", "app_description": "Get access to online mentions about your brand or product directly from Slack so that you don’t miss anything. Hook up your project to Slack to make teamwork easier and more effective - discuss mentions, make group decisions and assign tasks. We’ve got you covered!"},
{"category": "Analytics", "ranking": "280", "app_name": "Glean", "supported_languages": ["English"], "pricing": "Included with service subscription", "app_description": "Glean is a business intelligence tool that allows you to quickly standardize metrics and start finding insights in your data.  Glean empowers you to build a collaborative data culture - everyone on your team is able to explore standard metrics.With this app, users in your Glean project can:• Share saved views and dashboards directly to Slack channels with added notes and context• Schedule automated reports and alerts to keep your team up to date"},
{"category": "Analytics", "ranking": "277", "app_name": "SteelEye - Supervision & Archiving", "supported_languages": ["English"], "pricing": "Included with service subscription", "app_description": "SteelEye enables firms to archive and monitor Slack data for compliance. As a result, firms can allow collaboration via Slack while ensuring that all applicable record keeping and surveillance rules are met. Slack content is captured directly from the source in its original format.SteelEye's integrated trade and communications surveillance platform enables financial firms to master risk detection and alert resolution - so they don’t miss a thing.SteelEye’s modern data architecture makes it easy to combine data from any channel into a single, compliant and secure repository. Today, SteelEye is the only solution that can natively bring together trades, orders, communications, global news, and market data.The platform’s streamlined surveillance workflow ensures surveillance teams no longer need to look in multiple places to assess risk. Instead, they get a single source of meaningful data. This means complete oversight, a consistent process across global teams, and speedy investigations - giving compliance and surveillance teams get full assurance and peace of mind that are risks are identified and actioned.SteelEye is built on cutting-edge cloud-based technology to deliver unparalleled speed and efficiency, deep intelligence, and enterprise-grade security."},
{"category": "Analytics", "ranking": "275", "app_name": "miserbot", "supported_languages": [], "pricing": null, "app_description": "MiserBot makes it easy for your team to know what’s going on with your AWS cost. It helps you save money and it keeps your team productive.MiserBot tells you how much your AWS cloud is costing you, today - before it's too late to correct anything. It finds the top services and usage types that are driving your AWS cost up."},
{"category": "Analytics", "ranking": "62", "app_name": "Mixpanel", "supported_languages": ["English"], "pricing": "Free", "app_description": "The Mixpanel application for Slack makes it easy to share and collaborate on Mixpanel analyses in Slack.  Simply paste the link to any Insights, Flows, Funnels, or Retention report, and the app will unfurl a high quality image of that report.  Use it to quickly share insights with your team and make data-informed decisions.What is Mixpanel?Mixpanel is a tool that allows you to analyze how users interact with your Internet-connected product. It’s designed to make teams more efficient by allowing everyone to analyze user data in real-time to identify trends, understand user behavior, and make decisions about your product.Mixpanel employs an event-based, user-centric model that connects each interaction to a single user."},
{"category": "Analytics", "ranking": "274", "app_name": "TrackJS", "supported_languages": [], "pricing": null, "app_description": "The Web is the most hostile development environment imaginable. When the frontend inevitably breaks for your visitors, TrackJS helps find and fix your JavaScript errors fast, so you can get back to work.This app is an easy way to allow TrackJS to send your Slack channels error alerts.  Just login to TrackJS, go to your notifications settings, and click \"Add Slack\" under the notification channel list.A paid TrackJS account, or current TrackJS trial account, is required for this application."},
{"category": "Analytics", "ranking": "61", "app_name": "paperboy", "supported_languages": ["English"], "pricing": "Free and paid plans available", "app_description": "paperboy delivers your favorite dashboards from Tableau directly to the conversations you need on Slack. Schedule recurrent dashboard posts or publish a quick information anywhere without leaving your Slack workspace! You can schedule any time and frequency you want (by hour, day, week or monthly) or just select a report and post for yourself and at any channel. paperboy is brought to you by a team of domestiques, working for the benefit of your own team. If you need an extra wheel to unleash your full potential, come ride with us!"}
]